{
    "transformers": 70,
    "time": 174,
    "series": 165,
    "survey": 11,
    "qingsong": 10,
    "tian": 5,
    "chaoli": 2,
    "weiqi": 2,
    "ziqing": 2,
    "junchi": 5,
    "liang": 14,
    "academy": 2,
    "alibaba": 3,
    "group": 2,
    "bellevue": 1,
    "usa": 1,
    "hangzhou": 1,
    "china": 2,
    "cse": 1,
    "moe": 1,
    "key": 6,
    "lab": 1,
    "arti": 2,
    "cial": 4,
    "intelligence": 2,
    "shanghai": 1,
    "jiao": 2,
    "tong": 2,
    "university": 1,
    "wen": 19,
    "zt": 1,
    "zcl": 1,
    "jarvus": 1,
    "cwq": 1,
    "maziqing": 1,
    "mzq": 1,
    "sun": 8,
    "inc": 1,
    "com": 8,
    "yanjunchi": 1,
    "sjtu": 1,
    "edu": 1,
    "cn": 1,
    "abstract": 1,
    "achieved": 1,
    "superior": 3,
    "performances": 3,
    "many": 4,
    "tasks": 21,
    "natural": 3,
    "language": 4,
    "processing": 5,
    "computer": 2,
    "vision": 3,
    "which": 20,
    "also": 13,
    "triggered": 1,
    "great": 4,
    "inter": 2,
    "est": 1,
    "community": 4,
    "among": 4,
    "multiple": 5,
    "advantages": 2,
    "ability": 6,
    "capture": 13,
    "long": 29,
    "range": 7,
    "dependencies": 12,
    "interactions": 2,
    "espe": 1,
    "cially": 1,
    "attractive": 1,
    "modeling": 21,
    "leading": 1,
    "exciting": 1,
    "progress": 1,
    "various": 11,
    "appli": 1,
    "cations": 10,
    "this": 9,
    "paper": 2,
    "systematically": 3,
    "review": 8,
    "transformer": 105,
    "schemes": 3,
    "by": 25,
    "highlighting": 1,
    "their": 7,
    "strengths": 3,
    "well": 3,
    "limitations": 3,
    "particular": 1,
    "examine": 3,
    "development": 1,
    "two": 11,
    "perspectives": 5,
    "from": 15,
    "perspective": 5,
    "network": 21,
    "structure": 5,
    "summarize": 6,
    "adaptations": 1,
    "modi": 9,
    "that": 39,
    "been": 8,
    "made": 3,
    "order": 5,
    "accommodate": 2,
    "chal": 3,
    "lenges": 2,
    "analysis": 14,
    "applications": 12,
    "categorize": 1,
    "trans": 19,
    "formers": 9,
    "based": 28,
    "common": 4,
    "including": 8,
    "forecast": 5,
    "ing": 11,
    "anomaly": 21,
    "detection": 17,
    "classi": 23,
    "cation": 19,
    "empiri": 1,
    "cally": 3,
    "perform": 6,
    "robust": 6,
    "model": 33,
    "size": 8,
    "anal": 1,
    "ysis": 1,
    "seasonal": 13,
    "trend": 14,
    "decomposition": 16,
    "study": 3,
    "how": 7,
    "fi": 1,
    "nally": 1,
    "discuss": 3,
    "suggest": 1,
    "future": 12,
    "directions": 4,
    "provide": 3,
    "useful": 2,
    "research": 6,
    "guidance": 1,
    "corresponding": 1,
    "resource": 1,
    "continuously": 1,
    "updated": 1,
    "found": 3,
    "github": 2,
    "introduction": 2,
    "innovation": 2,
    "deep": 13,
    "learning": 20,
    "vaswani": 8,
    "et": 153,
    "al": 219,
    "brought": 1,
    "interests": 2,
    "recently": 5,
    "due": 3,
    "its": 7,
    "excellent": 1,
    "process": 6,
    "nlp": 6,
    "kenton": 6,
    "others": 4,
    "cv": 6,
    "dosovitskiy": 3,
    "speech": 4,
    "dong": 4,
    "over": 3,
    "past": 3,
    "few": 6,
    "years": 2,
    "numerous": 1,
    "transform": 6,
    "ers": 7,
    "proposed": 8,
    "advance": 1,
    "state": 4,
    "art": 2,
    "per": 1,
    "formances": 1,
    "signi": 4,
    "cantly": 3,
    "there": 6,
    "quite": 2,
    "literature": 2,
    "reviews": 1,
    "different": 14,
    "aspects": 2,
    "such": 15,
    "han": 10,
    "ef": 11,
    "cient": 10,
    "tayet": 2,
    "qingsongedu": 1,
    "reviewtransformers": 1,
    "shown": 8,
    "sequential": 3,
    "data": 28,
    "thus": 4,
    "appealing": 1,
    "variants": 10,
    "address": 1,
    "special": 3,
    "successfully": 1,
    "applied": 3,
    "forecasting": 59,
    "li": 10,
    "zhou": 25,
    "xuet": 5,
    "tuli": 4,
    "zerveas": 6,
    "yang": 13,
    "speci": 6,
    "seasonality": 2,
    "or": 9,
    "pe": 2,
    "riodicity": 1,
    "an": 20,
    "important": 5,
    "feature": 4,
    "effectively": 4,
    "short": 3,
    "temporal": 28,
    "dependency": 10,
    "simultaneously": 2,
    "remains": 2,
    "challenge": 2,
    "wuet": 15,
    "note": 4,
    "exist": 1,
    "several": 4,
    "surveys": 4,
    "related": 1,
    "lim": 8,
    "zohren": 3,
    "benidis": 3,
    "torres": 3,
    "mail": 1,
    "fawaz": 3,
    "choi": 3,
    "bl": 3,
    "azquez": 3,
    "garc": 3,
    "iaet": 2,
    "augmenta": 1,
    "tion": 11,
    "but": 8,
    "comprehensive": 2,
    "sur": 1,
    "vey": 1,
    "emerging": 1,
    "subject": 1,
    "systematic": 1,
    "would": 3,
    "greatly": 1,
    "bene": 5,
    "aim": 2,
    "ll": 1,
    "gap": 1,
    "summarizing": 1,
    "main": 5,
    "developments": 2,
    "rst": 6,
    "give": 1,
    "brief": 1,
    "about": 4,
    "vanilla": 17,
    "then": 6,
    "propose": 1,
    "new": 7,
    "taxonomy": 6,
    "both": 10,
    "application": 6,
    "domains": 3,
    "improve": 8,
    "ments": 2,
    "low": 5,
    "level": 21,
    "module": 28,
    "high": 4,
    "architecture": 20,
    "with": 70,
    "optimize": 1,
    "performance": 18,
    "analyze": 3,
    "popular": 6,
    "each": 11,
    "insights": 1,
    "practical": 2,
    "guidelines": 2,
    "use": 4,
    "conduct": 2,
    "extensive": 1,
    "empirical": 3,
    "studies": 11,
    "robustness": 4,
    "conclude": 2,
    "work": 9,
    "discussing": 1,
    "possible": 2,
    "cluding": 1,
    "inductive": 6,
    "biases": 4,
    "gnn": 3,
    "pre": 17,
    "trained": 13,
    "transformersarxiv": 1,
    "cs": 1,
    "lg": 1,
    "may": 1,
    "nas": 4,
    "best": 4,
    "our": 2,
    "knowledge": 3,
    "comprehensively": 1,
    "hope": 1,
    "will": 3,
    "ignite": 1,
    "further": 3,
    "preliminaries": 1,
    "follows": 2,
    "most": 3,
    "competitive": 2,
    "neural": 13,
    "sequence": 15,
    "models": 24,
    "encoder": 7,
    "decoder": 8,
    "composed": 1,
    "multi": 18,
    "ple": 2,
    "identical": 1,
    "blocks": 3,
    "block": 7,
    "consists": 3,
    "head": 9,
    "self": 22,
    "attention": 58,
    "position": 7,
    "wise": 5,
    "feed": 4,
    "forward": 5,
    "while": 4,
    "inserts": 2,
    "cross": 11,
    "between": 6,
    "input": 19,
    "encoding": 20,
    "positional": 23,
    "unlike": 1,
    "lstm": 2,
    "rnn": 2,
    "recur": 1,
    "rence": 1,
    "instead": 4,
    "it": 36,
    "utilizes": 3,
    "added": 3,
    "embeddings": 6,
    "information": 10,
    "some": 7,
    "encodings": 3,
    "below": 1,
    "absolute": 2,
    "index": 2,
    "vector": 2,
    "given": 3,
    "sin": 2,
    "cos": 1,
    "where": 8,
    "iis": 1,
    "hand": 2,
    "crafted": 2,
    "frequency": 6,
    "dimension": 9,
    "another": 1,
    "way": 6,
    "learn": 4,
    "set": 3,
    "more": 14,
    "exible": 3,
    "gehring": 3,
    "relative": 5,
    "following": 6,
    "intuition": 1,
    "pairwise": 2,
    "relationships": 4,
    "elements": 2,
    "than": 2,
    "positions": 2,
    "methods": 6,
    "example": 1,
    "one": 8,
    "add": 1,
    "learnable": 5,
    "embedding": 8,
    "keys": 5,
    "mechanism": 7,
    "shaw": 3,
    "besides": 5,
    "using": 7,
    "hybrid": 1,
    "combine": 5,
    "them": 2,
    "together": 3,
    "keet": 2,
    "generally": 1,
    "po": 1,
    "sitional": 1,
    "token": 3,
    "fed": 2,
    "query": 1,
    "value": 1,
    "qkv": 1,
    "scaled": 1,
    "dot": 1,
    "product": 1,
    "used": 5,
    "softmax": 1,
    "qkt": 1,
    "vdk": 1,
    "queries": 6,
    "rn": 1,
    "dk": 3,
    "rm": 2,
    "values": 3,
    "dv": 1,
    "denote": 1,
    "lengths": 1,
    "dvdenote": 1,
    "dimensions": 2,
    "uses": 5,
    "serie": 1,
    "stran": 1,
    "sform": 1,
    "ersne": 1,
    "twork": 1,
    "detec": 3,
    "tionc": 1,
    "lassi": 1,
    "ficat": 1,
    "ionti": 1,
    "me": 1,
    "forecastingspatio": 1,
    "forecastingevent": 1,
    "forecastingvanilla": 1,
    "encodinglearnable": 1,
    "encodingtimestamp": 1,
    "encodingfigure": 1,
    "withhdifferent": 1,
    "sets": 1,
    "learned": 3,
    "projections": 1,
    "gle": 1,
    "function": 2,
    "multiheadattn": 1,
    "concat": 1,
    "wo": 1,
    "qwq": 1,
    "kwk": 1,
    "vwv": 1,
    "residual": 2,
    "fully": 6,
    "connected": 3,
    "ffn": 2,
    "relu": 1,
    "outputs": 1,
    "previous": 2,
    "layer": 9,
    "rdm": 1,
    "df": 1,
    "rdf": 2,
    "dm": 1,
    "rdmare": 1,
    "trainable": 1,
    "pa": 1,
    "rameters": 1,
    "deeper": 3,
    "connection": 1,
    "followed": 1,
    "normalization": 2,
    "inserted": 1,
    "around": 1,
    "layernorm": 3,
    "selfattn": 2,
    "denotes": 2,
    "operation": 2,
    "existing": 5,
    "pro": 2,
    "pose": 1,
    "illustrated": 1,
    "fig": 1,
    "changes": 2,
    "ac": 1,
    "commodate": 1,
    "challenges": 1,
    "classify": 1,
    "sections": 1,
    "delve": 1,
    "into": 18,
    "these": 7,
    "ordering": 2,
    "matters": 1,
    "impor": 2,
    "tance": 1,
    "encode": 4,
    "design": 13,
    "infor": 3,
    "mation": 3,
    "vectors": 3,
    "inject": 1,
    "anadditional": 1,
    "obtain": 1,
    "when": 6,
    "divided": 1,
    "three": 4,
    "categories": 3,
    "works": 10,
    "liet": 8,
    "simply": 1,
    "introduce": 4,
    "section": 4,
    "though": 2,
    "approach": 2,
    "extract": 3,
    "they": 5,
    "were": 2,
    "unable": 1,
    "exploit": 3,
    "tant": 1,
    "features": 2,
    "posi": 2,
    "tional": 2,
    "less": 2,
    "expressive": 1,
    "adap": 1,
    "tive": 1,
    "appropriate": 1,
    "much": 2,
    "effective": 5,
    "compared": 4,
    "xed": 4,
    "adapt": 1,
    "spe": 1,
    "ci": 1,
    "introduces": 3,
    "learns": 1,
    "jointly": 1,
    "other": 1,
    "parameters": 5,
    "em": 2,
    "beddings": 1,
    "better": 11,
    "timestamp": 3,
    "real": 3,
    "world": 1,
    "scenarios": 1,
    "monly": 1,
    "accessible": 1,
    "calendar": 1,
    "timestamps": 4,
    "sec": 1,
    "ond": 1,
    "minute": 1,
    "hour": 1,
    "week": 1,
    "month": 1,
    "year": 1,
    "times": 4,
    "tamps": 2,
    "holidays": 1,
    "events": 8,
    "informative": 1,
    "hardly": 1,
    "leveraged": 1,
    "mitigate": 1,
    "issue": 1,
    "informer": 8,
    "additional": 2,
    "layers": 8,
    "similar": 6,
    "scheme": 1,
    "was": 1,
    "autoformer": 10,
    "fedformer": 9,
    "central": 1,
    "viewed": 1,
    "weights": 2,
    "dynamically": 1,
    "generated": 1,
    "similarity": 2,
    "put": 1,
    "patterns": 5,
    "result": 4,
    "shares": 2,
    "same": 2,
    "maximum": 1,
    "path": 2,
    "length": 8,
    "num": 1,
    "ber": 1,
    "making": 3,
    "suitable": 1,
    "term": 11,
    "show": 2,
    "mod": 5,
    "ule": 3,
    "memory": 7,
    "plexity": 3,
    "ofo": 1,
    "nis": 1,
    "becomes": 1,
    "computational": 4,
    "bottleneck": 2,
    "dealing": 2,
    "sequences": 3,
    "reduce": 2,
    "quadratic": 2,
    "complexity": 9,
    "ed": 1,
    "explicitly": 1,
    "introducing": 3,
    "sparsity": 2,
    "bias": 8,
    "like": 3,
    "logtrans": 6,
    "pyraformer": 7,
    "liuet": 10,
    "exploring": 4,
    "rank": 2,
    "property": 1,
    "matrix": 1,
    "speed": 1,
    "computa": 1,
    "table": 8,
    "shows": 5,
    "eling": 2,
    "details": 1,
    "discussed": 1,
    "comparisons": 4,
    "modules": 7,
    "methodstraining": 1,
    "testing": 1,
    "steps": 3,
    "nlogn": 7,
    "quatformer": 2,
    "chen": 23,
    "crossformer": 1,
    "zhang": 25,
    "yan": 12,
    "individual": 1,
    "number": 4,
    "seek": 1,
    "renovate": 1,
    "archi": 3,
    "tecture": 2,
    "recent": 5,
    "hierarchical": 3,
    "architec": 1,
    "ture": 1,
    "take": 1,
    "account": 2,
    "resolution": 1,
    "aspect": 1,
    "max": 2,
    "pooling": 1,
    "stride": 1,
    "down": 1,
    "sample": 1,
    "half": 1,
    "slice": 1,
    "liu": 12,
    "designs": 11,
    "ary": 1,
    "tree": 3,
    "mecha": 2,
    "nism": 2,
    "nodes": 2,
    "nest": 1,
    "scale": 9,
    "correspond": 1,
    "orig": 1,
    "inal": 1,
    "coarser": 1,
    "scales": 3,
    "represent": 1,
    "lower": 2,
    "resolutions": 3,
    "developed": 2,
    "intra": 1,
    "attentions": 3,
    "tem": 3,
    "poral": 3,
    "across": 1,
    "integrate": 2,
    "enjoys": 1,
    "ts": 2,
    "computation": 1,
    "particularly": 1,
    "here": 4,
    "types": 2,
    "spatial": 12,
    "event": 7,
    "lot": 4,
    "done": 1,
    "latest": 1,
    "large": 3,
    "former": 14,
    "majority": 1,
    "date": 1,
    "architectures": 2,
    "minor": 1,
    "researchers": 3,
    "summarized": 1,
    "designing": 1,
    "innovative": 1,
    "normalize": 2,
    "utilizing": 6,
    "inputs": 2,
    "figure": 3,
    "type": 5,
    "variant": 4,
    "category": 2,
    "largest": 1,
    "proportion": 1,
    "describe": 2,
    "six": 1,
    "typical": 2,
    "categorization": 1,
    "ast": 2,
    "quat": 1,
    "approximation": 1,
    "remove": 1,
    "noise": 3,
    "achieve": 6,
    "cal": 1,
    "culation": 1,
    "proposes": 7,
    "con": 3,
    "volutional": 1,
    "employing": 1,
    "causal": 2,
    "convolutions": 1,
    "generate": 1,
    "sparse": 4,
    "logsparse": 1,
    "mask": 1,
    "reduces": 1,
    "too": 1,
    "explicit": 2,
    "selects": 2,
    "dominant": 2,
    "similarities": 1,
    "achieving": 1,
    "de": 3,
    "signs": 1,
    "generative": 6,
    "style": 2,
    "produce": 2,
    "fore": 6,
    "casting": 5,
    "directly": 2,
    "avoids": 1,
    "accumulative": 1,
    "error": 2,
    "us": 2,
    "step": 4,
    "prediction": 10,
    "adversarial": 6,
    "framework": 4,
    "train": 3,
    "training": 7,
    "shaping": 1,
    "output": 3,
    "distribution": 1,
    "avoid": 2,
    "accumula": 1,
    "through": 7,
    "ahead": 1,
    "inference": 4,
    "pyramidal": 2,
    "binary": 1,
    "ranges": 1,
    "linear": 4,
    "mem": 1,
    "ory": 1,
    "applies": 3,
    "tention": 4,
    "domain": 2,
    "fourier": 1,
    "form": 1,
    "wavelet": 1,
    "achieves": 6,
    "complex": 3,
    "ity": 3,
    "randomly": 1,
    "selecting": 1,
    "subset": 1,
    "success": 1,
    "attracted": 1,
    "explore": 1,
    "mechanisms": 1,
    "rotate": 2,
    "lra": 2,
    "quaternions": 1,
    "period": 1,
    "phase": 1,
    "depict": 1,
    "tricate": 1,
    "periodical": 2,
    "moreover": 3,
    "decouples": 1,
    "global": 4,
    "focus": 3,
    "building": 1,
    "interpretation": 1,
    "explainable": 1,
    "xai": 1,
    "tft": 1,
    "horizon": 2,
    "static": 1,
    "covariate": 1,
    "encoders": 2,
    "gating": 2,
    "selection": 1,
    "encodes": 1,
    "covariates": 1,
    "preserves": 1,
    "interpretability": 1,
    "incorporating": 2,
    "protran": 2,
    "tang": 5,
    "matteson": 3,
    "ssdnet": 3,
    "linet": 2,
    "space": 4,
    "probabilistic": 1,
    "forecasts": 1,
    "proce": 1,
    "dure": 1,
    "variational": 4,
    "pattern": 2,
    "estimate": 1,
    "param": 1,
    "eters": 1,
    "ssm": 2,
    "maintain": 2,
    "interpretable": 2,
    "second": 1,
    "non": 2,
    "stationary": 4,
    "only": 3,
    "mainly": 3,
    "focuses": 1,
    "modifying": 1,
    "normal": 1,
    "ization": 1,
    "explores": 1,
    "stationarization": 1,
    "problem": 1,
    "relatively": 1,
    "simple": 4,
    "plugin": 1,
    "modify": 2,
    "boost": 2,
    "third": 1,
    "adopts": 1,
    "segmentation": 1,
    "representation": 1,
    "devises": 2,
    "ar": 1,
    "chitecture": 1,
    "auto": 4,
    "correlation": 3,
    "working": 1,
    "measures": 1,
    "delay": 1,
    "signal": 2,
    "aggre": 1,
    "gates": 1,
    "top": 1,
    "sub": 1,
    "reduced": 1,
    "patchtst": 2,
    "nie": 2,
    "channel": 6,
    "independent": 2,
    "contains": 2,
    "single": 1,
    "univariate": 1,
    "within": 1,
    "subseries": 2,
    "patch": 2,
    "seg": 1,
    "mentation": 1,
    "patches": 1,
    "served": 1,
    "tokens": 1,
    "vit": 1,
    "dosovit": 1,
    "skiy": 1,
    "alike": 1,
    "improves": 2,
    "numerical": 3,
    "perfor": 3,
    "mance": 3,
    "multivariate": 11,
    "embedded": 1,
    "array": 1,
    "novel": 1,
    "segment": 1,
    "bedding": 1,
    "preserve": 1,
    "stage": 2,
    "ciently": 2,
    "start": 1,
    "beyond": 3,
    "scope": 1,
    "triformer": 3,
    "cirstea": 3,
    "triangular": 2,
    "variable": 3,
    "later": 2,
    "shrinks": 1,
    "exponentially": 1,
    "lightweight": 2,
    "scaleformer": 2,
    "shabani": 3,
    "baseline": 2,
    "etc": 1,
    "iteratively": 1,
    "re": 3,
    "ning": 3,
    "casted": 1,
    "shared": 1,
    "remarks": 1,
    "dlinear": 2,
    "zeng": 3,
    "questions": 1,
    "necessity": 1,
    "simpler": 1,
    "mlp": 1,
    "results": 8,
    "base": 1,
    "lines": 1,
    "however": 2,
    "notice": 1,
    "cent": 1,
    "nieet": 3,
    "thorough": 1,
    "oretical": 1,
    "yun": 4,
    "showing": 1,
    "universal": 4,
    "approximators": 1,
    "functions": 3,
    "overclaim": 1,
    "question": 3,
    "poten": 1,
    "tial": 1,
    "any": 2,
    "method": 2,
    "solely": 1,
    "experimental": 3,
    "instanti": 1,
    "ations": 1,
    "especially": 2,
    "already": 1,
    "demonstrate": 1,
    "machine": 3,
    "therefore": 3,
    "summariz": 1,
    "necessary": 1,
    "whole": 2,
    "spatio": 7,
    "taken": 1,
    "accurate": 1,
    "traf": 6,
    "caiet": 3,
    "graph": 10,
    "ow": 2,
    "takes": 1,
    "convolu": 1,
    "yuet": 2,
    "convolution": 3,
    "able": 2,
    "complicated": 2,
    "pedestrian": 1,
    "trajectory": 2,
    "earthformer": 3,
    "gao": 6,
    "cuboid": 2,
    "decomposes": 1,
    "cuboids": 1,
    "parallel": 1,
    "weather": 1,
    "climate": 1,
    "airformer": 2,
    "dartboard": 1,
    "correlations": 1,
    "respectively": 2,
    "fur": 1,
    "thermore": 1,
    "enhances": 1,
    "latent": 2,
    "variables": 1,
    "uncertainty": 1,
    "air": 2,
    "quality": 3,
    "irregular": 1,
    "asynchronous": 1,
    "naturally": 1,
    "observed": 1,
    "life": 1,
    "contrast": 1,
    "regular": 1,
    "equal": 1,
    "sampling": 1,
    "intervals": 3,
    "aims": 1,
    "predict": 1,
    "marks": 1,
    "tory": 2,
    "often": 3,
    "modeled": 2,
    "point": 3,
    "processes": 3,
    "tpp": 2,
    "yanet": 2,
    "shchur": 3,
    "incorporate": 1,
    "diction": 1,
    "attentive": 4,
    "hawkes": 4,
    "sahp": 2,
    "thp": 2,
    "zuo": 2,
    "adopt": 3,
    "summarizethe": 1,
    "uence": 2,
    "historical": 1,
    "compute": 1,
    "intensity": 1,
    "en": 2,
    "coding": 1,
    "translating": 1,
    "sinusoidal": 1,
    "utilized": 1,
    "named": 1,
    "datalog": 1,
    "ndtt": 1,
    "mei": 2,
    "extend": 1,
    "experiments": 5,
    "sophisticated": 1,
    "se": 4,
    "ries": 3,
    "task": 3,
    "brings": 2,
    "xu": 16,
    "tranad": 4,
    "mt": 6,
    "rv": 6,
    "ae": 8,
    "wang": 21,
    "transanomaly": 3,
    "posed": 1,
    "aes": 1,
    "kingma": 3,
    "welling": 3,
    "gans": 1,
    "good": 2,
    "fellow": 1,
    "elaborate": 1,
    "part": 2,
    "procedure": 3,
    "amplify": 1,
    "reconstruction": 4,
    "errors": 1,
    "sim": 1,
    "tends": 1,
    "miss": 1,
    "small": 1,
    "devia": 1,
    "gan": 1,
    "designed": 4,
    "decoders": 1,
    "gain": 1,
    "stability": 1,
    "ablation": 2,
    "if": 1,
    "replaced": 1,
    "score": 2,
    "drops": 1,
    "nearly": 2,
    "indicating": 1,
    "effect": 1,
    "share": 1,
    "purposes": 2,
    "combines": 3,
    "allow": 1,
    "parallelization": 1,
    "costs": 1,
    "multiscale": 1,
    "overcomes": 1,
    "shortcomings": 1,
    "traditional": 1,
    "local": 1,
    "extracted": 1,
    "gta": 3,
    "variate": 1,
    "insuf": 1,
    "close": 1,
    "neu": 1,
    "ral": 1,
    "does": 2,
    "not": 3,
    "deal": 1,
    "es": 1,
    "propagation": 1,
    "consid": 1,
    "yet": 2,
    "replacing": 1,
    "branch": 1,
    "combination": 2,
    "neighborhood": 1,
    "anomalytrans": 2,
    "gaussian": 1,
    "prior": 3,
    "association": 5,
    "make": 2,
    "anomalies": 2,
    "dis": 1,
    "tinguishable": 1,
    "sharing": 1,
    "motivation": 1,
    "anom": 1,
    "alytrans": 1,
    "goal": 1,
    "insight": 1,
    "harder": 1,
    "build": 1,
    "strong": 1,
    "associations": 1,
    "easier": 1,
    "adjacent": 1,
    "points": 1,
    "pared": 1,
    "normality": 1,
    "loss": 1,
    "optimized": 2,
    "minimax": 1,
    "strategy": 1,
    "constrain": 1,
    "associa": 1,
    "tions": 1,
    "distinguishable": 1,
    "discrepancy": 2,
    "proved": 1,
    "prominent": 1,
    "capability": 1,
    "captur": 1,
    "gtn": 1,
    "tower": 2,
    "merge": 2,
    "towers": 1,
    "weighted": 1,
    "concatenation": 1,
    "known": 1,
    "extension": 1,
    "ruwurm": 3,
    "orner": 3,
    "studied": 1,
    "raw": 3,
    "optical": 3,
    "satellite": 4,
    "obtained": 1,
    "recurrent": 1,
    "convolutional": 2,
    "networks": 6,
    "tarnet": 2,
    "chowdhury": 3,
    "aware": 2,
    "augments": 1,
    "masking": 1,
    "recon": 1,
    "struction": 1,
    "investigated": 2,
    "ca": 2,
    "yuan": 6,
    "lin": 10,
    "image": 5,
    "au": 1,
    "thors": 1,
    "supervised": 2,
    "schema": 1,
    "because": 1,
    "ited": 1,
    "labeled": 1,
    "introduced": 2,
    "unsu": 2,
    "pervised": 2,
    "proportionally": 1,
    "masked": 1,
    "ne": 1,
    "tuned": 1,
    "downstream": 2,
    "problems": 1,
    "generates": 1,
    "datasets": 1,
    "evaluation": 2,
    "discussion": 1,
    "preliminary": 1,
    "lenging": 1,
    "benchmark": 1,
    "dataset": 5,
    "since": 2,
    "classic": 1,
    "statistical": 2,
    "arima": 1,
    "ets": 1,
    "hyndman": 3,
    "khandakar": 3,
    "basic": 1,
    "cnn": 1,
    "inferior": 1,
    "gurations": 1,
    "above": 1,
    "carefully": 2,
    "calculation": 1,
    "practically": 1,
    "reported": 1,
    "makes": 2,
    "actual": 1,
    "usage": 1,
    "experiment": 5,
    "prolonging": 4,
    "verify": 1,
    "power": 2,
    "compare": 2,
    "modeltable": 1,
    "mse": 4,
    "reformer": 3,
    "logformerinput": 1,
    "logformerlayer": 1,
    "oom": 1,
    "deteriorates": 1,
    "quickly": 1,
    "phenomenon": 2,
    "care": 1,
    "impractical": 1,
    "cannot": 1,
    "utilize": 3,
    "need": 2,
    "before": 1,
    "being": 2,
    "eld": 1,
    "predic": 1,
    "communities": 1,
    "oth": 1,
    "holds": 1,
    "elds": 1,
    "increase": 2,
    "increasing": 1,
    "usually": 1,
    "capacity": 2,
    "controlled": 1,
    "commonly": 1,
    "numbers": 1,
    "raises": 1,
    "proper": 1,
    "begin": 1,
    "realize": 1,
    "cleveland": 5,
    "crucial": 1,
    "moving": 1,
    "average": 1,
    "test": 1,
    "seen": 1,
    "unique": 1,
    "boosting": 1,
    "seems": 1,
    "consistent": 1,
    "worth": 3,
    "investigating": 1,
    "advanced": 1,
    "decompo": 1,
    "sition": 1,
    "opportunities": 1,
    "highlight": 2,
    "potentially": 1,
    "promising": 1,
    "ori": 7,
    "means": 2,
    "original": 1,
    "version": 1,
    "without": 1,
    "decomp": 7,
    "performed": 1,
    "promotion": 1,
    "relativeout": 1,
    "assumptions": 1,
    "characteristics": 2,
    "although": 1,
    "general": 1,
    "dependen": 1,
    "cies": 1,
    "comes": 1,
    "price": 1,
    "lots": 1,
    "needed": 1,
    "generalization": 1,
    "tting": 1,
    "periodic": 1,
    "periodicity": 2,
    "fre": 1,
    "quency": 1,
    "enhance": 1,
    "interesting": 2,
    "seemly": 1,
    "opposite": 1,
    "ductive": 1,
    "improvement": 1,
    "removes": 1,
    "experi": 1,
    "mental": 1,
    "clearly": 1,
    "signals": 1,
    "paradigm": 1,
    "clever": 1,
    "suppress": 1,
    "still": 1,
    "desired": 1,
    "direc": 1,
    "consider": 2,
    "ways": 1,
    "induce": 1,
    "understanding": 2,
    "becoming": 1,
    "increasingly": 1,
    "calling": 1,
    "techniques": 1,
    "handle": 1,
    "dimensionality": 1,
    "abil": 1,
    "underlying": 1,
    "dimen": 1,
    "sions": 1,
    "gnns": 2,
    "di": 2,
    "mensions": 1,
    "demonstrated": 1,
    "could": 1,
    "bring": 1,
    "cant": 1,
    "improvements": 1,
    "modal": 1,
    "understand": 1,
    "dynamics": 1,
    "causality": 1,
    "direction": 3,
    "signif": 1,
    "icantly": 1,
    "boosted": 1,
    "brown": 3,
    "limited": 1,
    "stud": 1,
    "ies": 1,
    "develop": 1,
    "appro": 1,
    "priate": 1,
    "examined": 1,
    "tain": 1,
    "might": 1,
    "borrow": 1,
    "idea": 1,
    "mehta": 3,
    "connectivity": 1,
    "bapna": 3,
    "adaptive": 1,
    "putation": 1,
    "dehghani": 4,
    "xin": 2,
    "recurrence": 2,
    "daiet": 2,
    "hyper": 2,
    "heads": 1,
    "largely": 1,
    "affect": 1,
    "manual": 1,
    "guring": 1,
    "consuming": 1,
    "suboptimal": 1,
    "automl": 1,
    "technique": 2,
    "search": 3,
    "elsken": 3,
    "discovering": 2,
    "tectures": 1,
    "automating": 1,
    "soet": 2,
    "industry": 1,
    "automatically": 1,
    "importance": 1,
    "conclusion": 1,
    "provided": 1,
    "organize": 1,
    "reviewed": 1,
    "consisting": 1,
    "represen": 1,
    "tative": 1,
    "references": 1,
    "ankur": 1,
    "mia": 1,
    "orhan": 1,
    "firat": 1,
    "cao": 1,
    "yonghui": 1,
    "wu": 6,
    "translation": 1,
    "transparent": 1,
    "emnlp": 1,
    "konstantinos": 1,
    "syama": 1,
    "sundar": 1,
    "ranga": 1,
    "puram": 1,
    "valentin": 1,
    "flunkert": 1,
    "yuyang": 1,
    "danielle": 1,
    "maddix": 1,
    "tutorial": 1,
    "acm": 3,
    "computing": 3,
    "ane": 1,
    "ia": 1,
    "angel": 1,
    "conde": 1,
    "usue": 1,
    "mori": 1,
    "outlier": 1,
    "tom": 1,
    "benjamin": 1,
    "mann": 1,
    "nick": 1,
    "ryder": 1,
    "melanie": 1,
    "subbiah": 1,
    "jared": 1,
    "kaplan": 1,
    "prafulla": 1,
    "dhariwal": 1,
    "lan": 2,
    "guage": 2,
    "shot": 1,
    "learners": 1,
    "neurips": 10,
    "ling": 2,
    "cai": 1,
    "krzysztof": 1,
    "janowicz": 1,
    "gengchen": 1,
    "mai": 1,
    "bo": 2,
    "rui": 1,
    "zhu": 2,
    "capturing": 1,
    "conti": 1,
    "nuity": 1,
    "actions": 1,
    "gis": 1,
    "hanting": 2,
    "yunhe": 2,
    "tianyu": 1,
    "guo": 4,
    "chang": 2,
    "yiping": 1,
    "deng": 1,
    "zhenhua": 2,
    "siwei": 1,
    "ma": 4,
    "chunjing": 1,
    "cvpr": 2,
    "minghao": 2,
    "houwen": 1,
    "peng": 3,
    "jianlong": 1,
    "fu": 1,
    "haibin": 1,
    "searching": 1,
    "vi": 1,
    "sual": 1,
    "recognition": 3,
    "zekai": 1,
    "dingshuo": 1,
    "xiao": 6,
    "zix": 1,
    "uan": 1,
    "xiuzhen": 1,
    "cheng": 1,
    "structures": 1,
    "iot": 1,
    "ieee": 4,
    "internet": 1,
    "things": 1,
    "journal": 5,
    "wenwei": 1,
    "bingqing": 1,
    "quaternion": 1,
    "kdd": 6,
    "kukjin": 1,
    "jihun": 1,
    "yi": 4,
    "changhwa": 1,
    "park": 1,
    "sungroh": 1,
    "yoon": 1,
    "access": 1,
    "ranak": 1,
    "roy": 1,
    "xiyuan": 1,
    "jingbo": 1,
    "shang": 1,
    "rajesh": 1,
    "gupta": 1,
    "dezhi": 1,
    "hong": 1,
    "razvan": 1,
    "gabriel": 1,
    "chenjuan": 1,
    "bin": 1,
    "tung": 1,
    "kieu": 1,
    "xuanyi": 1,
    "shirui": 1,
    "pan": 1,
    "tri": 1,
    "angular": 1,
    "multivari": 1,
    "ate": 1,
    "ijcai": 4,
    "robert": 1,
    "william": 1,
    "jean": 2,
    "mcrae": 1,
    "stl": 1,
    "loess": 1,
    "statistics": 1,
    "zihang": 1,
    "dai": 2,
    "zhilin": 1,
    "yiming": 1,
    "jaime": 1,
    "carbonell": 1,
    "quoc": 2,
    "le": 2,
    "xl": 1,
    "context": 1,
    "acl": 2,
    "mostafa": 2,
    "stephan": 2,
    "gouws": 1,
    "oriol": 1,
    "vinyals": 1,
    "jakob": 3,
    "uszkoreit": 3,
    "lukasz": 2,
    "kaiser": 2,
    "iclr": 12,
    "linhao": 1,
    "shuang": 1,
    "icassp": 1,
    "alexey": 1,
    "lucas": 1,
    "beyer": 1,
    "alexander": 1,
    "kolesnikov": 1,
    "dirk": 1,
    "weissenborn": 1,
    "xiaohua": 1,
    "zhai": 1,
    "thomas": 2,
    "unterthiner": 1,
    "words": 2,
    "jan": 1,
    "hendrik": 1,
    "metzen": 1,
    "frank": 1,
    "hutter": 1,
    "zhihan": 1,
    "xingjian": 1,
    "shi": 1,
    "hao": 1,
    "bernie": 1,
    "mu": 1,
    "earth": 1,
    "system": 1,
    "jonas": 1,
    "michael": 1,
    "auli": 1,
    "david": 5,
    "grang": 1,
    "ier": 1,
    "denis": 1,
    "yarats": 1,
    "yann": 1,
    "dauphin": 1,
    "icml": 5,
    "goodfellow": 2,
    "ian": 1,
    "pouget": 1,
    "abadie": 1,
    "mehdi": 1,
    "mirza": 1,
    "bing": 1,
    "warde": 1,
    "farley": 1,
    "sherjil": 1,
    "ozair": 1,
    "nets": 1,
    "zhengyan": 1,
    "ding": 2,
    "yuxian": 1,
    "gu": 1,
    "yuqi": 2,
    "huo": 1,
    "jiezhong": 1,
    "qiu": 1,
    "present": 1,
    "ai": 1,
    "open": 1,
    "kai": 2,
    "xinghao": 1,
    "jianyuan": 1,
    "yehui": 1,
    "tpami": 1,
    "rob": 1,
    "yeasmin": 1,
    "automatic": 1,
    "pack": 1,
    "age": 1,
    "software": 1,
    "ismail": 2,
    "hassan": 1,
    "germain": 1,
    "forestier": 1,
    "jonathan": 1,
    "weber": 1,
    "lhassane": 1,
    "idoumghar": 1,
    "pierre": 1,
    "alain": 1,
    "muller": 1,
    "mining": 2,
    "discovery": 1,
    "guolin": 1,
    "ke": 3,
    "he": 3,
    "tie": 1,
    "rethinking": 1,
    "jacob": 1,
    "devlin": 1,
    "ming": 4,
    "wei": 3,
    "bert": 2,
    "bidirectional": 1,
    "naacl": 2,
    "hlt": 1,
    "diederik": 1,
    "bayes": 1,
    "shiyang": 1,
    "xiaoyong": 1,
    "jin": 2,
    "yao": 2,
    "xuan": 1,
    "xiyou": 1,
    "wenhu": 1,
    "yu": 6,
    "xiang": 1,
    "xifeng": 1,
    "enhancing": 1,
    "locality": 1,
    "breaking": 1,
    "longyuan": 1,
    "jian": 1,
    "wenliang": 1,
    "tianjun": 1,
    "wipf": 1,
    "zheng": 2,
    "grin": 1,
    "relation": 1,
    "intention": 1,
    "agent": 1,
    "trajec": 1,
    "yuxuan": 1,
    "yutong": 1,
    "xia": 2,
    "songyu": 1,
    "yiwei": 1,
    "junbo": 1,
    "roger": 1,
    "zim": 1,
    "mermann": 1,
    "predicting": 1,
    "nationwide": 1,
    "aaai": 4,
    "bryan": 2,
    "stefan": 1,
    "philosophical": 1,
    "transactions": 1,
    "royal": 1,
    "society": 1,
    "sercan": 1,
    "arik": 1,
    "nicolas": 1,
    "loeff": 1,
    "tomas": 1,
    "ster": 1,
    "fusion": 1,
    "international": 1,
    "irena": 1,
    "koprinska": 1,
    "mashud": 1,
    "rana": 1,
    "icdm": 1,
    "shengqi": 1,
    "ren": 2,
    "siyuan": 1,
    "jiahui": 1,
    "yizhou": 1,
    "zhiguang": 1,
    "song": 4,
    "gated": 1,
    "arxiv": 4,
    "preprint": 2,
    "shizhan": 1,
    "hang": 1,
    "cong": 1,
    "liao": 1,
    "jianguo": 1,
    "weiyao": 2,
    "alex": 1,
    "schahram": 1,
    "dustdar": 1,
    "yong": 1,
    "haixu": 3,
    "jianmin": 3,
    "sheng": 3,
    "station": 1,
    "arity": 1,
    "sachin": 1,
    "marjan": 1,
    "ghazvininejad": 1,
    "srini": 1,
    "iyer": 1,
    "luke": 1,
    "zettlemoyer": 1,
    "hannaneh": 1,
    "hajishirzi": 1,
    "delight": 1,
    "light": 1,
    "weight": 1,
    "meiet": 1,
    "hongyuan": 2,
    "chenghao": 1,
    "jason": 1,
    "eis": 1,
    "ner": 1,
    "irregularly": 1,
    "spaced": 1,
    "participants": 1,
    "nam": 1,
    "nguyen": 1,
    "phanwadee": 1,
    "sinthong": 1,
    "jayant": 1,
    "kalagnanam": 1,
    "marc": 1,
    "marco": 1,
    "isprs": 1,
    "photogramm": 1,
    "remote": 1,
    "sens": 1,
    "amin": 1,
    "amir": 1,
    "abdi": 1,
    "lili": 1,
    "meng": 1,
    "tristan": 1,
    "sylvain": 1,
    "iterative": 1,
    "peter": 1,
    "ashish": 2,
    "representations": 1,
    "oleksandr": 1,
    "ali": 1,
    "caner": 1,
    "urkmen": 1,
    "tim": 1,
    "januschowski": 1,
    "unnemann": 1,
    "so": 1,
    "evolved": 1,
    "binh": 1,
    "proba": 1,
    "bilistic": 1,
    "tay": 1,
    "dara": 1,
    "bahri": 1,
    "don": 1,
    "ald": 1,
    "metzler": 1,
    "jos": 1,
    "dalil": 1,
    "hadjout": 1,
    "abderrazak": 1,
    "baa": 1,
    "francisco": 1,
    "mart": 1,
    "inez": 1,
    "alvarez": 1,
    "alicia": 1,
    "troncoso": 1,
    "big": 1,
    "tuliet": 1,
    "shreshth": 1,
    "giuliano": 1,
    "casale": 1,
    "nicholas": 1,
    "jennings": 1,
    "tection": 1,
    "vldb": 1,
    "noam": 1,
    "shazeer": 1,
    "niki": 1,
    "par": 1,
    "mar": 1,
    "llion": 1,
    "jones": 1,
    "aidan": 1,
    "gomez": 1,
    "you": 1,
    "xiaoxing": 1,
    "chao": 2,
    "xue": 3,
    "xi": 2,
    "aokang": 1,
    "yonggang": 1,
    "hu": 1,
    "mergenas": 1,
    "operations": 1,
    "differentiable": 1,
    "xixuan": 1,
    "dechang": 1,
    "pi": 1,
    "xiangyan": 1,
    "measurement": 1,
    "page": 1,
    "jingkun": 2,
    "xiaomin": 2,
    "huan": 2,
    "robuststl": 2,
    "algorithm": 1,
    "zhe": 1,
    "fast": 1,
    "decom": 1,
    "yingying": 1,
    "min": 1,
    "robustperiod": 1,
    "periodicities": 1,
    "sigmod": 1,
    "fan": 1,
    "augmentation": 1,
    "linxiao": 1,
    "dustrial": 1,
    "sifan": 1,
    "qianggang": 1,
    "peilin": 1,
    "zhao": 3,
    "ying": 1,
    "junzhou": 1,
    "huang": 1,
    "zhanghao": 1,
    "zhijian": 1,
    "ji": 2,
    "yujun": 1,
    "lite": 1,
    "iniclr": 1,
    "jiehui": 2,
    "xinet": 1,
    "raphael": 1,
    "jaejun": 1,
    "lee": 1,
    "yaoliang": 1,
    "jimmy": 1,
    "deebert": 1,
    "dynamic": 1,
    "early": 1,
    "exiting": 1,
    "acceler": 1,
    "ating": 1,
    "mingxing": 1,
    "wenrui": 1,
    "chunmiao": 1,
    "xing": 1,
    "jun": 1,
    "qi": 1,
    "hongkai": 1,
    "xiong": 2,
    "hongteng": 1,
    "liangda": 1,
    "huck": 1,
    "tsai": 1,
    "pin": 1,
    "reprogramming": 1,
    "acoustic": 1,
    "cunjun": 1,
    "jiawei": 1,
    "haiyu": 1,
    "shuai": 2,
    "pedes": 1,
    "trian": 1,
    "eccv": 1,
    "lei": 2,
    "stars": 1,
    "yunet": 1,
    "chulhee": 1,
    "srinadh": 1,
    "bhojanapalli": 1,
    "ankit": 1,
    "singh": 1,
    "rawat": 1,
    "sashank": 1,
    "reddi": 1,
    "ap": 1,
    "proximators": 1,
    "ailing": 1,
    "muxi": 1,
    "qiang": 2,
    "george": 1,
    "srideepika": 1,
    "jayaraman": 1,
    "dhaval": 1,
    "patel": 1,
    "anuradha": 1,
    "bhamidipaty": 1,
    "carsten": 1,
    "eickhoff": 1,
    "repre": 1,
    "sentation": 1,
    "yunhao": 1,
    "aldo": 1,
    "lipani": 1,
    "omer": 1,
    "kirnap": 1,
    "emine": 1,
    "yilmaz": 1,
    "hongwei": 1,
    "yuanqing": 1,
    "autoencoder": 1,
    "ccdc": 1,
    "haoyi": 1,
    "shanghang": 1,
    "jieqi": 1,
    "jianxin": 1,
    "hui": 1,
    "wancai": 1,
    "rong": 1,
    "hanced": 1,
    "decomposed": 1,
    "inicml": 1,
    "zuoet": 1,
    "simiao": 1,
    "haoming": 1,
    "jiang": 1,
    "zichong": 1,
    "tuo": 1,
    "zha": 1
}