{
    "featureselection": 28,
    "data": 187,
    "perspective": 30,
    "jundongli": 6,
    "kewei": 2,
    "cheng": 6,
    "suhangwang": 1,
    "fredmorstatter": 1,
    "robert": 7,
    "trevino": 3,
    "arizona": 3,
    "stateuniversity": 3,
    "jiliangtang": 2,
    "michigan": 2,
    "state": 2,
    "university": 3,
    "huanliu": 3,
    "asada": 1,
    "tapre": 1,
    "proce": 2,
    "ssing": 2,
    "strat": 1,
    "egy": 1,
    "especially": 3,
    "high": 13,
    "dimensional": 11,
    "various": 8,
    "mining": 9,
    "machine": 9,
    "learning": 67,
    "problems": 9,
    "objec": 1,
    "improvingdata": 1,
    "performance": 18,
    "preparing": 1,
    "clean": 1,
    "understandable": 2,
    "recent": 9,
    "proliferation": 1,
    "big": 11,
    "presented": 2,
    "some": 41,
    "substantial": 1,
    "challenges": 4,
    "opportunities": 3,
    "feature": 440,
    "selection": 278,
    "this": 43,
    "survey": 6,
    "provide": 4,
    "comprehen": 1,
    "sive": 1,
    "structured": 9,
    "overview": 1,
    "advances": 4,
    "research": 7,
    "motivated": 1,
    "by": 56,
    "current": 5,
    "chal": 2,
    "lenges": 2,
    "era": 2,
    "revisit": 2,
    "from": 50,
    "structureddata": 1,
    "heterogeneous": 6,
    "streaming": 13,
    "methodologically": 1,
    "emphasize": 1,
    "differences": 3,
    "similarities": 1,
    "most": 29,
    "existing": 12,
    "algorithms": 76,
    "conventional": 7,
    "categorize": 1,
    "them": 11,
    "into": 22,
    "four": 7,
    "main": 5,
    "groups": 19,
    "similarity": 20,
    "based": 62,
    "information": 62,
    "theoretical": 11,
    "sparse": 34,
    "statistical": 11,
    "methods": 63,
    "facilitate": 2,
    "promote": 1,
    "community": 1,
    "also": 40,
    "present": 2,
    "an": 46,
    "open": 3,
    "source": 13,
    "repository": 8,
    "that": 113,
    "http": 8,
    "asu": 6,
    "edu": 8,
    "weuseit": 1,
    "example": 22,
    "show": 10,
    "how": 14,
    "evaluate": 10,
    "end": 1,
    "discussionabout": 1,
    "someopen": 1,
    "requiremoreattention": 1,
    "futureresearch": 1,
    "ccsconcepts": 1,
    "computing": 3,
    "methodologies": 1,
    "additional": 1,
    "keywords": 1,
    "phrases": 1,
    "acm": 51,
    "reference": 1,
    "format": 3,
    "jundong": 7,
    "li": 25,
    "suhang": 1,
    "wang": 11,
    "fred": 1,
    "morstatter": 2,
    "jiliang": 7,
    "tang": 12,
    "huan": 15,
    "liu": 47,
    "comput": 6,
    "surv": 1,
    "article": 48,
    "december": 1,
    "pages": 1,
    "https": 3,
    "doi": 2,
    "org": 6,
    "introduction": 4,
    "now": 1,
    "where": 15,
    "huge": 2,
    "amounts": 1,
    "become": 1,
    "ubiq": 1,
    "uitous": 1,
    "variety": 3,
    "domains": 1,
    "such": 29,
    "social": 15,
    "media": 11,
    "healthcare": 1,
    "bioinformatics": 8,
    "online": 9,
    "cation": 1,
    "rapid": 1,
    "growth": 2,
    "presents": 3,
    "effective": 6,
    "efficient": 15,
    "management": 1,
    "it": 86,
    "desirable": 2,
    "apply": 1,
    "techniques": 7,
    "automatically": 2,
    "discover": 1,
    "knowledge": 4,
    "fromdataof": 1,
    "varioussorts": 1,
    "materialis": 1,
    "basedon": 1,
    "work": 10,
    "supported": 2,
    "or": 45,
    "inpartby": 1,
    "thensf": 1,
    "gran": 1,
    "authors\u00ef": 1,
    "addresses": 1,
    "computer": 1,
    "science": 1,
    "engineering": 1,
    "arizonastateuniversity": 1,
    "tempe": 1,
    "emails": 1,
    "jundongl": 2,
    "fmorstat": 1,
    "rptrevin": 1,
    "eastlansing": 1,
    "email": 1,
    "tangjili": 1,
    "msu": 1,
    "permission": 2,
    "make": 5,
    "digital": 1,
    "hard": 3,
    "copies": 3,
    "part": 5,
    "personal": 1,
    "classroom": 1,
    "use": 10,
    "granted": 1,
    "without": 3,
    "fee": 2,
    "provided": 1,
    "not": 30,
    "made": 1,
    "distributed": 4,
    "profit": 1,
    "commercial": 1,
    "advantage": 7,
    "bear": 1,
    "notice": 1,
    "full": 1,
    "citation": 1,
    "first": 28,
    "page": 2,
    "copyrights": 1,
    "components": 3,
    "owned": 1,
    "others": 3,
    "than": 8,
    "must": 1,
    "honored": 1,
    "tocopyotherwise": 1,
    "orrepublish": 1,
    "requires": 4,
    "prior": 4,
    "specific": 7,
    "request": 1,
    "permissions": 2,
    "computingsurveys": 45,
    "vol": 46,
    "publicationdate": 45,
    "liet": 22,
    "al": 120,
    "fig": 6,
    "illustrativeexample": 2,
    "relevant": 22,
    "redundant": 15,
    "andirrelevant": 1,
    "features": 167,
    "when": 17,
    "applied": 5,
    "sparser": 1,
    "space": 6,
    "adversely": 1,
    "affecting": 1,
    "designed": 7,
    "low": 6,
    "hastie": 5,
    "et": 85,
    "with": 76,
    "large": 10,
    "number": 21,
    "models": 8,
    "tend": 1,
    "overfit": 1,
    "which": 15,
    "may": 10,
    "cause": 1,
    "degradation": 1,
    "unseen": 1,
    "dimensionality": 7,
    "sig": 1,
    "nificantly": 1,
    "increasethememory": 1,
    "analytics": 1,
    "issues": 2,
    "mainly": 2,
    "categorized": 2,
    "two": 27,
    "extraction": 7,
    "newly": 3,
    "constructed": 1,
    "usually": 7,
    "linear": 19,
    "nonlinear": 1,
    "ontheotherhand": 3,
    "directlyselectsasubset": 1,
    "featuresfor": 1,
    "modelconstruction": 1,
    "guyon": 4,
    "andelisseeff": 1,
    "motoda": 3,
    "both": 13,
    "advantages": 2,
    "improving": 2,
    "per": 1,
    "formance": 1,
    "increasing": 2,
    "computational": 4,
    "efficiency": 2,
    "decreasing": 1,
    "memory": 5,
    "storage": 4,
    "building": 3,
    "better": 2,
    "generalization": 1,
    "hence": 15,
    "they": 7,
    "regarded": 5,
    "reduction": 5,
    "tech": 2,
    "niques": 2,
    "ononehand": 1,
    "given": 21,
    "algorithm": 28,
    "preferred": 4,
    "other": 26,
    "hand": 4,
    "incontrast": 1,
    "maintains": 1,
    "physical": 1,
    "meanings": 1,
    "original": 6,
    "gives": 3,
    "readability": 1,
    "interpretability": 3,
    "therefore": 19,
    "often": 13,
    "many": 12,
    "applica": 2,
    "tions": 6,
    "suchas": 1,
    "text": 5,
    "genetic": 2,
    "analysis": 10,
    "should": 13,
    "benoted": 1,
    "thatin": 1,
    "cases": 4,
    "even": 6,
    "though": 4,
    "still": 9,
    "plays": 1,
    "essential": 1,
    "preventingoverfitting": 1,
    "andr": 1,
    "educ": 1,
    "ingc": 1,
    "ompu": 1,
    "tati": 1,
    "onal": 1,
    "costs": 1,
    "real": 8,
    "world": 8,
    "contain": 3,
    "lot": 2,
    "irrelevant": 3,
    "noisy": 5,
    "removing": 1,
    "these": 29,
    "fea": 10,
    "tures": 9,
    "reduces": 1,
    "cost": 1,
    "while": 22,
    "avoiding": 1,
    "significant": 2,
    "loss": 15,
    "forexample": 5,
    "infigure": 1,
    "able": 6,
    "discriminate": 1,
    "classes": 12,
    "clusters": 9,
    "however": 29,
    "figure": 11,
    "strongly": 8,
    "correlated": 9,
    "cannot": 5,
    "separate": 5,
    "removal": 1,
    "notnegatively": 1,
    "impac": 1,
    "tthel": 1,
    "earni": 2,
    "ngper": 1,
    "forma": 2,
    "nce": 2,
    "traditional": 4,
    "categorizationof": 1,
    "supervision": 4,
    "according": 3,
    "availability": 2,
    "class": 40,
    "labels": 19,
    "incl": 1,
    "assi": 1,
    "fica": 1,
    "tion": 17,
    "prob": 3,
    "lems": 2,
    "unsupervised": 49,
    "semi": 2,
    "supervisedmethods": 1,
    "supervised": 26,
    "generally": 4,
    "classification": 26,
    "regression": 12,
    "clas": 3,
    "sification": 2,
    "approximate": 1,
    "targets": 5,
    "training": 5,
    "phase": 11,
    "highly": 3,
    "depends": 2,
    "selected": 40,
    "after": 4,
    "splitting": 1,
    "andtestingsets": 1,
    "note": 6,
    "independent": 6,
    "learningalgorithms": 1,
    "filtermethods": 1,
    "wrappermeth": 1,
    "ods": 6,
    "theunderlyingmodel": 1,
    "embeddedmethods": 3,
    "finally": 1,
    "inthefollowingcontext": 1,
    "forsupervisedmethods": 1,
    "uselabelinformation": 1,
    "supervisioninformation": 1,
    "interchangeably": 1,
    "clustering": 15,
    "acquiring": 1,
    "la": 1,
    "beled": 1,
    "particularly": 1,
    "expensive": 5,
    "time": 10,
    "effort": 1,
    "gained": 2,
    "considerable": 2,
    "attention": 2,
    "recently": 6,
    "label": 9,
    "importance": 10,
    "seek": 1,
    "alternative": 2,
    "criteria": 11,
    "define": 2,
    "rel": 1,
    "evance": 1,
    "different": 40,
    "uses": 5,
    "instances": 28,
    "available": 5,
    "unsupervisedlearning": 1,
    "filter": 14,
    "relies": 1,
    "gorithms": 3,
    "iteratively": 2,
    "improve": 1,
    "quality": 4,
    "wrapper": 8,
    "embeds": 2,
    "afterthe": 1,
    "featureselectionphase": 1,
    "using": 15,
    "standard": 4,
    "elisseeff": 4,
    "etal": 5,
    "works": 7,
    "sufficient": 1,
    "unsu": 2,
    "inmanyreal": 1,
    "applications": 10,
    "itisdesirabletodevelop": 1,
    "supervisedmethodsby": 1,
    "expl": 1,
    "oiti": 1,
    "ngbo": 1,
    "thla": 1,
    "bele": 1,
    "dand": 1,
    "unlabeleddatasamples": 1,
    "selec": 6,
    "trate": 1,
    "gyper": 1,
    "spect": 2,
    "ive": 2,
    "methodscanbe": 1,
    "broadlycategorizedas": 1,
    "rely": 2,
    "predictive": 4,
    "predefined": 5,
    "typical": 5,
    "method": 16,
    "performs": 3,
    "steps": 4,
    "searches": 1,
    "subset": 19,
    "evaluates": 2,
    "repeats": 3,
    "until": 6,
    "stopping": 1,
    "satisfied": 2,
    "set": 25,
    "search": 9,
    "component": 1,
    "generates": 1,
    "then": 25,
    "acts": 2,
    "black": 1,
    "box": 1,
    "whole": 5,
    "process": 9,
    "highest": 5,
    "achieved": 1,
    "desired": 5,
    "obtained": 7,
    "returned": 1,
    "unfortunately": 1,
    "known": 4,
    "issue": 4,
    "whichisimpracticalwhen": 1,
    "disvery": 1,
    "strategies": 1,
    "sequential": 2,
    "hill": 1,
    "climbing": 1,
    "best": 5,
    "kohavi": 1,
    "john": 6,
    "ie": 5,
    "ta": 22,
    "branch": 1,
    "bound": 1,
    "narendra": 1,
    "fukunaga": 3,
    "golberg": 2,
    "proposed": 14,
    "yield": 1,
    "local": 11,
    "optimum": 1,
    "extremely": 1,
    "dimensionaldatasets": 1,
    "aresult": 1,
    "wrappermethodsare": 1,
    "seldomusedinpractice": 1,
    "assess": 4,
    "typically": 3,
    "more": 30,
    "computationally": 6,
    "due": 4,
    "lack": 1,
    "guiding": 1,
    "optimal": 8,
    "target": 4,
    "consists": 4,
    "step": 16,
    "ranked": 2,
    "accord": 2,
    "ing": 7,
    "evaluation": 6,
    "either": 8,
    "univ": 1,
    "aria": 2,
    "teor": 1,
    "mult": 1,
    "ivar": 1,
    "iate": 1,
    "intheunivariatescheme": 1,
    "multivariate": 1,
    "scheme": 1,
    "ranks": 1,
    "multiple": 17,
    "batch": 4,
    "way": 10,
    "second": 14,
    "lowly": 1,
    "filtered": 1,
    "out": 3,
    "past": 3,
    "decades": 3,
    "been": 9,
    "representative": 8,
    "include": 6,
    "discriminative": 13,
    "ability": 5,
    "samples": 9,
    "kira": 1,
    "rendell": 2,
    "robnik": 4,
    "\u00bdikonja": 3,
    "andkononenko": 1,
    "angetal": 3,
    "duetal": 1,
    "featurecorrelation": 2,
    "koller": 1,
    "andsahami": 1,
    "guyonandelisseeff": 1,
    "mutualinformation": 3,
    "yuandliu": 1,
    "pengetal": 2,
    "nguyen": 2,
    "ne": 5,
    "gao": 6,
    "preserve": 3,
    "manifold": 3,
    "structure": 12,
    "he": 6,
    "zhao": 9,
    "ue": 7,
    "jiang": 1,
    "ren": 2,
    "torec": 1,
    "onstr": 1,
    "uctth": 1,
    "eorig": 1,
    "inald": 1,
    "ata": 1,
    "masaelietal": 2,
    "farahatetal": 1,
    "ietal": 1,
    "lect": 6,
    "ioni": 1,
    "ntom": 1,
    "odel": 3,
    "lear": 1,
    "ning": 1,
    "interactions": 4,
    "far": 3,
    "wrappermethods": 1,
    "themostwidelyused": 1,
    "orexactzero": 1,
    "simultaneously": 8,
    "wards": 1,
    "botht": 1,
    "hereg": 1,
    "ulari": 3,
    "zatio": 3,
    "nmode": 1,
    "land": 1,
    "noted": 2,
    "literature": 1,
    "classifies": 1,
    "categories": 1,
    "saeys": 4,
    "ang": 2,
    "hybrid": 2,
    "combination": 5,
    "andembedded": 1,
    "themaintargetisto": 1,
    "forex": 1,
    "ample": 1,
    "forsmall": 1,
    "sizedhigh": 1,
    "dimensionaldata": 1,
    "together": 5,
    "results": 4,
    "robust": 12,
    "credibility": 1,
    "featuresisenhanced": 1,
    "algorithmsfroma": 1,
    "popularity": 2,
    "unique": 1,
    "characteristics": 4,
    "velocity": 1,
    "necessitate": 1,
    "development": 2,
    "novel": 2,
    "here": 3,
    "briefly": 2,
    "discuss": 3,
    "major": 2,
    "concerns": 1,
    "worldapplications": 2,
    "intwitter": 1,
    "newda": 1,
    "talik": 1,
    "epost": 1,
    "sandn": 1,
    "ewfea": 1,
    "dataoranew": 1,
    "featurearrives": 1,
    "moreover": 3,
    "inmany": 1,
    "single": 4,
    "scan": 2,
    "further": 9,
    "scans": 1,
    "impractical": 1,
    "fashionto": 1,
    "dynamically": 3,
    "maintain": 2,
    "aset": 1,
    "ofrelevant": 1,
    "algorithmsfrom": 1,
    "thedataperspective": 1,
    "handle": 5,
    "tasks": 6,
    "always": 1,
    "assume": 5,
    "identically": 1,
    "could": 7,
    "come": 3,
    "sources": 8,
    "images": 2,
    "tags": 2,
    "videos": 1,
    "addition": 17,
    "linked": 11,
    "ubiquitous": 1,
    "forms": 1,
    "user": 4,
    "post": 1,
    "relations": 10,
    "brings": 1,
    "unprecedented": 1,
    "leverage": 1,
    "shared": 3,
    "intrinsic": 3,
    "correlations": 4,
    "find": 6,
    "unequivocally": 1,
    "instance": 7,
    "link": 8,
    "widely": 7,
    "adopted": 1,
    "assumption": 2,
    "does": 4,
    "hold": 1,
    "appropriately": 1,
    "utilize": 3,
    "formation": 3,
    "exhibit": 5,
    "certain": 2,
    "types": 8,
    "structures": 14,
    "well": 5,
    "among": 18,
    "turesaregroup": 1,
    "tree": 20,
    "andgraphstructures": 1,
    "whenp": 1,
    "erfor": 2,
    "mingf": 2,
    "eatur": 12,
    "esele": 9,
    "ction": 11,
    "ifthefeaturestruc": 1,
    "andthus": 1,
    "incor": 1,
    "porat": 1,
    "ingpr": 1,
    "iorkn": 1,
    "owled": 1,
    "ge": 5,
    "aforementioned": 5,
    "reasons": 1,
    "motivate": 1,
    "investigation": 1,
    "view": 16,
    "categorization": 3,
    "illustrated": 4,
    "shown": 3,
    "consist": 2,
    "static": 2,
    "stream": 3,
    "grouped": 4,
    "flat": 4,
    "possess": 1,
    "inherent": 1,
    "deal": 4,
    "considered": 6,
    "few": 2,
    "witnessed": 3,
    "hundreds": 2,
    "their": 9,
    "technical": 3,
    "propose": 11,
    "classify": 2,
    "only": 16,
    "involves": 3,
    "meth": 3,
    "embedded": 2,
    "excluded": 1,
    "reason": 3,
    "excluding": 1,
    "cations": 1,
    "wepresentothermethods": 1,
    "suchashybridmethods": 1,
    "deep": 10,
    "basedmeth": 1,
    "reconstruction": 8,
    "express": 1,
    "sourcesand": 1,
    "new": 31,
    "selectionalgorithms": 3,
    "cope": 1,
    "thes": 1,
    "esit": 1,
    "uati": 1,
    "ons": 1,
    "inthestreamingsettings": 1,
    "fashion": 2,
    "size": 2,
    "unknown": 2,
    "one": 22,
    "pass": 5,
    "over": 8,
    "accordingly": 1,
    "similarly": 3,
    "orthogonal": 2,
    "setting": 4,
    "generated": 4,
    "determine": 2,
    "if": 23,
    "accept": 2,
    "added": 7,
    "remove": 2,
    "but": 7,
    "outdated": 1,
    "surveys": 2,
    "currently": 2,
    "there": 15,
    "exist": 3,
    "give": 3,
    "summarization": 1,
    "algo": 4,
    "rithms": 4,
    "those": 1,
    "alelyani": 4,
    "chandrashekar": 1,
    "sahin": 1,
    "andtangetal": 1,
    "noneofthemprovidea": 1,
    "will": 9,
    "intro": 1,
    "duce": 1,
    "cover": 1,
    "mentioned": 4,
    "release": 1,
    "python": 2,
    "named": 1,
    "scikit": 9,
    "built": 2,
    "used": 18,
    "package": 1,
    "learn": 25,
    "stable": 2,
    "scien": 1,
    "tific": 1,
    "packages": 1,
    "numpy": 2,
    "www": 3,
    "dscipy": 1,
    "scipy": 1,
    "includes": 1,
    "near": 1,
    "web": 2,
    "notations": 2,
    "summarize": 1,
    "symbols": 2,
    "throughout": 1,
    "table": 5,
    "eu": 2,
    "eb": 2,
    "du": 1,
    "characters": 2,
    "matrices": 4,
    "bold": 1,
    "lowercase": 1,
    "vectors": 2,
    "calligraphic": 1,
    "fontsforsets": 1,
    "ithrowofmatrix": 1,
    "aas": 1,
    "jth": 4,
    "column": 3,
    "aasa": 3,
    "thentry": 1,
    "transposeof": 1,
    "trace": 11,
    "astr": 1,
    "any": 5,
    "matrix": 46,
    "rn\u00ef": 21,
    "\u00bdd": 3,
    "its": 13,
    "frobenius": 1,
    "norm": 39,
    "defined": 4,
    "vector": 10,
    "ai": 4,
    "iis": 1,
    "identity": 1,
    "vectorwhoseelements": 1,
    "\u00bds": 5,
    "since": 11,
    "mid": 2,
    "sec": 1,
    "othe": 1,
    "rmet": 1,
    "hods": 2,
    "acco": 1,
    "rdin": 1,
    "gto": 2,
    "theusedtechniques": 1,
    "exploit": 2,
    "relevance": 8,
    "family": 11,
    "assessing": 1,
    "refer": 1,
    "derived": 3,
    "take": 3,
    "distance": 1,
    "metric": 1,
    "measures": 2,
    "obtain": 5,
    "defin": 1,
    "ition": 1,
    "sorde": 1,
    "scrip": 1,
    "numberof": 5,
    "instancesin": 1,
    "thedata": 3,
    "featuresin": 1,
    "selectedfeatures": 2,
    "ifexist": 3,
    "dfeatures": 3,
    "kselectedfeatures": 2,
    "ik": 1,
    "index": 9,
    "ofkse": 1,
    "lecte": 1,
    "dfeat": 5,
    "uresi": 1,
    "fd": 2,
    "doriginalfeatures": 1,
    "fik": 2,
    "xn": 2,
    "ndatainstances": 1,
    "xnnda": 1,
    "tavec": 1,
    "torsc": 1,
    "orres": 1,
    "pondi": 1,
    "ngto": 1,
    "yn": 1,
    "classlabelsof": 1,
    "ninstances": 4,
    "\u00bdddatamatrixwith": 1,
    "ninstancesand": 1,
    "xs": 4,
    "\u00bdkdatamatrixon": 1,
    "theselected": 1,
    "kfeatures": 5,
    "rnclasslabelvectorfor": 1,
    "dataset": 4,
    "\u00bddwithninstancesand": 1,
    "pairwisesimilarity": 1,
    "encoded": 1,
    "affinity": 10,
    "\u00bdn": 3,
    "suppose": 4,
    "want": 2,
    "select": 19,
    "kmost": 1,
    "featuress": 1,
    "maximize": 3,
    "utility": 8,
    "max": 10,
    "su": 12,
    "denotes": 11,
    "individually": 5,
    "maximization": 14,
    "featuresubset": 3,
    "befu": 1,
    "rthe": 2,
    "rdec": 1,
    "ompo": 1,
    "sedi": 1,
    "nto": 1,
    "thefollowing": 3,
    "form": 4,
    "s\u00ef": 1,
    "\u00bdf": 6,
    "\u00bds\u00ef": 1,
    "whereu": 1,
    "function": 16,
    "\u00bdfdenotes": 1,
    "transformation": 2,
    "scaling": 1,
    "nor": 1,
    "malization": 1,
    "etc": 3,
    "result": 4,
    "\u00bdsis": 1,
    "problem": 18,
    "equation": 13,
    "shows": 3,
    "would": 2,
    "solved": 2,
    "greedily": 3,
    "selecting": 5,
    "top": 4,
    "individual": 1,
    "\u00bdsisdesigned": 1,
    "wesubsequently": 1,
    "group": 46,
    "reformulated": 1,
    "under": 2,
    "unified": 5,
    "utilitymaximization": 2,
    "framework": 14,
    "laplacian": 22,
    "score": 38,
    "selects": 9,
    "three": 3,
    "phases": 2,
    "constructs": 2,
    "xi": 29,
    "xj": 53,
    "tifxiis": 1,
    "thep": 2,
    "nearest": 3,
    "neighbor": 1,
    "otherwise": 10,
    "diagonal": 5,
    "dis": 2,
    "lisl": 1,
    "last": 3,
    "each": 24,
    "featurefiis": 1,
    "computedas": 2,
    "_score": 3,
    "fi": 28,
    "il\u00ef": 1,
    "\u00bdfi": 16,
    "id\u00ef": 1,
    "where\u00ef": 5,
    "task": 7,
    "picking": 1,
    "smallest": 1,
    "scores": 7,
    "scoreof": 1,
    "eachfeaturecanbe": 1,
    "reformulatedas": 1,
    "parenlefttpa": 6,
    "parenleftbta\u00ef": 2,
    "parenrighttpa": 6,
    "parenrightbta": 6,
    "variance": 6,
    "term": 17,
    "interpreted": 1,
    "normalized": 4,
    "obvious": 1,
    "special": 4,
    "case": 15,
    "spec": 5,
    "extension": 1,
    "scenarios": 3,
    "scenario": 2,
    "sim": 1,
    "ilarity": 1,
    "measured": 3,
    "rbf": 2,
    "kernel": 3,
    "de": 4,
    "fined": 1,
    "nlifyi": 4,
    "yj": 19,
    "enlis": 1,
    "lth": 2,
    "af": 2,
    "ter": 3,
    "obtaining": 1,
    "sand": 1,
    "lnorm": 4,
    "basic": 7,
    "idea": 8,
    "similar": 14,
    "eachother": 2,
    "inspec": 1,
    "thefeaturerelevanceis": 1,
    "intheearlierequations": 1,
    "matrixlnorm": 1,
    "aj": 1,
    "cos": 1,
    "jistheanglebetween": 1,
    "jandfi": 1,
    "ifthedataarenoisefree": 1,
    "thenthe": 2,
    "canberemovedand": 1,
    "isused": 1,
    "itusesthetop": 1,
    "meigenpairs": 1,
    "eval": 1,
    "uate": 1,
    "thei": 1,
    "mpor": 1,
    "tanc": 1,
    "eof": 1,
    "featu": 11,
    "resel": 7,
    "ectio": 8,
    "nfram": 1,
    "\u00bdfiasfi": 1,
    "d\u00ef": 3,
    "sm": 1,
    "respectively": 13,
    "fisher": 6,
    "duda": 3,
    "values": 3,
    "within": 4,
    "same": 8,
    "thefi": 1,
    "shers": 1,
    "coreo": 1,
    "feach": 2,
    "re": 5,
    "fiisevaluated": 1,
    "asfollows": 8,
    "fisher_score": 2,
    "\u00bdij": 2,
    "\u00bdi": 2,
    "ij": 1,
    "wherenj": 1,
    "ijindicate": 1,
    "mean": 2,
    "value": 20,
    "fifor": 2,
    "thefe": 4,
    "ature": 11,
    "swith": 1,
    "thela": 1,
    "rgest": 1,
    "fisherscores": 1,
    "accordingtoheetal": 1,
    "long": 6,
    "relationship": 1,
    "between": 18,
    "compu": 1,
    "tationof": 1,
    "fisherscorecan": 1,
    "alsobe": 2,
    "reducedto": 4,
    "theunified": 1,
    "traceratiocriterion": 1,
    "thetraceratiocriterion": 1,
    "nieetal": 1,
    "dire": 1,
    "ctly": 1,
    "sele": 2,
    "ctst": 1,
    "hegl": 1,
    "obal": 1,
    "itbui": 1,
    "ldstw": 1,
    "oaffi": 1,
    "nitym": 1,
    "atric": 1,
    "es": 1,
    "swand": 1,
    "sbtoc": 1,
    "harac": 1,
    "teriz": 1,
    "ewith": 1,
    "classandbetween": 1,
    "classdatasimi": 1,
    "larity": 1,
    "let": 5,
    "wik": 1,
    "rd\u00ef": 5,
    "ijth": 1,
    "entry": 2,
    "inwijis": 1,
    "entries": 1,
    "ratio": 11,
    "featuresinsis": 1,
    "trace_ratio": 1,
    "tr": 11,
    "lbxw": 3,
    "lwxw": 3,
    "saandsb": 1,
    "theba": 1,
    "sicid": 1,
    "eaist": 1,
    "omaxi": 1,
    "mizet": 1,
    "minimize": 6,
    "difficult": 5,
    "solve": 3,
    "closed": 1,
    "solution": 2,
    "converted": 1,
    "tractable": 1,
    "called": 4,
    "maximizing": 4,
    "iterative": 2,
    "itr": 1,
    "problemdirectly": 1,
    "andwas": 1,
    "laterappliedin": 1,
    "nieet": 2,
    "modelalpacian": 1,
    "mode": 5,
    "sw": 7,
    "otherwiseandsb": 2,
    "isswfis": 1,
    "isfis": 1,
    "sswxs": 1,
    "sxs": 1,
    "sincex": 1,
    "sxsis": 1,
    "constant": 2,
    "reduced": 5,
    "uni": 1,
    "fied": 1,
    "similarityare": 1,
    "orxj": 1,
    "dw": 3,
    "respec": 1,
    "tively": 2,
    "criterion": 11,
    "istr": 1,
    "isdwfis": 1,
    "fis": 1,
    "equivalent": 5,
    "solving": 5,
    "lemin": 1,
    "relieff": 4,
    "kononenko": 2,
    "ldata": 1,
    "randomly": 1,
    "thenthefeaturescoreof": 1,
    "fiinrelieff": 1,
    "isdefinedas": 1,
    "follows": 10,
    "relieff_score": 1,
    "cl": 1,
    "parenleftexa": 1,
    "parenleftbta": 1,
    "mj": 1,
    "xr": 2,
    "nh": 1,
    "hjyp": 1,
    "nm": 2,
    "parenrightexa": 1,
    "wherenh": 1,
    "andnm": 1,
    "xjin": 1,
    "theirsizes": 1,
    "mjandhjy": 1,
    "thera": 1,
    "tioof": 1,
    "insta": 1,
    "ncesi": 1,
    "nclas": 1,
    "cclassesandthereare": 1,
    "instancesinboth": 1,
    "andnh": 1,
    "accordingtozhaoandliu": 1,
    "thereliefffeature": 1,
    "selectioncanbe": 1,
    "theutility": 1,
    "frameworkin": 1,
    "discussion": 7,
    "mance": 1,
    "category": 2,
    "straight": 1,
    "forward": 2,
    "simple": 3,
    "computation": 1,
    "focuses": 1,
    "afterwards": 1,
    "soffe": 1,
    "scanb": 1,
    "eobta": 1,
    "ined": 1,
    "onedrawbackofthese": 1,
    "inotherwords": 3,
    "theymayrepeatedly": 1,
    "highl": 1,
    "ycorr": 1,
    "elate": 1,
    "uresd": 1,
    "uring": 1,
    "theselectionphase": 1,
    "heuristic": 2,
    "measure": 3,
    "asindicatedindudaetal": 1,
    "manyhand": 1,
    "designedinformation": 1,
    "theoreticcriteriaare": 1,
    "sincetherelevanceof": 1,
    "correlation": 15,
    "performed": 2,
    "theoretic": 4,
    "concepts": 1,
    "discrete": 9,
    "variables": 9,
    "continuous": 4,
    "discretization": 3,
    "required": 3,
    "beforehand": 1,
    "conditional": 13,
    "likelihood": 5,
    "brown": 3,
    "subsection": 2,
    "introduce": 4,
    "brief": 1,
    "about": 7,
    "basicinformation": 1,
    "theoreticconcepts": 1,
    "theconceptof": 1,
    "theentropyof": 1,
    "discreterandomvariable": 1,
    "xisdefinedas": 1,
    "xp": 2,
    "lo": 4,
    "wherexidenotes": 1,
    "random": 2,
    "variable": 3,
    "probability": 7,
    "xiover": 1,
    "allpossiblevaluesof": 1,
    "conditionalentropy": 1,
    "ofxgiven": 1,
    "anoth": 1,
    "erdis": 1,
    "crete": 2,
    "rando": 1,
    "mvari": 1,
    "yis": 1,
    "yp": 3,
    "wherep": 3,
    "yi": 10,
    "ep": 1,
    "xigiven": 1,
    "itsh": 1,
    "owst": 1,
    "heun": 1,
    "cert": 1,
    "aint": 1,
    "yof": 1,
    "xgiveny": 1,
    "informationgain": 2,
    "ormutualinformation": 1,
    "informationsharedby": 1,
    "xandytogether": 1,
    "joint": 9,
    "xiandyj": 1,
    "gain": 3,
    "symmetric": 2,
    "iszero": 1,
    "thediscretevariables": 1,
    "xandyareindependent": 1,
    "orconditional": 1,
    "mutual": 10,
    "andygiven": 1,
    "athird": 1,
    "discretevariable": 1,
    "zis": 1,
    "zk": 6,
    "zp": 1,
    "itshowstheamount": 1,
    "ofmutualinformation": 1,
    "sharedby": 1,
    "xandygivenz": 1,
    "removefeaturesonebyone": 1,
    "inthissurvey": 1,
    "weexplainthe": 1,
    "se": 8,
    "edfe": 1,
    "atur": 1,
    "eset": 1,
    "oneb": 1,
    "yone": 1,
    "wedenote": 1,
    "yrepr": 1,
    "esent": 2,
    "sthec": 1,
    "lassl": 2,
    "abels": 1,
    "isafeatureselection": 1,
    "thehigherthevalueof": 1,
    "xk": 58,
    "themo": 1,
    "reimp": 1,
    "ortan": 1,
    "tthef": 1,
    "fora": 1,
    "unselectedfeature": 3,
    "xkisgiven": 1,
    "jcmi": 2,
    "andi": 2,
    "referred": 2,
    "combinations": 1,
    "shannon": 5,
    "termssuchthat": 1,
    "si": 12,
    "\u00bdand": 4,
    "isa": 2,
    "non": 10,
    "linearfunctionw": 1,
    "thesetwovariables": 1,
    "itisr": 1,
    "eferr": 1,
    "edasa": 1,
    "crite": 1,
    "rionb": 1,
    "ynon": 1,
    "linearcombination": 1,
    "shan": 1,
    "noni": 1,
    "nfor": 2,
    "mati": 1,
    "onte": 1,
    "rms": 1,
    "mutua": 3,
    "linfo": 3,
    "rmati": 3,
    "onmax": 2,
    "imiza": 2,
    "mim": 5,
    "lewis": 3,
    "correla": 1,
    "tionwithclasslabels": 1,
    "help": 3,
    "achieve": 11,
    "good": 8,
    "jmim": 1,
    "observed": 1,
    "assessed": 1,
    "redundancy": 12,
    "completely": 1,
    "ignored": 2,
    "obtains": 2,
    "choose": 1,
    "add": 2,
    "tedfe": 1,
    "sisob": 1,
    "taine": 1,
    "termsin": 1,
    "wher": 1,
    "eboth": 1,
    "areequalto": 1,
    "zero": 4,
    "limitation": 2,
    "assumes": 4,
    "reality": 1,
    "words": 5,
    "minimized": 1,
    "lection": 4,
    "mifs": 4,
    "battiti": 1,
    "considers": 2,
    "unselected": 3,
    "xkcan": 1,
    "formulated": 1,
    "jmifs": 1,
    "evaluated": 4,
    "penalizes": 1,
    "dancy": 3,
    "isminimized": 1,
    "terms": 9,
    "inequation": 2,
    "\u00bdis": 3,
    "betweenzero": 1,
    "minimum": 4,
    "maximum": 4,
    "peng": 6,
    "proposes": 1,
    "dundancy": 1,
    "mrmr": 3,
    "\u00bdto": 1,
    "reverse": 1,
    "jmrmr": 1,
    "effect": 2,
    "gradually": 1,
    "intuition": 2,
    "becomes": 2,
    "already": 2,
    "another": 4,
    "interpretation": 1,
    "pairwise": 7,
    "independence": 1,
    "stronger": 1,
    "featuresare": 1,
    "addedto": 1,
    "possiblybecauseof": 1,
    "noiseinformationin": 1,
    "eratively": 1,
    "revisethevalue": 1,
    "ands": 1,
    "etth": 1,
    "eoth": 1,
    "erpa": 1,
    "rame": 2,
    "tobe": 3,
    "somestudies": 1,
    "linandtang": 1,
    "elakadietal": 1,
    "guo": 2,
    "nixon": 2,
    "contrast": 2,
    "con": 1,
    "ditional": 1,
    "maximized": 1,
    "strongerthantheintra": 1,
    "featureredundancy": 1,
    "atyp": 1,
    "ical": 1,
    "argument": 1,
    "infomax": 2,
    "cife": 3,
    "lin": 6,
    "inwhi": 1,
    "chthe": 1,
    "resco": 1,
    "refor": 1,
    "xkis": 3,
    "jcife": 1,
    "compared": 1,
    "adds": 3,
    "third": 4,
    "redun": 2,
    "settingboth": 1,
    "jointmutualinformation": 2,
    "lectionprocess": 1,
    "alternativecriterion": 1,
    "yangandmoody": 1,
    "me": 1,
    "er": 3,
    "increase": 4,
    "complementary": 1,
    "unse": 1,
    "jjmi": 2,
    "featuresgiven": 1,
    "theclasslabels": 1,
    "jmi": 3,
    "directly": 6,
    "condition": 1,
    "authors": 10,
    "demonstrate": 1,
    "manipulations": 1,
    "writtenas": 1,
    "iterativelysetting": 1,
    "previously": 1,
    "next": 5,
    "cmim": 5,
    "vidal": 3,
    "naquet": 2,
    "ullman": 3,
    "so": 3,
    "mathematically": 2,
    "during": 2,
    "scoreforeachnew": 1,
    "xkcanbe": 1,
    "formulatedasfollows": 2,
    "jcmim": 3,
    "min": 28,
    "small": 7,
    "ifxkis": 1,
    "sis": 1,
    "maximizes": 1,
    "guarantee": 1,
    "strong": 4,
    "reduce": 3,
    "theredundancyw": 1,
    "theselectedfeatures": 1,
    "formaftersome": 1,
    "derivations": 1,
    "informativefragments": 1,
    "invidal": 1,
    "naquetandullman": 1,
    "theau": 1,
    "thors": 1,
    "propo": 2,
    "seafe": 1,
    "informative": 3,
    "fragments": 2,
    "featuresisgiven": 1,
    "jif": 1,
    "xjxk": 2,
    "behind": 1,
    "xkshould": 1,
    "xkan": 1,
    "dexi": 1,
    "stin": 2,
    "gfea": 2,
    "ture": 9,
    "sin": 1,
    "sover": 1,
    "themu": 1,
    "tuali": 1,
    "nform": 1,
    "ation": 6,
    "betwe": 1,
    "en": 1,
    "xjandy": 1,
    "rule": 1,
    "xkxj": 1,
    "thegeneralframework": 1,
    "interactioncapping": 2,
    "jakulin": 2,
    "isasi": 1,
    "milar": 1,
    "ncri": 1,
    "terion": 1,
    "restricts": 1,
    "nonnegative": 4,
    "smax": 1,
    "apparently": 1,
    "itisaspecialcaseofnon": 1,
    "thefunction": 1,
    "double": 1,
    "input": 7,
    "symmetrical": 2,
    "disr": 2,
    "meyerandbontempi": 1,
    "exploits": 2,
    "normalization": 1,
    "techniquestonormalize": 1,
    "guyonet": 1,
    "jdisr": 1,
    "xjxky": 1,
    "fast": 4,
    "fcbf": 2,
    "yu": 14,
    "threshold": 4,
    "sthat": 1,
    "corre": 2,
    "lated": 1,
    "esuis": 1,
    "uncertainty": 2,
    "subetween": 1,
    "setoffeatures": 1,
    "xsandtheclasslabel": 1,
    "yisgiven": 1,
    "predominant": 1,
    "iff": 1,
    "nequalk": 2,
    "xjis": 1,
    "featurexkifsu": 1,
    "denoted": 1,
    "spi": 1,
    "split": 2,
    "piands": 1,
    "piwhere": 1,
    "xkwith": 1,
    "andsu": 1,
    "heuristics": 1,
    "onsp": 1,
    "pi": 3,
    "ds": 3,
    "pito": 1,
    "keep": 2,
    "totheclasslabels": 1,
    "unlike": 1,
    "fail": 1,
    "tackle": 3,
    "mosta": 1,
    "forem": 1,
    "entio": 1,
    "nedin": 1,
    "\u00bdfeaturerelevance\u00ef": 1,
    "\u00bdand\u00ef": 1,
    "\u00bdfeatureredundancy": 1,
    "\u00bdmean": 1,
    "generalizable": 1,
    "witho": 1,
    "utthe": 1,
    "guide": 3,
    "ofcla": 1,
    "sslab": 1,
    "els": 1,
    "clear": 2,
    "discretedata": 1,
    "type": 7,
    "aim": 2,
    "fitting": 1,
    "rors": 1,
    "along": 2,
    "regularization": 27,
    "regularizer": 5,
    "forces": 2,
    "co": 1,
    "efficients": 1,
    "exactly": 1,
    "corresponding": 6,
    "simply": 1,
    "elim": 1,
    "inated": 1,
    "received": 2,
    "years": 3,
    "following": 8,
    "parts": 2,
    "review": 8,
    "represen": 1,
    "tative": 1,
    "perspectives": 1,
    "featureselectionwith": 2,
    "lp": 5,
    "normregularizer": 2,
    "univa": 1,
    "riate": 1,
    "regre": 1,
    "ssion": 1,
    "probl": 1,
    "em": 2,
    "toach": 3,
    "ievef": 3,
    "normsparsity": 2,
    "inducedpenalty": 1,
    "letwdenotesthefeature": 1,
    "coefficient": 4,
    "wloss": 10,
    "whereloss": 1,
    "functions": 2,
    "least": 2,
    "squares": 2,
    "hingeloss": 1,
    "andlogisticloss": 1,
    "wi": 16,
    "pisas": 1,
    "parse": 1,
    "regul": 2,
    "ariza": 2,
    "tiont": 1,
    "erm": 1,
    "aisa": 1,
    "parameter": 12,
    "balance": 5,
    "contribution": 8,
    "regular": 2,
    "ization": 1,
    "termfor": 1,
    "seeks": 1,
    "nonzeroentries": 1,
    "forthemodellearning": 1,
    "itisoftenrelaxedtoa": 1,
    "tightest": 1,
    "convex": 4,
    "relaxation": 1,
    "mainadvantageof": 1,
    "normregularization": 5,
    "lasso": 45,
    "tibshirani": 6,
    "istha": 2,
    "titfo": 1,
    "rcesm": 1,
    "anyfe": 1,
    "coeff": 2,
    "icien": 2,
    "tstob": 1,
    "ecome": 1,
    "erand": 1,
    "insomecases": 2,
    "exactlyzero": 1,
    "thisp": 1,
    "roper": 1,
    "tymak": 1,
    "esits": 1,
    "uitab": 1,
    "lefor": 1,
    "motivatesasurgeof": 1,
    "zhuetal": 1,
    "xuetal": 1,
    "wei": 6,
    "ia": 1,
    "dy": 3,
    "hara": 1,
    "maehara": 2,
    "wenables": 1,
    "ranking": 3,
    "normally": 4,
    "higher": 4,
    "important": 5,
    "featureis": 1,
    "wedis": 1,
    "cussh": 1,
    "owtop": 1,
    "mfeat": 1,
    "urese": 5,
    "lecti": 6,
    "onfor": 1,
    "thege": 1,
    "neral": 1,
    "multi": 46,
    "theproblem": 1,
    "andwewould": 1,
    "like": 2,
    "consistent": 2,
    "share": 1,
    "sparsity": 15,
    "patterns\u00ef": 1,
    "solvedbythelp": 1,
    "induc": 1,
    "edreg": 2,
    "nterm": 1,
    "mostexistingworkfo": 1,
    "cusonp": 1,
    "exis": 1,
    "ting": 2,
    "focu": 1,
    "son": 1,
    "assumethat": 1,
    "xdenotes": 1,
    "thedatamatrixand": 1,
    "ydenotestheone": 1,
    "hotl": 1,
    "abel": 2,
    "indi": 1,
    "cato": 1,
    "rmat": 1,
    "rix": 2,
    "thent": 2,
    "hemod": 1,
    "elisf": 1,
    "ormul": 2,
    "ateda": 1,
    "ais": 2,
    "control": 2,
    "contribu": 1,
    "induced": 1,
    "ranke": 1,
    "dacco": 1,
    "rding": 1,
    "tothe": 2,
    "thehigherthevalue": 1,
    "themoreimportant": 1,
    "thefeatureis": 2,
    "across": 3,
    "intuitive": 2,
    "optimization": 7,
    "through": 1,
    "termcan": 1,
    "bereformulatedas": 1,
    "proven": 1,
    "np": 3,
    "nature": 1,
    "objective": 5,
    "variation": 1,
    "caietal": 3,
    "zhang": 13,
    "proximal": 2,
    "gradient": 4,
    "algorithmand": 1,
    "rank": 3,
    "oneupdatealgorithm": 1,
    "tosolve": 1,
    "thisd": 1,
    "iscre": 1,
    "tesel": 1,
    "nprob": 1,
    "lem": 2,
    "theaf": 1,
    "oreme": 1,
    "ntion": 1,
    "edspa": 2,
    "rsity": 2,
    "discreteandhardtosolve": 1,
    "inpengandfan": 1,
    "andpengandfan": 1,
    "theauthorsproposea": 1,
    "generalframeworkto": 1,
    "direc": 1,
    "tlyop": 1,
    "timiz": 1,
    "ethes": 1,
    "parsi": 2,
    "ty": 3,
    "reduc": 1,
    "nwhen": 1,
    "although": 1,
    "inherently": 1,
    "smooth": 2,
    "obozinski": 3,
    "anomaly": 1,
    "detection": 2,
    "crowdsourcing": 2,
    "zhou": 7,
    "decade": 1,
    "hou": 2,
    "qian": 2,
    "zhai": 1,
    "ua": 1,
    "ee": 3,
    "zhu": 2,
    "liuetal": 1,
    "thus": 7,
    "discussions": 1,
    "center": 1,
    "around": 2,
    "connections": 1,
    "grouplasso": 6,
    "yuanandlin": 1,
    "willb": 2,
    "eexpl": 1,
    "ained": 1,
    "later": 1,
    "weca": 1,
    "nobt": 1,
    "aina": 1,
    "spar": 1,
    "sema": 1,
    "trix": 2,
    "hefea": 1,
    "spond": 1,
    "ingto": 1,
    "theserowscan": 1,
    "beeliminated": 1,
    "quattonietal": 1,
    "inparticular": 4,
    "suchthatmany": 1,
    "rows": 3,
    "thematrix": 1,
    "willallbezero": 1,
    "refs": 2,
    "employing": 1,
    "minimization": 4,
    "funct": 1,
    "ionan": 1,
    "dther": 1,
    "egula": 2,
    "rizat": 2,
    "ion": 3,
    "theirargumentisthatthe": 1,
    "lossf": 1,
    "uncti": 1,
    "oniss": 1,
    "ensit": 1,
    "noise": 1,
    "dingetal": 1,
    "regularized": 9,
    "model": 17,
    "functionto": 1,
    "achie": 1,
    "vegro": 1,
    "upfea": 1,
    "theobjectivefunctionof": 2,
    "refsis": 1,
    "xw": 10,
    "tosolvetheconvexbutnon": 1,
    "smoot": 1,
    "hopti": 1,
    "mizat": 1,
    "ionpr": 1,
    "oblem": 1,
    "stric": 1,
    "tconv": 1,
    "ergen": 1,
    "ceana": 1,
    "lysis": 1,
    "scla": 1,
    "ssif": 1,
    "icat": 1,
    "ionp": 1,
    "rob": 1,
    "thereis": 1,
    "asurg": 1,
    "eofre": 1,
    "searc": 1,
    "hwork": 1,
    "study": 7,
    "mostofthem": 1,
    "arealsobasedonthe": 1,
    "gu": 3,
    "changetal": 1,
    "ianetal": 1,
    "clus": 2,
    "terf": 2,
    "eatu": 2,
    "rese": 2,
    "mostofexistingsparse": 1,
    "basedapproachesbuild": 1,
    "terwards": 1,
    "coefficients": 5,
    "labeled": 1,
    "costly": 1,
    "consumingtoobtain": 1,
    "unsupervisedsparse": 1,
    "attentioninrecentyears": 1,
    "mcfs": 9,
    "isoneofthefirst": 1,
    "attempts": 5,
    "prop": 2,
    "oses": 1,
    "tose": 2,
    "turesthatcancovermulti": 1,
    "theco": 1,
    "rrela": 1,
    "tionb": 1,
    "etwee": 1,
    "ndiff": 1,
    "erent": 1,
    "cons": 2,
    "ists": 1,
    "ofth": 2,
    "rees": 1,
    "teps": 1,
    "inthefirststep": 1,
    "itconstructsa": 2,
    "neare": 1,
    "stnei": 1,
    "ghbor": 1,
    "graph": 19,
    "tocap": 2,
    "sandthelaplacianmatrix": 1,
    "embedding": 5,
    "unfolds": 1,
    "spectral": 5,
    "takes": 4,
    "specifically": 6,
    "ithembedding": 1,
    "ei": 3,
    "regardsit": 1,
    "asa": 1,
    "regressiontargetto": 1,
    "xwi": 1,
    "wherewidenotes": 1,
    "ith": 7,
    "ksparse": 2,
    "wk": 1,
    "corresponds": 1,
    "fj": 1,
    "computed": 1,
    "maxi": 2,
    "themore": 4,
    "importantthefeatureis": 3,
    "yang": 10,
    "udfs": 2,
    "discrimina": 2,
    "tive": 2,
    "exploiting": 1,
    "assume\u00ef": 1,
    "\u00bdxis": 1,
    "centered": 2,
    "\u00bdx": 1,
    "hnxandg": 1,
    "gn": 2,
    "weighted": 2,
    "indicator": 2,
    "hn": 1,
    "instead": 1,
    "global": 8,
    "discrimi": 1,
    "native": 1,
    "twofold": 1,
    "demonstrated": 1,
    "classi": 1,
    "fication": 1,
    "foreachdatainstance": 1,
    "neigh": 1,
    "borse": 1,
    "tfort": 1,
    "hatin": 2,
    "stanc": 1,
    "xip": 2,
    "letxnp": 1,
    "denotethe": 1,
    "total": 2,
    "scatter": 3,
    "tand": 2,
    "bare\u00ef": 1,
    "\u00bdxi": 4,
    "\u00bdxiand\u00ef": 1,
    "gig": 1,
    "i\u00ef": 2,
    "\u00bdxirespectively": 1,
    "\u00bdxiis": 1,
    "andg": 1,
    "gi": 15,
    "gik": 1,
    "gandg": 1,
    "n\u00ef": 1,
    "ig": 2,
    "\u00bdsto": 1,
    "mape": 1,
    "achd": 1,
    "atai": 1,
    "nsta": 1,
    "rdto": 1,
    "rs": 1,
    "definition": 2,
    "xiis": 1,
    "dsi": 2,
    "id": 3,
    "\u00bdxi\u00ef": 1,
    "\u00bdxip": 1,
    "fore": 1,
    "udfstendstotrain": 1,
    "inx": 1,
    "incorporates": 1,
    "functionis": 1,
    "idn": 1,
    "hk": 1,
    "whereais": 5,
    "aregularization": 1,
    "parameterto": 1,
    "controlthesparsityof": 1,
    "thelearnedmodel": 1,
    "ndfs": 5,
    "simulta": 1,
    "neously": 1,
    "pseudo": 8,
    "differentfrommostexist": 1,
    "thesp": 1,
    "ectra": 1,
    "lclus": 1,
    "terin": 1,
    "gphas": 1,
    "thelearnedpseudoclass": 1,
    "incorporatesthesetwo": 1,
    "phasesintoa": 1,
    "jointframework": 1,
    "similarlytotheudfs": 1,
    "weuse": 1,
    "notet": 2,
    "hewei": 1,
    "ghted": 1,
    "clust": 2,
    "easy": 2,
    "gg": 2,
    "adopts": 3,
    "strategy": 3,
    "shi": 3,
    "malik": 2,
    "geometric": 4,
    "preserved": 1,
    "minimizing": 2,
    "lg": 2,
    "elis": 1,
    "exists": 1,
    "\u00bdsbetween": 1,
    "xand": 1,
    "utilized": 1,
    "constraints": 3,
    "combinationof": 2,
    "twoco": 1,
    "mpone": 1,
    "ntsre": 1,
    "sults": 1,
    "wtr": 3,
    "introduced": 1,
    "contributionof": 2,
    "spectralclusteringand": 2,
    "discr": 1,
    "imina": 1,
    "tivef": 1,
    "merit": 1,
    "svm": 3,
    "lead": 1,
    "very": 2,
    "underlying": 1,
    "weights": 1,
    "poses": 1,
    "enables": 1,
    "us": 1,
    "explain": 1,
    "why": 1,
    "prediction": 1,
    "nonetheless": 2,
    "drawbacks": 1,
    "optimizes": 1,
    "particular": 2,
    "necessary": 1,
    "kind": 2,
    "withc": 1,
    "omple": 1,
    "xmatr": 1,
    "ixope": 1,
    "ns": 1,
    "multiplication": 1,
    "inverse": 1,
    "inmostcases": 1,
    "theexpensive": 1,
    "asthey": 1,
    "analyze": 1,
    "inevitably": 1,
    "troducesome": 1,
    "thiscategory": 1,
    "eliminates": 1,
    "whose": 2,
    "below": 1,
    "andshouldberemoved": 1,
    "thatis": 4,
    "saree": 1,
    "ither": 1,
    "thebooleanfeatureis": 1,
    "abernoulli": 1,
    "randomvariable": 1,
    "itsvariancevalue": 1,
    "canbe": 2,
    "variance_score": 1,
    "afterthevarianceof": 1,
    "featuresisobtained": 1,
    "pruned": 1,
    "davis": 2,
    "sampson": 2,
    "binary": 6,
    "foreachfeature": 2,
    "supposethat": 2,
    "deviations": 1,
    "instancesfromthesetwo": 1,
    "scoreforthefeature": 1,
    "fiis": 1,
    "t_score": 1,
    "whether": 3,
    "makes": 1,
    "means": 1,
    "statisti": 1,
    "callydifferent": 1,
    "oftwoclasses": 1,
    "thehigherthe": 1,
    "chi": 4,
    "square": 4,
    "setiono": 2,
    "utilizes": 1,
    "test": 6,
    "indepen": 1,
    "napa": 1,
    "rtic": 1,
    "ular": 1,
    "feat": 10,
    "ure": 2,
    "withrdifferent": 1,
    "featurevalues": 1,
    "thechi": 1,
    "squarescoreof": 1,
    "thatfeaturecan": 1,
    "becomputedas": 1,
    "chi_square_score": 1,
    "njs": 1,
    "\u00bdjs": 3,
    "jthfe": 1,
    "inaddition": 1,
    "snj": 1,
    "enj": 1,
    "indicates": 5,
    "sdenotes": 1,
    "thefeatureisrelatively": 1,
    "gini": 8,
    "quantify": 1,
    "fiwithrdifferent": 1,
    "wandwdenote": 1,
    "smaller": 2,
    "equal": 1,
    "larger": 1,
    "thejth": 1,
    "wandw": 1,
    "thefeature": 1,
    "fiisgiven": 1,
    "ini_index_score": 1,
    "parenleftbtap": 1,
    "cs": 3,
    "sgivenw": 1,
    "usedinmulti": 1,
    "ifica": 2,
    "tionp": 3,
    "roble": 1,
    "ms": 1,
    "thelowerthegini": 1,
    "indexvalue": 1,
    "cfs": 4,
    "hall": 2,
    "smith": 2,
    "toevaluate": 1,
    "theworthofa": 1,
    "cfs_score": 1,
    "krcfv": 1,
    "rff": 1,
    "\u00bdmerit\u00ef": 1,
    "\u00bdofthefeaturesubset": 1,
    "swithkfeatures": 1,
    "rcfisthe": 1,
    "meanf": 1,
    "eclas": 1,
    "scorr": 1,
    "elati": 2,
    "onand": 2,
    "rffistheaveragefeature": 1,
    "numerator": 1,
    "power": 1,
    "denominator": 1,
    "much": 2,
    "togetthefeature": 1,
    "vetterling": 2,
    "finding": 4,
    "globally": 1,
    "prohibitive": 1,
    "beginning": 1,
    "computes": 1,
    "considering": 2,
    "starts": 1,
    "empty": 2,
    "expands": 1,
    "satisfies": 1,
    "stoppingcriteria": 1,
    "andthecom": 1,
    "tothisend": 1,
    "assimilarity": 1,
    "basedfeature": 1,
    "meanwhile": 2,
    "preprocess": 1,
    "numerical": 3,
    "continuousvariables": 1,
    "inthissubsection": 2,
    "werev": 1,
    "iewhy": 1,
    "bridf": 1,
    "methodsand": 1,
    "basedand": 1,
    "basedmethods": 1,
    "ensemble": 6,
    "construct": 2,
    "subsets": 4,
    "produce": 1,
    "aggre": 1,
    "gated": 1,
    "instability": 1,
    "perturbation": 4,
    "hybri": 1,
    "onmet": 1,
    "aggregate": 1,
    "outputs": 3,
    "consensus": 3,
    "differ": 2,
    "sample": 5,
    "nalgo": 2,
    "rithm": 4,
    "nece": 1,
    "ssar": 1,
    "yfor": 1,
    "thef": 1,
    "irst": 1,
    "sampling": 2,
    "studied": 2,
    "aggregates": 1,
    "abeel": 2,
    "improved": 1,
    "stability": 8,
    "rfe": 1,
    "applying": 1,
    "eexi": 1,
    "gmet": 1,
    "saeysetal": 1,
    "abeeletal": 1,
    "dutkowskiandgambin": 1,
    "dist": 1,
    "ance": 2,
    "synt": 1,
    "hesi": 1,
    "smet": 1,
    "hod": 1,
    "yangetal": 1,
    "andstacking": 1,
    "netzer": 2,
    "aggregation": 1,
    "loscalzo": 3,
    "nowadays": 1,
    "popular": 2,
    "successful": 2,
    "deepl": 1,
    "ngisd": 1,
    "istin": 1,
    "ctfro": 1,
    "representations": 2,
    "finds": 1,
    "fromthisperspective": 1,
    "dfs": 2,
    "level": 7,
    "neural": 5,
    "network": 5,
    "layer": 5,
    "hidden": 7,
    "multilayer": 1,
    "perceptrons": 1,
    "mlp": 1,
    "andthen": 1,
    "inroyetal": 1,
    "authorsalso": 1,
    "proposeto": 1,
    "selectfeaturesat": 1,
    "theinput": 1,
    "levelof": 1,
    "deepneuralnetwork": 1,
    "thedifference": 2,
    "tthey": 1,
    "seane": 1,
    "wconc": 1,
    "ept\u00ef": 1,
    "\u00bdnetp": 1,
    "ositi": 1,
    "vecon": 1,
    "tribu": 2,
    "tion\u00ef": 1,
    "neurons": 1,
    "contribute": 1,
    "prevalent": 1,
    "pattern": 8,
    "recognition": 4,
    "extracts": 1,
    "representation": 2,
    "modalneuralnetwork": 1,
    "attentional": 2,
    "guides": 1,
    "cognitive": 4,
    "bias": 4,
    "modules": 1,
    "segmentation": 3,
    "module": 4,
    "segments": 1,
    "object": 2,
    "belonging": 1,
    "image": 5,
    "segment": 1,
    "gate": 1,
    "raw": 1,
    "sensitive": 1,
    "activate": 1,
    "correspondingrelevant": 1,
    "error": 2,
    "emerged": 2,
    "defines": 1,
    "capability": 1,
    "ap": 4,
    "amongthem": 1,
    "convexprincipalfeature": 1,
    "cpfs": 1,
    "squared": 1,
    "constraint": 3,
    "greedyfs": 1,
    "farahat": 2,
    "projection": 2,
    "project": 2,
    "zhaoetal": 2,
    "via": 9,
    "maung": 1,
    "schweitzer": 2,
    "modification": 1,
    "classical": 1,
    "pivoted": 1,
    "qr": 1,
    "recon": 1,
    "argues": 1,
    "necessarily": 1,
    "definea": 1,
    "schemetoembed": 1,
    "selectionwith": 3,
    "arein": 1,
    "depen": 2,
    "dento": 1,
    "kinds": 2,
    "spatial": 1,
    "temporal": 1,
    "smoothness": 1,
    "disjoint": 2,
    "overlap": 6,
    "trees": 1,
    "graphs": 1,
    "jenattonetal": 2,
    "uanetal": 1,
    "huangetal": 1,
    "zhouetal": 1,
    "angandy": 1,
    "ifthis": 1,
    "incorporating": 1,
    "infor": 2,
    "motivating": 1,
    "array": 1,
    "cgh": 1,
    "naturalspatialorder": 1,
    "inthissection": 1,
    "wediscusssomerep": 1,
    "willfocuson": 1,
    "groupstructure": 1,
    "treestructure": 1,
    "andgraphstructure": 1,
    "illustration": 2,
    "divided": 2,
    "dark": 1,
    "color": 2,
    "light": 1,
    "unselectedfeatures": 1,
    "approach": 3,
    "empir": 1,
    "icale": 1,
    "rrorp": 1,
    "enali": 1,
    "zedby": 1,
    "stru": 1,
    "ctur": 1,
    "alre": 1,
    "gula": 1,
    "riza": 1,
    "argmin": 1,
    "apenalty": 1,
    "wheregdenotes": 1,
    "tradeoff": 1,
    "penalty": 5,
    "isusu": 1,
    "ally": 1,
    "formulation": 3,
    "difference": 3,
    "withgroupfeature": 1,
    "common": 1,
    "examples": 2,
    "mul": 1,
    "tifactor": 1,
    "anova": 1,
    "factor": 3,
    "associated": 2,
    "several": 1,
    "expressed": 1,
    "dummy": 1,
    "yuan": 4,
    "ent": 2,
    "frequency": 1,
    "bands": 1,
    "represented": 4,
    "signal": 1,
    "processing": 2,
    "mcauley": 1,
    "genes": 3,
    "functionalities": 1,
    "acting": 1,
    "ma": 3,
    "perfo": 2,
    "rming": 1,
    "itis": 5,
    "moreappealingto": 1,
    "jacob": 3,
    "meier": 1,
    "isasolution": 1,
    "tothisproblem": 1,
    "illustrative": 1,
    "andth": 1,
    "ctedf": 1,
    "esare": 1,
    "contrary": 1,
    "tends": 1,
    "fourth": 1,
    "grouplassofirstusesa": 1,
    "wiin": 1,
    "previous": 1,
    "objectivefunctionof": 1,
    "isformulatedas": 1,
    "wgi": 4,
    "wherehiis": 1,
    "weight": 6,
    "measuring": 1,
    "ithgroupin": 1,
    "roces": 1,
    "groupwillbekept": 1,
    "inmanycases": 1,
    "consider": 4,
    "friedman": 5,
    "anditproducesasolution": 1,
    "withsimultaneousintra": 1,
    "groupandinter": 1,
    "groupsparsity": 1,
    "thepenaltytermof": 1,
    "lassoand": 1,
    "inter": 1,
    "intra": 2,
    "isshownin": 1,
    "overlapping": 3,
    "above": 1,
    "struc": 1,
    "ful": 1,
    "gene": 2,
    "protein": 3,
    "ye": 8,
    "belong": 2,
    "general": 2,
    "thatd": 1,
    "iffer": 1,
    "entfe": 1,
    "gicanhaveanoverlap": 1,
    "atlea": 1,
    "sttwo": 1,
    "giand": 1,
    "gjsuchthat": 1,
    "gj": 1,
    "nequal\u00ef": 1,
    "face": 2,
    "guided": 5,
    "kim": 2,
    "xing": 4,
    "jenatton": 2,
    "leaf": 1,
    "nodes": 13,
    "internal": 7,
    "node": 10,
    "root": 3,
    "subtree": 3,
    "represents": 1,
    "height": 1,
    "tightly": 1,
    "intree": 1,
    "guidedgrouplasso": 1,
    "foranindextree": 1,
    "gwithadepthof": 1,
    "ni": 2,
    "nidenotes": 1,
    "satisfy": 1,
    "conditions": 2,
    "depth": 2,
    "indices": 1,
    "mis": 1,
    "parent": 4,
    "inthefigure": 1,
    "wecanobserve": 1,
    "eight": 5,
    "organized": 1,
    "indexed": 1,
    "wehave": 1,
    "ad": 2,
    "ho": 1,
    "child": 4,
    "inthisway": 1,
    "guidedgrouplassois": 1,
    "wherea": 1,
    "hi": 1,
    "superset": 1,
    "nodeis": 1,
    "allof": 1,
    "willnot": 1,
    "withgraphfeature": 1,
    "natural": 2,
    "language": 2,
    "ifwet": 1,
    "akeea": 1,
    "chwor": 1,
    "dasaf": 1,
    "betweendifferentwords": 1,
    "fellbaum": 2,
    "dependencies": 4,
    "undirected": 1,
    "represent": 3,
    "edges": 2,
    "sandler": 2,
    "andxing": 1,
    "wecan": 1,
    "usean": 1,
    "undir": 1,
    "ected": 1,
    "toencodethesedepen": 1,
    "dencies": 1,
    "nnodesn": 1,
    "nn": 2,
    "eedges": 1,
    "nicorresponds": 1,
    "berepresentedbyan": 1,
    "adjacencymatrix": 1,
    "rnn\u00ef": 1,
    "\u00bdnn": 1,
    "niand": 1,
    "njare": 1,
    "connected": 3,
    "edge": 1,
    "fiandfjare": 1,
    "likely": 2,
    "lasso\u00ef": 1,
    "\u00bdadding": 1,
    "basis": 1,
