{
    "algorithms": 19,
    "eature": 1,
    "selection": 56,
    "an": 3,
    "evaluation": 3,
    "douglas": 1,
    "zongker": 2,
    "department": 2,
    "computer": 3,
    "science": 4,
    "michigan": 4,
    "state": 2,
    "university": 7,
    "east": 2,
    "lansing": 2,
    "usa": 2,
    "cps": 2,
    "msu": 2,
    "edu": 2,
    "abstract": 1,
    "large": 7,
    "number": 10,
    "been": 6,
    "proposed": 4,
    "doing": 1,
    "feature": 69,
    "subset": 30,
    "goal": 4,
    "this": 17,
    "paper": 4,
    "evaluate": 2,
    "quality": 8,
    "subsets": 7,
    "generated": 4,
    "by": 18,
    "various": 5,
    "also": 8,
    "compare": 1,
    "their": 2,
    "computational": 1,
    "requirements": 1,
    "our": 5,
    "results": 17,
    "show": 7,
    "that": 25,
    "sequential": 10,
    "forward": 7,
    "floating": 11,
    "sffs": 10,
    "algorithm": 12,
    "pudil": 5,
    "et": 3,
    "al": 6,
    "dominates": 1,
    "other": 3,
    "tested": 3,
    "illustrates": 4,
    "dangers": 1,
    "using": 11,
    "small": 6,
    "sample": 7,
    "size": 15,
    "situations": 3,
    "it": 6,
    "gives": 2,
    "applying": 4,
    "fea": 5,
    "ture": 4,
    "land": 2,
    "use": 9,
    "class": 7,
    "cation": 6,
    "sar": 6,
    "satellite": 1,
    "im": 1,
    "ages": 1,
    "four": 3,
    "different": 9,
    "texture": 14,
    "models": 10,
    "pooling": 2,
    "features": 43,
    "derived": 3,
    "from": 27,
    "difserent": 1,
    "followed": 1,
    "substantial": 1,
    "improvement": 1,
    "classi": 2,
    "accuracy": 5,
    "application": 2,
    "clas": 3,
    "handprinted": 6,
    "characters": 2,
    "value": 7,
    "reducing": 2,
    "needed": 1,
    "er": 2,
    "design": 2,
    "introduction": 1,
    "problem": 7,
    "take": 2,
    "set": 22,
    "candi": 1,
    "date": 1,
    "select": 2,
    "performs": 1,
    "best": 5,
    "under": 2,
    "some": 7,
    "classification": 8,
    "system": 1,
    "procedure": 2,
    "reduce": 3,
    "not": 9,
    "only": 6,
    "cost": 1,
    "recognition": 17,
    "tures": 1,
    "need": 1,
    "collected": 1,
    "but": 6,
    "cases": 1,
    "provide": 2,
    "better": 5,
    "due": 3,
    "finite": 2,
    "effects": 2,
    "there": 1,
    "resurgence": 1,
    "interest": 1,
    "methods": 21,
    "numbers": 1,
    "encountered": 1,
    "following": 4,
    "types": 1,
    "problems": 3,
    "applications": 2,
    "where": 7,
    "data": 26,
    "taken": 1,
    "multiple": 3,
    "sensors": 1,
    "fused": 1,
    "integration": 1,
    "pa": 1,
    "rameters": 1,
    "used": 12,
    "classifi": 3,
    "mining": 1,
    "recover": 1,
    "hidden": 1,
    "relationships": 1,
    "among": 1,
    "performance": 7,
    "synthetic": 3,
    "ieee": 9,
    "proceedings": 2,
    "icpr": 2,
    "ani": 1,
    "jain": 8,
    "ain": 1,
    "sets": 8,
    "several": 1,
    "well": 3,
    "known": 4,
    "recently": 1,
    "implemented": 2,
    "based": 5,
    "these": 5,
    "selec": 3,
    "tion": 7,
    "method": 9,
    "introduced": 2,
    "found": 1,
    "extremely": 1,
    "powerful": 1,
    "applied": 4,
    "datasets": 1,
    "two": 5,
    "domains": 1,
    "experimen": 1,
    "tal": 1,
    "indicate": 2,
    "elim": 1,
    "inate": 1,
    "redundant": 1,
    "avoid": 1,
    "curse": 5,
    "dimensionality": 5,
    "let": 5,
    "original": 1,
    "with": 19,
    "cardinality": 1,
    "represent": 1,
    "desired": 1,
    "se": 2,
    "lected": 1,
    "criterion": 10,
    "function": 7,
    "represented": 1,
    "without": 2,
    "any": 2,
    "loss": 2,
    "generality": 1,
    "us": 3,
    "consider": 1,
    "higher": 1,
    "formally": 1,
    "find": 3,
    "such": 2,
    "x": 1,
    "dand": 1,
    "max": 4,
    "zcv": 1,
    "jzl": 1,
    "taxonomy": 2,
    "available": 1,
    "algo": 1,
    "rithms": 1,
    "into": 5,
    "broad": 1,
    "categories": 2,
    "presented": 1,
    "figure": 14,
    "first": 3,
    "divide": 1,
    "those": 10,
    "statistical": 2,
    "pattern": 11,
    "spr": 3,
    "techniques": 2,
    "artificial": 1,
    "neu": 1,
    "ral": 1,
    "networks": 1,
    "ann": 2,
    "category": 1,
    "then": 2,
    "split": 2,
    "guaranteed": 1,
    "optimal": 13,
    "solution": 3,
    "may": 2,
    "result": 2,
    "suboptimal": 3,
    "further": 1,
    "divided": 3,
    "store": 1,
    "just": 2,
    "one": 4,
    "current": 1,
    "make": 1,
    "modifications": 1,
    "ver": 1,
    "sus": 1,
    "maintain": 1,
    "population": 1,
    "another": 1,
    "distinction": 1,
    "made": 1,
    "between": 3,
    "determin": 1,
    "istic": 1,
    "producing": 2,
    "same": 2,
    "given": 5,
    "every": 3,
    "time": 4,
    "random": 2,
    "element": 1,
    "which": 3,
    "could": 1,
    "produce": 1,
    "run": 3,
    "representa": 1,
    "tive": 1,
    "listed": 2,
    "beneath": 1,
    "each": 8,
    "leaf": 1,
    "node": 4,
    "tree": 1,
    "authorized": 5,
    "licensed": 5,
    "limited": 6,
    "national": 5,
    "fast": 6,
    "downloaded": 5,
    "february": 5,
    "utc": 5,
    "xplore": 5,
    "restrictions": 5,
    "apply": 6,
    "single": 3,
    "many": 1,
    "solutionr": 1,
    "delerminbtk": 1,
    "stochastic": 2,
    "deterministic": 1,
    "ptaw": 1,
    "sa": 1,
    "beamsearch": 1,
    "ga": 2,
    "flwring": 1,
    "mar": 1,
    "min": 4,
    "gorithms": 1,
    "group": 1,
    "begin": 1,
    "iteratively": 1,
    "add": 2,
    "or": 4,
    "remove": 1,
    "un": 1,
    "til": 1,
    "termination": 1,
    "met": 1,
    "start": 2,
    "empty": 1,
    "bottom": 1,
    "full": 1,
    "delete": 1,
    "top": 1,
    "down": 1,
    "backward": 4,
    "sfs": 7,
    "sbs": 3,
    "gsfs": 4,
    "gsbs": 4,
    "generalized": 3,
    "pta": 4,
    "sfbs": 3,
    "mm": 2,
    "search": 6,
    "described": 1,
    "detail": 1,
    "kit": 1,
    "tler": 1,
    "siedlecki": 2,
    "sklansky": 2,
    "genetic": 2,
    "technique": 1,
    "evaluated": 2,
    "branch": 11,
    "bound": 11,
    "narendra": 2,
    "fukunaga": 2,
    "much": 1,
    "more": 1,
    "quickly": 1,
    "than": 5,
    "exhaustive": 1,
    "drawback": 1,
    "requires": 1,
    "monotone": 1,
    "addition": 1,
    "new": 1,
    "never": 1,
    "decrease": 1,
    "know": 1,
    "dimen": 2,
    "sionality": 1,
    "phenomenon": 2,
    "true": 5,
    "plus": 1,
    "away": 1,
    "mao": 5,
    "multilayer": 1,
    "feedforward": 1,
    "network": 2,
    "backpropagation": 1,
    "learning": 1,
    "classifica": 2,
    "they": 1,
    "define": 1,
    "saliency": 1,
    "measure": 3,
    "present": 1,
    "pruning": 4,
    "least": 2,
    "salient": 1,
    "nodes": 2,
    "complexity": 1,
    "after": 1,
    "trained": 1,
    "input": 1,
    "equivalent": 1,
    "removing": 1,
    "corre": 1,
    "sponding": 1,
    "simultaneously": 1,
    "develops": 1,
    "both": 3,
    "optimum": 1,
    "classifier": 3,
    "experimental": 2,
    "compared": 4,
    "terms": 1,
    "error": 4,
    "dimensional": 2,
    "gaussian": 2,
    "was": 9,
    "assessing": 1,
    "goodness": 1,
    "mahalanobis": 3,
    "dis": 1,
    "tance": 1,
    "means": 2,
    "larger": 1,
    "distance": 2,
    "maximum": 1,
    "likelihood": 1,
    "estimates": 1,
    "covariance": 2,
    "matrix": 3,
    "mean": 1,
    "vectors": 1,
    "were": 8,
    "computed": 3,
    "total": 3,
    "thirteen": 1,
    "table": 2,
    "execution": 2,
    "times": 2,
    "reported": 4,
    "processor": 1,
    "ticks": 1,
    "second": 1,
    "spent": 1,
    "user": 1,
    "space": 2,
    "sun": 1,
    "sparcserver": 1,
    "ooo": 2,
    "ten": 1,
    "randomly": 1,
    "patterns": 3,
    "per": 4,
    "averages": 1,
    "runs": 2,
    "shows": 1,
    "solid": 1,
    "line": 1,
    "dicates": 1,
    "target": 1,
    "obtained": 2,
    "conclusions": 1,
    "drawn": 2,
    "empirical": 1,
    "while": 4,
    "very": 1,
    "poor": 1,
    "comparable": 1,
    "formance": 1,
    "nesting": 1,
    "instance": 2,
    "contained": 2,
    "faster": 2,
    "its": 2,
    "back": 1,
    "ward": 1,
    "counterpart": 1,
    "expected": 2,
    "com": 2,
    "parable": 1,
    "most": 1,
    "part": 1,
    "i": 2,
    "ii": 1,
    "pecc": 1,
    "execu": 1,
    "generally": 1,
    "giving": 2,
    "near": 2,
    "far": 1,
    "slower": 1,
    "overall": 1,
    "perform": 2,
    "non": 2,
    "counterparts": 1,
    "reasonable": 1,
    "effect": 1,
    "training": 12,
    "how": 1,
    "reliable": 1,
    "pres": 1,
    "ence": 1,
    "amounts": 2,
    "case": 1,
    "aris": 1,
    "ing": 4,
    "estimating": 1,
    "lead": 1,
    "process": 2,
    "astray": 1,
    "inferior": 1,
    "rel": 1,
    "ative": 1,
    "distributions": 5,
    "independent": 3,
    "test": 2,
    "even": 1,
    "if": 1,
    "selected": 6,
    "si": 1,
    "related": 1,
    "di": 2,
    "mensionality": 1,
    "illustrated": 2,
    "running": 1,
    "varying": 1,
    "trunk": 3,
    "simple": 3,
    "example": 1,
    "illustrate": 2,
    "multivariate": 1,
    "conditional": 2,
    "densities": 2,
    "below": 1,
    "denotes": 1,
    "identity": 1,
    "note": 4,
    "ranging": 1,
    "train": 1,
    "equations": 1,
    "five": 2,
    "re": 1,
    "suits": 1,
    "averaged": 2,
    "calculated": 1,
    "taking": 1,
    "commonalities": 1,
    "resulting": 1,
    "when": 1,
    "distribution": 2,
    "included": 1,
    "excluded": 1,
    "count": 1,
    "dimensions": 1,
    "over": 2,
    "values": 1,
    "inclusive": 1,
    "give": 1,
    "final": 1,
    "difference": 2,
    "produced": 1,
    "ideal": 2,
    "average": 1,
    "shown": 2,
    "brsnchdbound": 1,
    "dataset": 1,
    "since": 1,
    "identical": 1,
    "variance": 1,
    "along": 1,
    "axis": 1,
    "significant": 2,
    "therefore": 1,
    "images": 4,
    "oas": 1,
    "s": 1,
    "should": 1,
    "indeed": 1,
    "curve": 1,
    "closely": 1,
    "matches": 1,
    "low": 1,
    "improves": 1,
    "increases": 1,
    "aperture": 1,
    "radar": 1,
    "see": 2,
    "solberg": 2,
    "lo": 3,
    "sify": 1,
    "pixel": 2,
    "local": 1,
    "statistics": 1,
    "gray": 1,
    "level": 1,
    "co": 1,
    "ocurrence": 1,
    "matrices": 1,
    "fractal": 1,
    "lognormal": 1,
    "ran": 1,
    "dom": 1,
    "field": 2,
    "model": 4,
    "determine": 1,
    "whether": 1,
    "reduced": 1,
    "differ": 2,
    "ent": 2,
    "similar": 1,
    "study": 4,
    "d": 1,
    "shape": 2,
    "you": 2,
    "report": 1,
    "image": 3,
    "october": 1,
    "io": 2,
    "containing": 1,
    "approximately": 1,
    "pixels": 1,
    "evenly": 1,
    "form": 1,
    "rate": 6,
    "consistently": 1,
    "high": 3,
    "section": 1,
    "chose": 1,
    "notice": 1,
    "does": 1,
    "monotonically": 1,
    "increase": 1,
    "increased": 2,
    "utilizing": 2,
    "j": 1,
    "sps": 1,
    "nn": 2,
    "inn": 2,
    "lsslum": 1,
    "mblct": 1,
    "rates": 3,
    "three": 1,
    "individual": 1,
    "fourdif": 1,
    "ferent": 2,
    "character": 5,
    "aid": 1,
    "nist": 1,
    "sd": 1,
    "classes": 1,
    "correspond": 1,
    "lowercase": 1,
    "letters": 2,
    "testing": 1,
    "contour": 1,
    "direction": 1,
    "mohiuddin": 4,
    "again": 1,
    "did": 1,
    "reach": 1,
    "nearest": 1,
    "neighbor": 1,
    "major": 1,
    "advantages": 1,
    "performing": 1,
    "dramatically": 1,
    "drop": 2,
    "stance": 1,
    "reaches": 1,
    "half": 1,
    "culled": 1,
    "recog": 1,
    "nition": 1,
    "summary": 1,
    "merits": 1,
    "particular": 1,
    "practicality": 1,
    "finding": 1,
    "spaces": 1,
    "moderately": 1,
    "mension": 1,
    "aaaaaabbbbbbbccccccddd": 1,
    "ssssssstttttuuuuuuuvvv": 1,
    "monotonicity": 1,
    "requirement": 1,
    "sat": 1,
    "isfied": 1,
    "great": 1,
    "promise": 1,
    "being": 1,
    "useful": 2,
    "either": 1,
    "nonmonotonicity": 1,
    "putational": 1,
    "reasons": 1,
    "pitfalls": 1,
    "sification": 1,
    "comparing": 1,
    "quan": 1,
    "tified": 1,
    "experiments": 2,
    "associated": 1,
    "sparse": 1,
    "sional": 1,
    "lection": 1,
    "avoiding": 1,
    "eliminated": 1,
    "references": 1,
    "ferri": 1,
    "hatef": 1,
    "kittler": 3,
    "comparative": 3,
    "scale": 2,
    "gelsma": 1,
    "kamal": 1,
    "editors": 3,
    "practice": 3,
    "iv": 2,
    "pages": 6,
    "elsevier": 2,
    "chandrasekaran": 1,
    "sam": 1,
    "ple": 1,
    "considerations": 1,
    "krishnaiah": 1,
    "kanal": 2,
    "volume": 1,
    "chapter": 1,
    "north": 1,
    "holland": 1,
    "chen": 1,
    "ed": 1,
    "itor": 1,
    "signal": 1,
    "processing": 2,
    "sijthoff": 1,
    "noordhoff": 1,
    "alphen": 1,
    "aan": 1,
    "den": 1,
    "rijn": 1,
    "nether": 1,
    "lands": 1,
    "parsimonious": 1,
    "net": 1,
    "work": 1,
    "through": 1,
    "th": 1,
    "jerusalem": 1,
    "dif": 1,
    "classifiers": 1,
    "gelsema": 1,
    "recogni": 1,
    "paradigms": 1,
    "stud": 1,
    "ies": 1,
    "hybrid": 1,
    "systems": 1,
    "gorithm": 1,
    "transactions": 3,
    "computers": 1,
    "september": 1,
    "november": 2,
    "raudys": 1,
    "pattem": 1,
    "recommendations": 1,
    "prac": 1,
    "titioners": 1,
    "analysis": 2,
    "ma": 1,
    "chine": 1,
    "intelligence": 2,
    "march": 1,
    "ters": 1,
    "invari": 1,
    "ance": 1,
    "properties": 1,
    "textural": 1,
    "proc": 1,
    "igars": 1,
    "conference": 1,
    "florence": 1,
    "italy": 1,
    "july": 2,
    "ex": 1,
    "ample": 1,
    "machine": 1,
    "pami": 1,
    "matching": 1,
    "via": 1,
    "chord": 1,
    "length": 1,
    "wsion": 1,
    "graphics": 1,
    "novovieovb": 1
}