{
    "procedia": 8,
    "computer": 11,
    "science": 10,
    "available": 4,
    "online": 1,
    "www": 1,
    "sciencedirect": 2,
    "com": 1,
    "published": 4,
    "by": 27,
    "elsevier": 4,
    "this": 10,
    "an": 6,
    "open": 3,
    "access": 2,
    "article": 2,
    "under": 7,
    "cc": 2,
    "nc": 4,
    "nd": 5,
    "license": 2,
    "http": 2,
    "creativecommons": 2,
    "org": 2,
    "licenses": 2,
    "peer": 4,
    "review": 4,
    "responsibility": 4,
    "organizing": 2,
    "committee": 2,
    "itqm": 3,
    "doi": 1,
    "procs": 1,
    "information": 17,
    "technology": 4,
    "quantitative": 1,
    "management": 3,
    "survey": 2,
    "feature": 88,
    "selection": 79,
    "jianyu": 8,
    "miaoa": 1,
    "lingfeng": 8,
    "niub": 1,
    "aschool": 1,
    "mathematical": 2,
    "sciences": 4,
    "university": 1,
    "chinese": 3,
    "academy": 3,
    "beijing": 3,
    "china": 3,
    "bresearch": 1,
    "center": 2,
    "fictitious": 1,
    "economy": 1,
    "data": 49,
    "ckey": 1,
    "laboratory": 1,
    "big": 2,
    "mining": 5,
    "knowledge": 7,
    "abstract": 1,
    "dimensionality": 3,
    "reduction": 1,
    "technique": 3,
    "aims": 1,
    "choosing": 3,
    "small": 4,
    "subset": 3,
    "relevant": 3,
    "features": 44,
    "from": 15,
    "original": 3,
    "removing": 2,
    "irrelevant": 3,
    "redundant": 3,
    "or": 6,
    "noisy": 3,
    "usually": 4,
    "lead": 2,
    "better": 3,
    "learning": 29,
    "performance": 8,
    "higher": 1,
    "accuracy": 6,
    "lower": 1,
    "computational": 2,
    "cost": 2,
    "model": 6,
    "inte": 2,
    "rpre": 2,
    "tabi": 2,
    "lity": 2,
    "recently": 4,
    "researchers": 2,
    "vision": 3,
    "text": 3,
    "so": 2,
    "proposed": 12,
    "variety": 1,
    "algorithms": 16,
    "terms": 2,
    "theory": 1,
    "experiment": 6,
    "show": 2,
    "ectiveness": 1,
    "their": 2,
    "works": 2,
    "paper": 6,
    "aimed": 1,
    "reviewing": 1,
    "state": 5,
    "art": 5,
    "these": 7,
    "techniques": 1,
    "furthermore": 1,
    "thorough": 1,
    "conductedto": 1,
    "check": 1,
    "if": 2,
    "use": 9,
    "improve": 2,
    "considering": 1,
    "some": 4,
    "approaches": 2,
    "mentioned": 2,
    "literature": 2,
    "experimental": 2,
    "results": 8,
    "that": 19,
    "unsupervised": 20,
    "bene": 1,
    "ts": 1,
    "machine": 21,
    "tasks": 4,
    "improving": 1,
    "clustering": 24,
    "authors": 6,
    "keywords": 1,
    "introduction": 2,
    "increased": 1,
    "explosively": 1,
    "both": 4,
    "number": 11,
    "samples": 5,
    "many": 3,
    "applications": 2,
    "such": 5,
    "biomedical": 1,
    "order": 4,
    "acquisition": 1,
    "it": 6,
    "im": 1,
    "portant": 1,
    "necessary": 3,
    "study": 1,
    "how": 2,
    "utilize": 2,
    "large": 2,
    "scale": 3,
    "our": 6,
    "interest": 1,
    "focus": 1,
    "mainly": 1,
    "high": 3,
    "dime": 1,
    "nsio": 1,
    "nali": 1,
    "tyof": 1,
    "huge": 1,
    "dimensional": 3,
    "imposed": 1,
    "signi": 2,
    "cantly": 2,
    "challenge": 1,
    "existing": 2,
    "leaningmethods": 1,
    "due": 5,
    "presence": 2,
    "dimensions": 1,
    "they": 3,
    "not": 7,
    "only": 5,
    "make": 4,
    "veryslow": 1,
    "even": 1,
    "degenerate": 1,
    "but": 3,
    "also": 7,
    "di": 12,
    "culty": 1,
    "capable": 1,
    "ones": 1,
    "availability": 2,
    "label": 15,
    "roughly": 1,
    "classi": 13,
    "ed": 6,
    "into": 9,
    "three": 4,
    "families": 1,
    "supervised": 24,
    "methods": 25,
    "semi": 12,
    "allows": 1,
    "ectively": 1,
    "select": 11,
    "discriminative": 10,
    "distinguish": 1,
    "erent": 10,
    "classes": 5,
    "been": 9,
    "studied": 1,
    "when": 4,
    "portion": 1,
    "labeled": 7,
    "which": 13,
    "take": 1,
    "advantageof": 1,
    "unlabeled": 4,
    "most": 5,
    "rely": 1,
    "onthe": 1,
    "construction": 2,
    "similarity": 5,
    "matrix": 23,
    "those": 4,
    "best": 9,
    "absenceof": 1,
    "labels": 5,
    "used": 16,
    "guiding": 2,
    "search": 4,
    "considered": 4,
    "amuch": 1,
    "harder": 2,
    "problem": 16,
    "attain": 1,
    "goal": 1,
    "several": 4,
    "criteria": 7,
    "evaluatefeature": 1,
    "relevance": 4,
    "email": 1,
    "address": 1,
    "niulf": 1,
    "ucas": 1,
    "ac": 1,
    "cn": 1,
    "corresponding": 4,
    "author": 1,
    "tel": 1,
    "miao": 7,
    "niu": 7,
    "based": 12,
    "strategies": 1,
    "searching": 1,
    "lter": 4,
    "wrapper": 3,
    "embedded": 4,
    "filter": 2,
    "through": 3,
    "character": 1,
    "generally": 2,
    "perform": 9,
    "before": 3,
    "cation": 8,
    "usuallyfall": 1,
    "two": 11,
    "step": 2,
    "strategy": 5,
    "first": 2,
    "ranked": 1,
    "according": 3,
    "certain": 2,
    "then": 6,
    "with": 14,
    "highestrankings": 1,
    "selected": 12,
    "type": 1,
    "including": 2,
    "relieff": 3,
    "statistic": 1,
    "mrmr": 1,
    "gain": 2,
    "intended": 1,
    "algorithm": 9,
    "itself": 1,
    "evaluate": 3,
    "thework": 1,
    "utilizes": 1,
    "support": 6,
    "vector": 8,
    "recursive": 1,
    "elimination": 1,
    "rfe": 1,
    "mostrelevant": 1,
    "gene": 3,
    "cancers": 1,
    "models": 1,
    "process": 1,
    "figure": 1,
    "showsthe": 1,
    "info": 1,
    "rmat": 1,
    "ions": 1,
    "earc": 1,
    "supervisedsemi": 1,
    "supe": 2,
    "rvis": 2,
    "edun": 1,
    "fig": 1,
    "category": 1,
    "sparsity": 2,
    "regularization": 10,
    "very": 2,
    "important": 2,
    "learned": 1,
    "robust": 4,
    "applied": 2,
    "svm": 2,
    "method": 6,
    "norm": 10,
    "work": 7,
    "logistic": 1,
    "regression": 3,
    "hybrid": 3,
    "huberized": 2,
    "hhsvm": 1,
    "more": 6,
    "structured": 1,
    "developed": 2,
    "shared": 1,
    "multi": 10,
    "employed": 1,
    "joint": 9,
    "minimization": 5,
    "loss": 1,
    "function": 7,
    "rest": 1,
    "organized": 1,
    "follows": 4,
    "section": 5,
    "introduces": 2,
    "related": 2,
    "introduced": 3,
    "conduct": 3,
    "extensive": 2,
    "experiments": 8,
    "report": 2,
    "finally": 1,
    "provide": 1,
    "conclusions": 2,
    "traditional": 2,
    "fisher": 2,
    "score": 12,
    "rank": 1,
    "individually": 1,
    "criterion": 7,
    "consider": 2,
    "correlation": 1,
    "among": 2,
    "linear": 4,
    "discriminant": 3,
    "analysis": 15,
    "lda": 2,
    "short": 4,
    "was": 3,
    "elevate": 1,
    "maximizing": 1,
    "ratio": 1,
    "between": 5,
    "class": 17,
    "scatter": 4,
    "within": 4,
    "unfortunately": 1,
    "su": 2,
    "ers": 2,
    "sample": 4,
    "size": 6,
    "because": 3,
    "needs": 1,
    "calculate": 1,
    "inverse": 1,
    "singular": 1,
    "trainingsamples": 1,
    "smaller": 1,
    "than": 1,
    "avoid": 1,
    "maximum": 3,
    "margin": 2,
    "mmc": 1,
    "forshort": 1,
    "uses": 1,
    "combination": 1,
    "traces": 1,
    "classscatter": 1,
    "objective": 1,
    "constraint": 3,
    "orthogonal": 2,
    "weight": 2,
    "however": 4,
    "methodshave": 1,
    "common": 1,
    "limitation": 2,
    "requirement": 1,
    "cient": 5,
    "expensive": 1,
    "obtain": 4,
    "practice": 2,
    "performances": 1,
    "drop": 1,
    "dramatically": 1,
    "training": 2,
    "scarce": 1,
    "selections": 1,
    "contrast": 1,
    "exploit": 2,
    "result": 5,
    "able": 1,
    "utilizing": 1,
    "there": 5,
    "limited": 1,
    "others": 1,
    "graph": 5,
    "laplacian": 17,
    "assumes": 1,
    "examples": 1,
    "lie": 1,
    "low": 1,
    "manifold": 4,
    "sda": 1,
    "harness": 1,
    "less": 1,
    "handling": 1,
    "time": 1,
    "consuming": 1,
    "computation": 1,
    "therefore": 1,
    "tostudy": 1,
    "absence": 1,
    "much": 1,
    "criterions": 1,
    "de": 4,
    "nefeature": 1,
    "one": 7,
    "commonly": 2,
    "preserve": 2,
    "structureof": 1,
    "another": 2,
    "frequently": 1,
    "seek": 2,
    "cluster": 16,
    "indicators": 5,
    "transform": 1,
    "framework": 6,
    "ways": 2,
    "way": 2,
    "pseudo": 1,
    "simultaneously": 2,
    "uni": 1,
    "integrated": 1,
    "nonnegative": 4,
    "spectral": 10,
    "stru": 1,
    "ctur": 1,
    "alle": 1,
    "arni": 1,
    "ng": 2,
    "rst": 3,
    "seeks": 1,
    "remove": 1,
    "selectcertain": 1,
    "nally": 1,
    "repeat": 1,
    "steps": 1,
    "iteratively": 1,
    "until": 1,
    "met": 1,
    "usespectral": 1,
    "indicator": 4,
    "points": 7,
    "likesupervised": 1,
    "going": 1,
    "introduce": 1,
    "would": 3,
    "like": 4,
    "give": 4,
    "notations": 1,
    "assume": 1,
    "ndata": 1,
    "pointsx": 1,
    "each": 6,
    "xihas": 1,
    "dfeatures": 1,
    "fd": 1,
    "xto": 1,
    "denote": 2,
    "given": 6,
    "square": 1,
    "trace": 1,
    "ais": 1,
    "sum": 2,
    "diagonal": 3,
    "elements": 1,
    "frobenius": 1,
    "rm": 2,
    "nis": 2,
    "vm": 1,
    "ij": 2,
    "following": 9,
    "previous": 1,
    "vn": 1,
    "ai": 1,
    "where": 14,
    "aiis": 1,
    "th": 5,
    "row": 1,
    "aand": 1,
    "euclidean": 1,
    "nity": 3,
    "ned": 4,
    "sij": 2,
    "exp": 1,
    "xi": 4,
    "xj": 6,
    "otherise": 1,
    "local": 2,
    "structure": 2,
    "nk": 1,
    "denotes": 1,
    "set": 9,
    "knearest": 1,
    "neighbors": 1,
    "normalized": 5,
    "dis": 1,
    "whose": 1,
    "element": 1,
    "column": 1,
    "dii": 1,
    "jsij": 1,
    "relief": 4,
    "its": 3,
    "extension": 2,
    "weighting": 2,
    "assuming": 1,
    "pinstances": 1,
    "randomly": 1,
    "sampled": 1,
    "case": 2,
    "evaluation": 4,
    "sc": 6,
    "fi": 9,
    "ft": 8,
    "fnm": 2,
    "xt": 8,
    "fnh": 2,
    "idenotes": 1,
    "value": 1,
    "xton": 1,
    "iand": 1,
    "idenote": 1,
    "values": 2,
    "nearest": 2,
    "xtwith": 1,
    "same": 3,
    "respectively": 6,
    "distance": 1,
    "measurement": 1,
    "handle": 2,
    "problems": 4,
    "above": 2,
    "eq": 1,
    "extended": 1,
    "formulation": 6,
    "pp": 14,
    "mxt": 3,
    "nh": 4,
    "fj": 2,
    "nequaly": 1,
    "yp": 1,
    "nm": 4,
    "xtis": 1,
    "instance": 2,
    "xtand": 1,
    "probability": 1,
    "being": 1,
    "xa": 1,
    "dad": 1,
    "mxtand": 1,
    "yare": 1,
    "sizes": 1,
    "sets": 7,
    "nequalyxt": 1,
    "prespeci": 1,
    "constant": 1,
    "suggest": 1,
    "contributing": 1,
    "separation": 1,
    "retain": 1,
    "locality": 1,
    "speci": 2,
    "degree": 2,
    "dand": 1,
    "lare": 2,
    "obtained": 3,
    "calculated": 2,
    "ls": 1,
    "\u02c6ftl\u02c6f": 1,
    "\u02c6fd\u02c6f": 1,
    "\u02c6f": 1,
    "since": 3,
    "evaluated": 1,
    "independently": 2,
    "selecting": 2,
    "kfeatures": 2,
    "achieved": 1,
    "greedily": 1,
    "picking": 1,
    "top": 2,
    "minimal": 1,
    "lsvalues": 1,
    "spec": 8,
    "\u02c6fi": 1,
    "eigenvalue": 1,
    "eigenvector": 1,
    "pair": 1,
    "aj": 1,
    "cos": 1,
    "jis": 1,
    "angle": 1,
    "\u02c6fiand": 1,
    "increasing": 1,
    "re": 1,
    "eigenvalues": 1,
    "lfor": 1,
    "denoising": 1,
    "eigenvectors": 2,
    "optimal": 2,
    "soft": 1,
    "comparing": 1,
    "selects": 1,
    "assign": 1,
    "similar": 2,
    "instances": 1,
    "shown": 1,
    "special": 1,
    "second": 1,
    "note": 1,
    "evaluates": 1,
    "spfs": 6,
    "performs": 2,
    "preserving": 3,
    "redundancy": 3,
    "formulated": 2,
    "min": 7,
    "iwwtxj": 1,
    "here": 1,
    "hyper": 2,
    "parameter": 2,
    "mcfs": 4,
    "adopt": 1,
    "preserved": 1,
    "rstly": 1,
    "optimization": 2,
    "ftf": 2,
    "itr": 2,
    "ftlf": 1,
    "wi": 3,
    "xtwi": 1,
    "involves": 1,
    "sparse": 6,
    "eigen": 1,
    "least": 3,
    "squares": 3,
    "ciently": 1,
    "assumption": 1,
    "input": 2,
    "predicted": 1,
    "er": 2,
    "udfs": 5,
    "incorporated": 1,
    "performed": 2,
    "optimizing": 1,
    "wtw": 1,
    "wtxlxtw": 1,
    "where\u00df": 1,
    "ndfs": 7,
    "learn": 2,
    "during": 1,
    "enables": 1,
    "accurate": 1,
    "expl": 1,
    "icit": 1,
    "lyim": 1,
    "pose": 1,
    "presented": 1,
    "ftr": 1,
    "ttlf": 1,
    "xtw": 1,
    "wherea": 2,
    "and\u00df": 2,
    "balance": 2,
    "parameters": 8,
    "cult": 1,
    "idea": 1,
    "penalty": 1,
    "solve": 1,
    "factorization": 2,
    "proven": 1,
    "ective": 2,
    "eufs": 5,
    "embeds": 2,
    "via": 7,
    "without": 2,
    "transformation": 2,
    "uvt": 1,
    "\u00dftr": 1,
    "utlu": 1,
    "utu": 1,
    "reduce": 2,
    "ect": 1,
    "noise": 1,
    "outliers": 1,
    "solution": 1,
    "novel": 1,
    "iterative": 1,
    "called": 2,
    "alternating": 1,
    "direction": 1,
    "multiplier": 1,
    "admm": 1,
    "optimize": 1,
    "space": 1,
    "publicly": 2,
    "datasets": 8,
    "conducted": 1,
    "ve": 1,
    "image": 3,
    "orl": 4,
    "jaffe": 4,
    "handwritten": 2,
    "digit": 1,
    "mnisit": 1,
    "ba": 3,
    "microarray": 3,
    "tox": 4,
    "table": 6,
    "summarizes": 1,
    "statistics": 3,
    "description": 1,
    "domain": 2,
    "dataset": 2,
    "digitsba": 1,
    "mnist": 3,
    "compared": 1,
    "list": 1,
    "them": 2,
    "using": 5,
    "maxvar": 3,
    "variance": 1,
    "clus": 1,
    "terl": 1,
    "apla": 1,
    "cian": 1,
    "consistent": 1,
    "gaussian": 1,
    "structurespec": 1,
    "sfs": 4,
    "forward": 1,
    "utilized": 1,
    "frameworkmcfs": 1,
    "regres": 1,
    "sion": 1,
    "setting": 3,
    "conducting": 1,
    "fairly": 1,
    "compare": 2,
    "other": 1,
    "choose": 2,
    "erentparameters": 1,
    "subsection": 1,
    "neighborhood": 1,
    "kto": 1,
    "well": 1,
    "known": 1,
    "grid": 1,
    "range": 1,
    "need": 1,
    "specify": 1,
    "realistic": 1,
    "know": 2,
    "empirically": 1,
    "means": 3,
    "cgroups": 1,
    "initial": 1,
    "great": 2,
    "impact": 1,
    "times": 1,
    "repeatedly": 1,
    "random": 1,
    "initialization": 1,
    "averageresults": 1,
    "standard": 2,
    "deviation": 2,
    "metrics": 2,
    "acc": 5,
    "mutual": 4,
    "nmi": 7,
    "speaking": 1,
    "larger": 1,
    "present": 1,
    "concrete": 1,
    "formulations": 1,
    "below": 1,
    "true": 2,
    "get": 1,
    "map": 2,
    "yi": 1,
    "liand": 1,
    "yiare": 1,
    "total": 1,
    "delta": 1,
    "equals": 2,
    "yand": 1,
    "otherwise": 1,
    "permutation": 1,
    "mapping": 1,
    "maps": 1,
    "rito": 1,
    "equivalent": 1,
    "quality": 1,
    "clusters": 1,
    "now": 1,
    "ni\u02c6nj": 1,
    "niand": 1,
    "njdenote": 1,
    "contained": 1,
    "ciand": 2,
    "ljfori": 1,
    "nijis": 1,
    "intersection": 1,
    "lj": 1,
    "real": 1,
    "life": 1,
    "include": 1,
    "average": 1,
    "tables": 1,
    "observations": 1,
    "ande": 1,
    "numbers": 1,
    "secondly": 1,
    "general": 1,
    "almost": 1,
    "bestresult": 1,
    "highlighted": 2,
    "bold": 2,
    "face": 2,
    "datasetacc": 1,
    "std": 2,
    "datasetnmi": 1,
    "gives": 1,
    "see": 1,
    "theadaptive": 1,
    "future": 1,
    "ackn": 1,
    "owle": 1,
    "dgem": 1,
    "ents": 1,
    "express": 1,
    "sincere": 1,
    "thanks": 1,
    "associate": 1,
    "editor": 1,
    "reviewers": 1,
    "who": 1,
    "made": 1,
    "con": 1,
    "tributions": 1,
    "improvement": 1,
    "partially": 1,
    "supported": 1,
    "national": 1,
    "foundation": 1,
    "chi": 1,
    "na": 1,
    "references": 1,
    "wolf": 1,
    "shashua": 1,
    "inference": 1,
    "emergence": 1,
    "approach": 3,
    "journal": 7,
    "research": 2,
    "zhao": 3,
    "liu": 7,
    "proceedings": 9,
    "international": 11,
    "conference": 9,
    "acm": 8,
    "nie": 2,
    "huang": 3,
    "cai": 4,
    "ding": 4,
    "norms": 1,
    "advances": 3,
    "neural": 5,
    "processing": 3,
    "systems": 3,
    "li": 6,
    "chen": 2,
    "wei": 1,
    "xu": 3,
    "kou": 1,
    "decision": 3,
    "making": 3,
    "sdm": 1,
    "siam": 1,
    "king": 1,
    "lyu": 1,
    "jin": 1,
    "networks": 2,
    "ieee": 9,
    "trans": 1,
    "actions": 1,
    "wang": 4,
    "hu": 1,
    "yan": 1,
    "xia": 1,
    "yang": 5,
    "proportional": 1,
    "mechanism": 1,
    "population": 1,
    "interna": 1,
    "tional": 1,
    "zhang": 2,
    "he": 4,
    "sigkdd": 2,
    "discovery": 2,
    "dy": 1,
    "brodley": 1,
    "shen": 1,
    "ma": 1,
    "zhou": 5,
    "regularized": 1,
    "ijcai": 1,
    "arti": 4,
    "cial": 4,
    "intelligence": 7,
    "ol": 2,
    "citeseer": 1,
    "hruschka": 2,
    "jr": 1,
    "cov": 1,
    "oes": 1,
    "ebecken": 1,
    "bayesian": 2,
    "rallo": 1,
    "cohen": 1,
    "incremental": 1,
    "krishnapuram": 1,
    "harternink": 1,
    "carin": 1,
    "figueiredo": 1,
    "design": 1,
    "pattern": 5,
    "transactions": 6,
    "cheng": 2,
    "sher": 1,
    "markov": 1,
    "selector": 1,
    "fast": 1,
    "maximally": 1,
    "separable": 1,
    "multiclass": 1,
    "niyogi": 1,
    "kira": 1,
    "rendell": 1,
    "practical": 1,
    "ninth": 2,
    "workshop": 1,
    "raileanu": 1,
    "sto": 1,
    "el": 1,
    "theoretical": 1,
    "comparison": 1,
    "gini": 1,
    "index": 1,
    "annals": 2,
    "mathematics": 1,
    "peng": 2,
    "minimum": 1,
    "expression": 1,
    "bioinformatics": 1,
    "biology": 1,
    "long": 1,
    "max": 2,
    "dependency": 1,
    "guyon": 1,
    "weston": 1,
    "barnhill": 1,
    "vapnik": 1,
    "cancer": 1,
    "machines": 3,
    "bradley": 1,
    "mangasarian": 2,
    "concave": 1,
    "icml": 1,
    "fung": 1,
    "sixth": 1,
    "vs": 1,
    "rotational": 2,
    "invariance": 1,
    "twenty": 2,
    "zhu": 1,
    "zou": 1,
    "confer": 1,
    "ence": 1,
    "obozinski": 1,
    "taskar": 1,
    "jordan": 1,
    "task": 2,
    "department": 1,
    "uc": 1,
    "berkeley": 1,
    "tech": 1,
    "rep": 1,
    "evgeniou": 1,
    "pontil": 1,
    "duda": 1,
    "hart": 1,
    "stork": 1,
    "john": 1,
    "wiley": 1,
    "sons": 1,
    "multiple": 1,
    "measurements": 1,
    "taxonomic": 1,
    "eugenics": 1,
    "fukunaga": 1,
    "statistical": 1,
    "recognition": 1,
    "academic": 1,
    "press": 1,
    "jiang": 1,
    "extraction": 1,
    "luo": 1,
    "tao": 1,
    "valued": 1,
    "view": 1,
    "aaai": 5,
    "han": 1,
    "iccv": 1,
    "chang": 1,
    "convex": 1,
    "lu": 2,
    "guided": 1,
    "structural": 1,
    "engineering": 2,
    "zha": 1,
    "pca": 1,
    "invariant": 1,
    "principal": 1,
    "component": 1,
    "subspace": 1,
    "luxburg": 1,
    "tutorial": 1,
    "computing": 1,
    "kononenko": 1,
    "estimating": 1,
    "attributes": 1,
    "extensions": 1,
    "ecml": 1,
    "springer": 1,
    "ye": 1,
    "tang": 1
}