{
    "feature": 59,
    "selection": 31,
    "from": 32,
    "huge": 3,
    "sets": 21,
    "jose": 1,
    "bins": 5,
    "faculdade": 1,
    "de": 5,
    "informdtica": 1,
    "pontifkia": 1,
    "universidade": 1,
    "rs": 2,
    "alegre": 1,
    "brazil": 1,
    "nf": 1,
    "pucrs": 1,
    "br": 1,
    "abstract": 1,
    "number": 19,
    "features": 109,
    "that": 43,
    "computed": 6,
    "over": 10,
    "an": 9,
    "image": 16,
    "practical": 4,
    "purposes": 2,
    "limitless": 2,
    "unfortunately": 3,
    "exploited": 1,
    "by": 28,
    "most": 7,
    "computer": 8,
    "vision": 5,
    "systems": 5,
    "considerably": 1,
    "less": 3,
    "result": 16,
    "it": 37,
    "important": 5,
    "develop": 1,
    "techniques": 3,
    "selecting": 3,
    "very": 6,
    "large": 11,
    "data": 43,
    "include": 3,
    "many": 12,
    "irrel": 2,
    "evant": 2,
    "or": 21,
    "redundant": 21,
    "this": 34,
    "work": 6,
    "addresses": 1,
    "fea": 15,
    "ture": 4,
    "problem": 3,
    "proposing": 1,
    "three": 22,
    "step": 16,
    "algorithm": 14,
    "first": 19,
    "uses": 3,
    "variation": 1,
    "well": 6,
    "known": 1,
    "relief": 30,
    "al": 7,
    "gorithm": 3,
    "ll": 1,
    "remove": 4,
    "irrelevance": 1,
    "second": 6,
    "clus": 5,
    "ters": 4,
    "using": 8,
    "means": 14,
    "redundancy": 6,
    "thirdstep": 1,
    "standard": 5,
    "conibinatoriulfeature": 1,
    "algo": 3,
    "rithm": 3,
    "combination": 5,
    "shown": 9,
    "more": 15,
    "ef": 2,
    "fective": 2,
    "than": 15,
    "standurd": 1,
    "algorithms": 14,
    "with": 18,
    "lots": 1,
    "irrelevant": 10,
    "also": 10,
    "worse": 2,
    "duta": 1,
    "not": 24,
    "these": 10,
    "properties": 1,
    "finally": 4,
    "show": 6,
    "third": 9,
    "experiment": 9,
    "which": 9,
    "set": 62,
    "reduced": 4,
    "its": 9,
    "original": 12,
    "size": 12,
    "little": 1,
    "itforniation": 1,
    "loss": 1,
    "introduction": 1,
    "examples": 3,
    "common": 1,
    "fourier": 2,
    "coefficients": 3,
    "pca": 6,
    "eigenvectors": 3,
    "zernike": 2,
    "moments": 2,
    "gabor": 1,
    "energy": 1,
    "functions": 2,
    "wavelet": 1,
    "responses": 1,
    "probe": 3,
    "histogramkorrelogram": 1,
    "mention": 1,
    "simple": 2,
    "like": 2,
    "mean": 2,
    "deviation": 1,
    "moreover": 1,
    "list": 1,
    "pop": 1,
    "ular": 1,
    "barely": 1,
    "scratches": 1,
    "surface": 1,
    "tieu": 2,
    "viola": 2,
    "compute": 6,
    "without": 5,
    "any": 4,
    "those": 1,
    "mentioned": 1,
    "above": 2,
    "available": 2,
    "object": 4,
    "classification": 6,
    "therefore": 3,
    "problematic": 1,
    "real": 2,
    "time": 5,
    "cannot": 2,
    "afford": 1,
    "apply": 10,
    "bruce": 1,
    "draper": 3,
    "science": 2,
    "department": 3,
    "colorado": 3,
    "state": 4,
    "university": 11,
    "fort": 4,
    "collins": 1,
    "co": 1,
    "usa": 1,
    "cs": 1,
    "colostate": 1,
    "edu": 1,
    "them": 1,
    "relevent": 10,
    "paper": 1,
    "statistical": 4,
    "model": 1,
    "fitting": 1,
    "supervised": 1,
    "learning": 4,
    "generally": 1,
    "enough": 5,
    "labeled": 3,
    "training": 9,
    "instances": 2,
    "fit": 1,
    "accurate": 2,
    "models": 1,
    "spaces": 1,
    "due": 1,
    "finite": 1,
    "sample": 10,
    "effects": 1,
    "same": 8,
    "cases": 3,
    "difficult": 1,
    "impossible": 1,
    "know": 3,
    "given": 8,
    "task": 10,
    "effectively": 1,
    "noise": 5,
    "ability": 4,
    "select": 7,
    "critical": 1,
    "com": 6,
    "puter": 1,
    "prob": 2,
    "lem": 1,
    "find": 4,
    "subset": 8,
    "maxi": 1,
    "mizes": 1,
    "system\u00ef": 3,
    "\u00bds": 7,
    "classify": 2,
    "ing": 6,
    "optimal": 2,
    "usually": 1,
    "intractable": 1,
    "problems": 3,
    "related": 2,
    "been": 8,
    "np": 3,
    "hard": 2,
    "si": 1,
    "op": 1,
    "timal": 1,
    "solution": 2,
    "only": 12,
    "guaranteed": 1,
    "if": 14,
    "monotonic": 2,
    "crite": 1,
    "rion": 1,
    "evaluating": 2,
    "found": 1,
    "but": 8,
    "assump": 2,
    "tion": 9,
    "rarely": 1,
    "holds": 1,
    "world": 1,
    "forced": 1,
    "heuristic": 1,
    "solutions": 1,
    "represent": 1,
    "trade": 1,
    "off": 1,
    "between": 9,
    "quality": 1,
    "interested": 1,
    "context": 1,
    "particular": 3,
    "inter": 1,
    "ested": 1,
    "following": 1,
    "characteristics": 1,
    "numbers": 1,
    "order": 5,
    "thousands": 3,
    "regard": 2,
    "noisy": 2,
    "since": 10,
    "noist": 1,
    "will": 4,
    "affect": 1,
    "measured": 2,
    "continuous": 2,
    "listed": 1,
    "pro": 1,
    "small": 5,
    "relative": 1,
    "initial": 1,
    "duce": 1,
    "values": 6,
    "previous": 1,
    "literature": 2,
    "covering": 1,
    "extensive": 1,
    "spread": 1,
    "across": 1,
    "fields": 1,
    "including": 1,
    "document": 1,
    "classifica": 1,
    "mining": 1,
    "recognition": 14,
    "biometrics": 1,
    "remote": 1,
    "ieee": 10,
    "authorized": 7,
    "licensed": 7,
    "use": 13,
    "limited": 7,
    "national": 8,
    "fast": 7,
    "downloaded": 7,
    "february": 7,
    "utc": 7,
    "xplore": 7,
    "restrictions": 7,
    "sensing": 1,
    "where": 5,
    "attributes": 2,
    "larger": 4,
    "samples": 10,
    "too": 1,
    "computationally": 1,
    "sible": 2,
    "four": 2,
    "other": 11,
    "areas": 1,
    "research": 2,
    "dimensionality": 1,
    "reduction": 1,
    "space": 3,
    "partitioning": 1,
    "extraction": 1,
    "decision": 1,
    "trees": 3,
    "proposed": 5,
    "selec": 4,
    "sequential": 5,
    "forward": 3,
    "sfs": 1,
    "complex": 2,
    "such": 4,
    "neural": 7,
    "net": 6,
    "prunning": 1,
    "genetic": 1,
    "surveys": 1,
    "kittler": 3,
    "siedlecki": 2,
    "sklansky": 2,
    "relevant": 3,
    "kira": 2,
    "ken": 1,
    "dell": 1,
    "extended": 2,
    "kononenko": 3,
    "handle": 3,
    "incomplete": 1,
    "multi": 1,
    "class": 5,
    "floating": 3,
    "sffs": 18,
    "backward": 2,
    "sfbs": 19,
    "pudil": 2,
    "et": 4,
    "detect": 3,
    "relevance": 10,
    "even": 3,
    "when": 16,
    "interact": 1,
    "much": 5,
    "faster": 1,
    "branch": 1,
    "bound": 1,
    "bb": 1,
    "while": 1,
    "obtaining": 1,
    "comparable": 1,
    "results": 8,
    "least": 1,
    "some": 1,
    "system": 41,
    "goal": 5,
    "our": 13,
    "reduce": 3,
    "tures": 9,
    "tens": 1,
    "significantly": 2,
    "reducing": 3,
    "approximate": 1,
    "ob": 1,
    "jects": 1,
    "approach": 1,
    "figure": 7,
    "sys": 3,
    "tem": 3,
    "removed": 4,
    "then": 9,
    "re": 11,
    "dundant": 4,
    "traditional": 2,
    "binatorial": 1,
    "applied": 5,
    "maining": 1,
    "idea": 1,
    "each": 24,
    "filter": 26,
    "reduces": 2,
    "candidate": 1,
    "until": 1,
    "remains": 1,
    "discussed": 1,
    "later": 1,
    "bine": 1,
    "filters": 20,
    "into": 4,
    "depending": 2,
    "domain": 3,
    "statement": 1,
    "component": 2,
    "removes": 2,
    "modi": 1,
    "fied": 1,
    "form": 1,
    "readers": 1,
    "who": 1,
    "familiar": 1,
    "assigns": 1,
    "treating": 1,
    "points": 1,
    "finds": 2,
    "nearest": 3,
    "\u00bdhit\u00ef": 1,
    "another": 1,
    "\u00bdmiss\u00ef": 1,
    "differ": 3,
    "ent": 3,
    "adjusts": 1,
    "value": 4,
    "according": 3,
    "square": 1,
    "difference": 4,
    "hit": 1,
    "miss": 1,
    "suggests": 1,
    "several": 1,
    "modifications": 2,
    "generalize": 1,
    "continu": 1,
    "ous": 1,
    "make": 2,
    "robust": 1,
    "presence": 1,
    "high": 2,
    "level": 1,
    "architecture": 1,
    "adopt": 1,
    "kononenko\u00ef": 1,
    "modify": 2,
    "again": 3,
    "bias": 1,
    "against": 2,
    "non": 4,
    "described": 2,
    "within": 1,
    "used": 15,
    "threshold": 8,
    "divide": 1,
    "done": 1,
    "either": 3,
    "thresholding": 1,
    "directly": 1,
    "highest": 2,
    "discarding": 1,
    "remaining": 5,
    "case": 5,
    "does": 7,
    "tect": 2,
    "so": 5,
    "still": 3,
    "contains": 6,
    "cluster": 4,
    "how": 3,
    "they": 2,
    "correlate": 1,
    "clusters": 3,
    "discovered": 1,
    "score": 3,
    "kept": 1,
    "unusual": 1,
    "application": 4,
    "tering": 1,
    "clustered": 1,
    "instead": 2,
    "correlation": 3,
    "distance": 2,
    "measure": 2,
    "ter": 2,
    "sufficiently": 1,
    "similar": 2,
    "split": 2,
    "sure": 2,
    "potentially": 1,
    "usefull": 1,
    "moved": 1,
    "final": 6,
    "combinatorial": 2,
    "possible": 3,
    "float": 1,
    "unfortu": 1,
    "nately": 1,
    "feasible": 3,
    "about": 2,
    "ng": 2,
    "previously": 2,
    "reported": 1,
    "limit": 1,
    "after": 4,
    "relevence": 3,
    "redun": 1,
    "dancy": 1,
    "exceeds": 2,
    "switch": 1,
    "slightly": 2,
    "efficient": 1,
    "se": 1,
    "lection": 2,
    "mahalanobis": 1,
    "dis": 1,
    "tance": 1,
    "inside": 1,
    "both": 3,
    "asymp": 1,
    "totic": 1,
    "complexity": 4,
    "linear": 1,
    "terms": 3,
    "significant": 3,
    "factor": 1,
    "hand": 3,
    "per": 6,
    "one": 6,
    "itera": 1,
    "ksf": 1,
    "recursively": 1,
    "tight": 1,
    "ic": 1,
    "constant": 1,
    "stead": 1,
    "thus": 2,
    "iteration": 1,
    "iterations": 1,
    "increases": 1,
    "irrelevent": 10,
    "before": 1,
    "filtering": 2,
    "ones": 1,
    "course": 2,
    "two": 14,
    "must": 1,
    "run": 8,
    "last": 1,
    "running": 2,
    "there": 6,
    "ways": 1,
    "require": 1,
    "fixed": 1,
    "simply": 1,
    "needs": 1,
    "ensure": 1,
    "stages": 1,
    "call": 2,
    "version": 5,
    "users": 1,
    "need": 1,
    "provide": 2,
    "parameter": 1,
    "scores": 1,
    "encountered": 1,
    "reason": 1,
    "adjust": 1,
    "clustering": 2,
    "alternatively": 1,
    "requires": 1,
    "target": 3,
    "fewer": 2,
    "survive": 1,
    "otherwise": 2,
    "sws": 1,
    "creating": 2,
    "evaluate": 1,
    "conducted": 1,
    "experiments": 1,
    "different": 2,
    "gions": 1,
    "interest": 3,
    "subimages": 1,
    "extracted": 6,
    "aerial": 5,
    "im": 4,
    "ages": 3,
    "hood": 3,
    "texas": 1,
    "region": 1,
    "hy": 1,
    "pothesized": 1,
    "house": 2,
    "judge": 1,
    "hypotheses": 3,
    "regression": 1,
    "accuracy": 2,
    "scale": 1,
    "zero": 3,
    "images": 18,
    "written": 1,
    "characters": 1,
    "was": 16,
    "scribed": 1,
    "breuklen": 1,
    "jain": 3,
    "disadvantage": 1,
    "features\u00ef": 1,
    "none": 1,
    "completely": 1,
    "cats": 13,
    "dogs": 12,
    "testbed": 1,
    "compare": 1,
    "appearance": 1,
    "based": 6,
    "methods": 4,
    "consist": 1,
    "regions": 1,
    "typical": 1,
    "here": 2,
    "st": 1,
    "dev": 1,
    "etc": 2,
    "raw": 2,
    "sec": 3,
    "ond": 3,
    "derivatives": 1,
    "repeated": 2,
    "scales": 1,
    "eigenprojections": 1,
    "probes": 1,
    "histograms": 1,
    "comparisons": 1,
    "match": 3,
    "sumptions": 2,
    "underlying": 2,
    "judging": 1,
    "tests": 2,
    "steps": 2,
    "necessary": 2,
    "composed": 4,
    "work\u00ef": 1,
    "test": 16,
    "whether": 1,
    "needed": 1,
    "combina": 2,
    "tions": 2,
    "modules": 3,
    "were": 7,
    "best": 8,
    "ten": 3,
    "selects": 3,
    "way": 1,
    "consequently": 1,
    "selected": 6,
    "may": 3,
    "vary": 2,
    "default": 1,
    "however": 2,
    "followed": 1,
    "their": 2,
    "stage": 1,
    "exactly": 2,
    "table": 14,
    "shows": 9,
    "eight": 1,
    "combinations": 5,
    "module": 2,
    "nets": 4,
    "trained": 3,
    "tested": 4,
    "randomly": 1,
    "divided": 1,
    "validation": 3,
    "epochs": 2,
    "\u00bdearly": 1,
    "termination\u00ef": 1,
    "routine": 1,
    "saving": 1,
    "lowest": 1,
    "mse": 10,
    "evaluated": 1,
    "av": 1,
    "erage": 1,
    "seen": 2,
    "perfor": 1,
    "mance": 1,
    "achieved": 2,
    "particularly": 1,
    "good": 3,
    "\u00bdthe": 2,
    "longer": 1,
    "ad": 1,
    "\u00bdsfbs": 1,
    "ditional": 1,
    "ir": 3,
    "ho": 4,
    "tf": 1,
    "le": 1,
    "correspond": 1,
    "sfes": 3,
    "hn": 1,
    "io": 2,
    "differences": 3,
    "statisti": 2,
    "cally": 2,
    "compar": 1,
    "null": 3,
    "hypothesis": 4,
    "average": 3,
    "row": 2,
    "true": 3,
    "false": 1,
    "probability": 3,
    "observing": 2,
    "chance": 2,
    "line": 1,
    "compares": 1,
    "whole": 4,
    "combi": 1,
    "natorial": 1,
    "better": 3,
    "just": 3,
    "part": 2,
    "statistically": 2,
    "parison": 1,
    "outperformed": 1,
    "although": 3,
    "rule": 1,
    "out": 7,
    "possibility": 1,
    "fluke": 1,
    "impor": 1,
    "tantly": 1,
    "fi": 1,
    "nal": 2,
    "performance": 4,
    "greatly": 1,
    "surpasses": 1,
    "options": 1,
    "indicates": 1,
    "option": 1,
    "zo": 2,
    "proba": 1,
    "bility": 1,
    "pairs": 1,
    "indicate": 1,
    "capability": 1,
    "representation": 1,
    "sta": 1,
    "tistical": 1,
    "package": 1,
    "check": 1,
    "necessity": 1,
    "every": 2,
    "equally": 1,
    "alone": 4,
    "showing": 1,
    "outperforms": 3,
    "pri": 1,
    "mary": 1,
    "competitors": 1,
    "digits": 5,
    "handwritten": 1,
    "numerals": 1,
    "col": 1,
    "dutch": 1,
    "utility": 1,
    "maps": 1,
    "digit": 3,
    "total": 2,
    "character": 1,
    "shapes": 1,
    "profile": 1,
    "correlations": 1,
    "karhunen": 1,
    "loeve": 1,
    "pixel": 11,
    "averages": 1,
    "windows": 1,
    "morphological": 1,
    "unlike": 1,
    "obey": 1,
    "assumptions": 1,
    "motivated": 1,
    "design": 1,
    "makes": 1,
    "train": 1,
    "classifiers": 1,
    "performing": 1,
    "\u00bddo": 1,
    "harm\u00ef": 2,
    "philosophy": 1,
    "wanted": 1,
    "did": 2,
    "met": 1,
    "full": 2,
    "actually": 1,
    "formed": 1,
    "performed": 1,
    "because": 2,
    "raise": 1,
    "artifi": 2,
    "feat": 3,
    "cor": 1,
    "respond": 1,
    "cially": 1,
    "prior": 1,
    "below": 1,
    "warning": 1,
    "detecting": 1,
    "should": 1,
    "relied": 1,
    "among": 2,
    "torial": 1,
    "having": 1,
    "harm": 1,
    "next": 1,
    "present": 2,
    "dig": 1,
    "plus": 2,
    "copy": 2,
    "gaussian": 2,
    "added": 4,
    "adding": 1,
    "render": 1,
    "new": 3,
    "almost": 2,
    "useless": 1,
    "created": 1,
    "mixed": 1,
    "versions": 2,
    "ranging": 1,
    "applying": 1,
    "mod": 1,
    "ified": 1,
    "corre": 1,
    "spond": 1,
    "respectively": 1,
    "able": 2,
    "move": 2,
    "formance": 2,
    "origi": 1,
    "see": 1,
    "comparison": 1,
    "degrades": 1,
    "included": 1,
    "specifying": 1,
    "discarded": 1,
    "\u00bdr": 1,
    "k\u00ef": 1,
    "return": 1,
    "unique": 1,
    "sup": 1,
    "port": 1,
    "hun": 1,
    "dred": 1,
    "cat": 1,
    "faces": 2,
    "dog": 1,
    "black": 3,
    "white": 2,
    "registered": 1,
    "aligning": 1,
    "eyes": 2,
    "distinguish": 2,
    "technique": 1,
    "gallery": 2,
    "projected": 1,
    "eigenspace": 1,
    "returned": 1,
    "said": 1,
    "correct": 1,
    "species": 1,
    "fig": 1,
    "ure": 1,
    "contradicts": 1,
    "implicit": 1,
    "assumption": 1,
    "expensive": 1,
    "store": 1,
    "principal": 1,
    "compo": 1,
    "nents": 1,
    "analysis": 2,
    "eas": 1,
    "ily": 1,
    "nonetheless": 1,
    "reasons": 1,
    "intuition": 1,
    "what": 2,
    "pixels": 13,
    "allow": 1,
    "current": 1,
    "would": 2,
    "pressed": 1,
    "basis": 2,
    "vectors": 3,
    "few": 1,
    "thousand": 1,
    "emphasizes": 1,
    "relationships": 2,
    "gamut": 1,
    "intensities": 1,
    "intensity": 2,
    "single": 1,
    "meaningless": 1,
    "fortunately": 1,
    "sensitive": 3,
    "relations": 1,
    "visually": 1,
    "representing": 1,
    "eliminated": 1,
    "rhe": 1,
    "puted": 2,
    "pixel\u00ef": 1,
    "vol": 1,
    "ume": 1,
    "highlight": 1,
    "dif": 1,
    "ferences": 1,
    "betwee": 1,
    "relatively": 1,
    "higher": 1,
    "foreheads": 1,
    "wider": 1,
    "muzzles": 1,
    "ears": 1,
    "upper": 1,
    "corners": 1,
    "cats\u00ef": 1,
    "proportion": 1,
    "spacing": 1,
    "further": 1,
    "down": 1,
    "information": 6,
    "neighboring": 1,
    "produces": 1,
    "checkerboard": 1,
    "effect": 1,
    "neighbors": 1,
    "jected": 1,
    "question": 1,
    "lost": 1,
    "\u00bdeigenfaces\u00ef": 1,
    "recog": 2,
    "niton": 1,
    "complete": 3,
    "holding": 1,
    "forty": 1,
    "testing": 1,
    "process": 1,
    "five": 1,
    "times": 1,
    "cross": 1,
    "mode": 1,
    "age": 1,
    "classifier": 2,
    "neighbor": 2,
    "computes": 1,
    "projections": 1,
    "sam": 1,
    "ple": 1,
    "presented": 1,
    "projection": 2,
    "eigen": 1,
    "label": 1,
    "closest": 1,
    "euclidean": 1,
    "achieve": 1,
    "mcnemar\u00ef": 2,
    "binomial": 2,
    "considers": 1,
    "dicates": 1,
    "kmeans": 1,
    "fil": 2,
    "dataset": 1,
    "passed": 2,
    "words": 1,
    "approxi": 1,
    "mately": 1,
    "despite": 1,
    "fact": 1,
    "filtered": 1,
    "summary": 1,
    "conclusions": 1,
    "via": 1,
    "recommend": 1,
    "situation": 1,
    "algorihm": 1,
    "producing": 1,
    "oth": 1,
    "erwise": 1,
    "sub": 1,
    "specific": 1,
    "allowed": 3,
    "us": 3,
    "iiterature": 1,
    "picked": 1,
    "contain": 1,
    "\u00bddoes": 1,
    "demonstrate": 2,
    "degrade": 1,
    "visualize": 1,
    "main": 1,
    "contribution": 1,
    "far": 1,
    "outside": 1,
    "text": 3,
    "explicitly": 1,
    "references": 1,
    "\u00bdfeature": 3,
    "con": 1,
    "vision\u00ef": 1,
    "ph": 1,
    "dissertation": 1,
    "sci": 1,
    "ence": 1,
    "blum": 1,
    "rivest": 2,
    "\u00bdtraining": 1,
    "node": 1,
    "networks": 2,
    "van": 2,
    "breukelen": 2,
    "duin": 3,
    "tax": 2,
    "den": 3,
    "har": 2,
    "tog": 2,
    "\u00bdcombining": 1,
    "classijiers": 1,
    "handwrit": 1,
    "digits\u00ef": 1,
    "kybemetika": 1,
    "\u00bdhandwritten": 1,
    "combined": 1,
    "classi": 1,
    "fiers\u00ef": 1,
    "lst": 1,
    "iapr": 1,
    "workshop": 1,
    "pat": 1,
    "tern": 1,
    "prague": 1,
    "pp": 9,
    "caruana": 1,
    "freitag": 1,
    "\u00bdgreedy": 1,
    "attribute": 1,
    "llth": 1,
    "international": 3,
    "conference": 4,
    "machine": 5,
    "leaming": 1,
    "castelano": 1,
    "fanelli": 1,
    "pelillo": 1,
    "\u00bdan": 1,
    "iterative": 1,
    "ning": 1,
    "feedfonvard": 1,
    "networks\u00ef": 1,
    "transactions": 2,
    "baek": 1,
    "\u00bdadore": 1,
    "adaptive": 1,
    "videre": 1,
    "hyafil": 1,
    "\u00bdconstructing": 1,
    "binaty": 1,
    "cision": 1,
    "processing": 2,
    "letters": 2,
    "chandrasekaran": 1,
    "\u00bddimensionality": 1,
    "considerations\u00ef": 1,
    "pattern": 8,
    "practice": 1,
    "kr": 1,
    "ishnaiah": 1,
    "editors": 1,
    "north": 1,
    "holland": 1,
    "mao": 1,
    "\u00bdstatistical": 1,
    "review\u00ef": 1,
    "ieeetransactions": 1,
    "nition": 1,
    "intelligence": 5,
    "jan": 1,
    "rendell": 1,
    "algorithm\u00ef": 1,
    "loth": 1,
    "search": 3,
    "algorithms\u00ef": 2,
    "pattem": 1,
    "recogni": 1,
    "signal": 1,
    "chen": 1,
    "editor": 1,
    "sijthoff": 1,
    "ordhoff": 1,
    "alphen": 1,
    "aan": 1,
    "rijn": 1,
    "netherlands": 1,
    "kohavi": 2,
    "john": 1,
    "\u00bdwrappers": 1,
    "artificial": 1,
    "journal": 3,
    "\u00bdestimation": 1,
    "exten": 1,
    "sions": 1,
    "relief\u00ef": 1,
    "european": 1,
    "learn": 1,
    "catana": 1,
    "italy": 1,
    "macqueen": 1,
    "\u00bdsome": 1,
    "analysys": 1,
    "multivariate": 1,
    "observations\u00ef": 1,
    "proceedings": 1,
    "fifth": 1,
    "berkley": 1,
    "symposium": 2,
    "mathematics": 1,
    "statistics": 1,
    "lecam": 1,
    "neyman": 1,
    "eds": 1,
    "califomia": 1,
    "press": 2,
    "berkeley": 1,
    "mandal": 1,
    "\u00bdpartitioning": 1,
    "cation": 1,
    "marill": 1,
    "green": 1,
    "\u00bdon": 2,
    "effectiveness": 1,
    "recep": 1,
    "tors": 1,
    "systems\u00ef": 1,
    "informa": 1,
    "theory": 1,
    "goh": 1,
    "low": 1,
    "\u00bdfeati": 1,
    "ceptron": 1,
    "usabilit": 1,
    "study": 1,
    "catego": 1,
    "rization": 1,
    "annual": 1,
    "acm": 1,
    "sigir": 1,
    "development": 1,
    "retrieval": 1,
    "july": 1,
    "philadelphia": 1,
    "novovicova": 1,
    "\u00bdfloating": 1,
    "quinlan": 1,
    "\u00bddecision": 1,
    "multivalued": 1,
    "attributes\u00ef": 1,
    "richards": 1,
    "ed": 1,
    "oxford": 2,
    "eng": 1,
    "land": 1,
    "univ": 1,
    "automatic": 1,
    "cial": 1,
    "\u00bdboosting": 1,
    "retrieval\u00ef": 1,
    "ieeecon": 1,
    "ference": 1,
    "hilton": 1,
    "head": 1,
    "june": 1,
    "turk": 1,
    "pentland": 1,
    "\u00bdeigenfaces": 1,
    "recognition\u00ef": 1,
    "cognitive": 1,
    "neuroscience": 1,
    "yambor": 1,
    "\u00bdanal": 1,
    "ysis": 1,
    "fisher": 1,
    "discriminant": 1,
    "thesis": 1,
    "abilistic": 1,
    "estimates\u00ef": 1,
    "fall": 1
}