{
    "ieee": 41,
    "transactions": 8,
    "neural": 18,
    "networks": 12,
    "learning": 45,
    "systems": 11,
    "vol": 34,
    "july": 9,
    "frel": 85,
    "stable": 34,
    "feature": 186,
    "selection": 58,
    "algorithm": 62,
    "yun": 2,
    "li": 6,
    "member": 1,
    "jennie": 2,
    "si": 6,
    "fellow": 3,
    "guojing": 2,
    "zhou": 3,
    "shasha": 2,
    "huang": 5,
    "songcan": 2,
    "chen": 5,
    "abstract": 1,
    "two": 16,
    "factors": 1,
    "characterize": 1,
    "good": 3,
    "its": 19,
    "accuracy": 28,
    "stability": 115,
    "this": 46,
    "paper": 24,
    "aims": 2,
    "intro": 1,
    "ducing": 1,
    "new": 5,
    "approach": 6,
    "algorithms": 46,
    "innovation": 1,
    "centers": 1,
    "class": 10,
    "featureselection": 2,
    "called": 2,
    "weighting": 87,
    "regularizedenergy": 1,
    "based": 57,
    "properties": 5,
    "frelusing": 1,
    "or": 15,
    "regularization": 8,
    "investigated": 1,
    "addition": 6,
    "commonly": 1,
    "adopted": 4,
    "implementation": 1,
    "strategy": 11,
    "enhancedstability": 1,
    "an": 54,
    "ensemble": 56,
    "proposed": 11,
    "bound": 22,
    "forthe": 1,
    "also": 18,
    "presented": 4,
    "our": 13,
    "experiments": 6,
    "usingopen": 1,
    "source": 2,
    "real": 6,
    "microarray": 6,
    "data": 62,
    "which": 20,
    "challenging": 2,
    "highdimensionality": 1,
    "small": 14,
    "sample": 81,
    "size": 11,
    "problems": 10,
    "demonstrate": 2,
    "that": 66,
    "ourproposed": 2,
    "not": 14,
    "only": 5,
    "but": 7,
    "achievesbetter": 1,
    "comparable": 3,
    "than": 9,
    "some": 12,
    "other": 17,
    "popular": 5,
    "stablefeature": 1,
    "methods": 11,
    "index": 7,
    "terms": 5,
    "energy": 56,
    "uniform": 11,
    "ntroduction": 1,
    "been": 7,
    "active": 1,
    "research": 9,
    "area": 1,
    "machine": 9,
    "ining": 1,
    "decades": 1,
    "it": 23,
    "important": 8,
    "frequently": 2,
    "used": 21,
    "technique": 1,
    "dimensionreduction": 1,
    "by": 48,
    "removing": 10,
    "irrelevant": 1,
    "redundant": 2,
    "information": 7,
    "from": 62,
    "set": 38,
    "knowledge": 4,
    "discovery": 8,
    "tool": 2,
    "providing": 4,
    "insights": 1,
    "problem": 9,
    "through": 4,
    "interpretations": 1,
    "most": 15,
    "relevant": 3,
    "features": 20,
    "discussions": 2,
    "selec": 1,
    "tion": 6,
    "usually": 6,
    "center": 1,
    "technical": 1,
    "aspects": 1,
    "search": 2,
    "strategyand": 1,
    "evaluation": 5,
    "criteria": 3,
    "designed": 5,
    "with": 99,
    "different": 21,
    "strategies": 1,
    "broadly": 1,
    "fall": 1,
    "into": 5,
    "three": 4,
    "categories": 1,
    "lter": 1,
    "wrapper": 1,
    "hybrid": 1,
    "embedded": 1,
    "models": 5,
    "hand": 5,
    "if": 14,
    "categorization": 1,
    "output": 9,
    "characteristics": 1,
    "fea": 5,
    "ture": 6,
    "divided": 1,
    "either": 3,
    "ranking": 21,
    "subset": 23,
    "focus": 4,
    "comprehensive": 2,
    "survey": 2,
    "existing": 1,
    "techniques": 3,
    "generalframework": 1,
    "their": 5,
    "uni": 6,
    "cation": 29,
    "found": 4,
    "classi": 37,
    "another": 3,
    "measure": 12,
    "when": 9,
    "evaluating": 1,
    "quality": 3,
    "manuscript": 1,
    "received": 7,
    "august": 2,
    "revised": 1,
    "april": 1,
    "accepted": 2,
    "date": 2,
    "publication": 2,
    "current": 8,
    "versionjune": 1,
    "work": 2,
    "was": 8,
    "supported": 1,
    "part": 5,
    "national": 19,
    "naturalscience": 1,
    "foundation": 4,
    "china": 14,
    "unde": 1,
    "grant": 7,
    "science": 13,
    "jiangsu": 5,
    "provi": 1,
    "nce": 1,
    "under": 7,
    "government": 1,
    "scholarship": 1,
    "qinglan": 1,
    "project": 1,
    "high": 13,
    "technology": 3,
    "key": 3,
    "laboratory": 1,
    "wireless": 1,
    "sensor": 1,
    "college": 4,
    "com": 1,
    "puter": 1,
    "nanjing": 12,
    "university": 29,
    "posts": 4,
    "telecommunications": 2,
    "mail": 3,
    "liyun": 1,
    "njupt": 1,
    "edu": 5,
    "cn": 2,
    "school": 1,
    "electrical": 2,
    "computer": 9,
    "engineering": 5,
    "arizona": 4,
    "state": 4,
    "tempe": 1,
    "az": 3,
    "usa": 10,
    "asu": 2,
    "aeronautics": 2,
    "astronautics": 2,
    "nuaa": 3,
    "digital": 1,
    "object": 1,
    "identi": 4,
    "er": 16,
    "tnnls": 1,
    "here": 3,
    "means": 5,
    "insensitivity": 1,
    "result": 19,
    "variations": 6,
    "training": 24,
    "issue": 2,
    "particularly": 2,
    "applications": 5,
    "where": 20,
    "identifying": 1,
    "characteristic": 1,
    "mark": 1,
    "ers": 7,
    "explain": 1,
    "observed": 2,
    "phenomena": 1,
    "selectionalgorithm": 1,
    "without": 16,
    "constraint": 1,
    "results": 39,
    "signif": 1,
    "icantly": 1,
    "subsets": 17,
    "due": 5,
    "even": 1,
    "though": 1,
    "these": 9,
    "goodas": 1,
    "they": 12,
    "unstable": 1,
    "shake": 1,
    "con": 7,
    "dence": 1,
    "domain": 1,
    "experts": 2,
    "experimentally": 1,
    "validating": 1,
    "selected": 14,
    "interpret": 1,
    "discoveries": 1,
    "instance": 6,
    "analyzing": 6,
    "cancer": 7,
    "biomarkers": 1,
    "such": 16,
    "leukemia": 10,
    "available": 3,
    "setsusually": 1,
    "dimensional": 11,
    "yet": 1,
    "among": 7,
    "thousands": 1,
    "genetic": 2,
    "expression": 4,
    "levels": 2,
    "critical": 2,
    "discovered": 1,
    "links": 1,
    "labels": 2,
    "therefore": 15,
    "necessary": 1,
    "th": 2,
    "predictive": 1,
    "genes": 7,
    "common": 2,
    "samples": 18,
    "otherwise": 1,
    "will": 5,
    "lead": 2,
    "less": 3,
    "dent": 1,
    "diagnosis": 2,
    "consideration": 5,
    "importance": 1,
    "several": 9,
    "ensemblemethods": 1,
    "grouping": 1,
    "few": 2,
    "examples": 2,
    "earlier": 2,
    "those": 7,
    "existingstable": 1,
    "make": 3,
    "use": 24,
    "empirical": 3,
    "measurements": 1,
    "fell": 1,
    "short": 2,
    "explicitly": 1,
    "analysis": 20,
    "pressing": 1,
    "need": 6,
    "analytical": 1,
    "examin": 1,
    "ation": 1,
    "beyond": 1,
    "simple": 2,
    "thus": 8,
    "evident": 5,
    "guided": 1,
    "framework": 11,
    "featur": 3,
    "regularized": 4,
    "theproposed": 1,
    "regularizer": 32,
    "examined": 3,
    "introduced": 6,
    "analyzed": 5,
    "then": 41,
    "applied": 5,
    "open": 1,
    "effectiveness": 2,
    "both": 6,
    "dimen": 1,
    "sionality": 1,
    "hdsss": 7,
    "application": 2,
    "organized": 1,
    "follows": 6,
    "section": 13,
    "ii": 4,
    "iii": 2,
    "analyzes": 1,
    "experimental": 11,
    "shown": 7,
    "iv": 7,
    "concludes": 1,
    "nergy": 1,
    "provides": 2,
    "ed": 10,
    "many": 8,
    "probabilistic": 1,
    "nonprobabilistic": 1,
    "approaches": 5,
    "eee": 1,
    "personal": 1,
    "se": 1,
    "perm": 1,
    "itted": 1,
    "republication": 1,
    "redistri": 1,
    "bution": 1,
    "requires": 1,
    "permission": 1,
    "see": 2,
    "http": 3,
    "www": 2,
    "org": 1,
    "publications_standards": 1,
    "publications": 1,
    "rights": 1,
    "html": 1,
    "more": 5,
    "authorized": 15,
    "licensed": 15,
    "limited": 17,
    "fast": 15,
    "downloaded": 16,
    "february": 15,
    "utc": 15,
    "xplore": 15,
    "restrictions": 15,
    "apply": 16,
    "liet": 7,
    "al": 11,
    "prediction": 2,
    "decision": 2,
    "making": 1,
    "detection": 2,
    "conditional": 1,
    "density": 1,
    "estimation": 1,
    "consider": 19,
    "design": 2,
    "speci": 9,
    "cally": 3,
    "wewill": 1,
    "developing": 2,
    "discussed": 6,
    "well": 6,
    "implementations": 2,
    "paperprovides": 1,
    "inference": 2,
    "model": 18,
    "between": 25,
    "input": 10,
    "variable": 5,
    "xand": 1,
    "inferred": 1,
    "goodness": 1,
    "each": 30,
    "possible": 5,
    "guration": 2,
    "relating": 1,
    "xtoycan": 1,
    "measured": 2,
    "function": 54,
    "value": 10,
    "viewed": 4,
    "degree": 10,
    "compatibility": 1,
    "given": 13,
    "xandy": 1,
    "conventionally": 1,
    "values": 9,
    "correspond": 3,
    "highly": 4,
    "compatible": 3,
    "gurations": 1,
    "while": 10,
    "large": 3,
    "incompatible": 2,
    "urations": 1,
    "applying": 2,
    "giveninput": 1,
    "produces": 2,
    "answer": 15,
    "argminy": 2,
    "ye": 1,
    "entails": 1,
    "nding": 3,
    "best": 4,
    "yfor": 1,
    "ag": 1,
    "family": 3,
    "parameterized": 2,
    "functions": 35,
    "form": 2,
    "wis": 2,
    "parameter": 19,
    "train": 2,
    "setdcontaining": 1,
    "nsamples": 1,
    "xi": 66,
    "yi": 20,
    "xiis": 2,
    "ith": 3,
    "yiis": 2,
    "corresponding": 11,
    "desired": 2,
    "label": 2,
    "represented": 1,
    "vector": 14,
    "rd": 10,
    "nd": 4,
    "assess": 2,
    "dand": 3,
    "prior": 2,
    "about": 4,
    "task": 1,
    "were": 3,
    "collected": 1,
    "loss": 71,
    "functional": 1,
    "denoted": 7,
    "call": 1,
    "objective": 16,
    "accordingly": 2,
    "becomes": 2,
    "thew": 1,
    "minimizes": 2,
    "argminw": 1,
    "wld": 1,
    "dis": 1,
    "de": 49,
    "ned": 19,
    "ld": 27,
    "nn": 13,
    "right": 2,
    "side": 4,
    "per": 21,
    "rst": 12,
    "term": 3,
    "averaged": 12,
    "taken": 1,
    "over": 5,
    "respective": 4,
    "jd": 31,
    "simplicity": 2,
    "ther": 1,
    "regularizing": 1,
    "embed": 1,
    "arepreferable": 1,
    "others": 1,
    "classical": 2,
    "respectiv": 1,
    "ely": 1,
    "cost": 1,
    "balancing": 1,
    "factor": 1,
    "discussion": 3,
    "above": 12,
    "should": 8,
    "way": 1,
    "assigns": 2,
    "low": 2,
    "behaved": 1,
    "give": 1,
    "lowest": 4,
    "energyto": 1,
    "correct": 10,
    "answers": 7,
    "higher": 2,
    "including": 3,
    "incorrect": 9,
    "conversely": 1,
    "assign": 1,
    "would": 3,
    "generalized": 10,
    "margin": 19,
    "example": 7,
    "meet": 1,
    "conditions": 2,
    "asthe": 1,
    "before": 3,
    "introducing": 1,
    "following": 9,
    "nition": 21,
    "needed": 3,
    "letybe": 1,
    "discrete": 1,
    "offending": 6,
    "one": 18,
    "yie": 1,
    "described": 13,
    "consequently": 3,
    "eifor": 1,
    "notation": 5,
    "simpli": 1,
    "forxi": 1,
    "ei": 11,
    "positive": 1,
    "gap": 2,
    "theincorrect": 1,
    "ones": 1,
    "ris": 2,
    "assumed": 1,
    "convex": 14,
    "easily": 2,
    "satis": 1,
    "moreover": 4,
    "spacede": 1,
    "i": 1,
    "dl": 1,
    "eiand": 4,
    "eidenote": 1,
    "gradient": 3,
    "along": 4,
    "respectively": 19,
    "general": 2,
    "holds": 2,
    "true": 3,
    "region": 1,
    "eiin": 1,
    "space": 4,
    "wherever": 1,
    "eiis": 2,
    "smaller": 2,
    "eiplus": 1,
    "larger": 1,
    "pushes": 1,
    "down": 2,
    "pulls": 1,
    "causes": 1,
    "surface": 1,
    "slanted": 1,
    "toward": 2,
    "meets": 1,
    "xiand": 2,
    "yibe": 1,
    "remark": 19,
    "there": 3,
    "realizations": 4,
    "hinge": 2,
    "log": 40,
    "quare": 1,
    "square": 28,
    "exponential": 3,
    "losses": 7,
    "nite": 1,
    "exp": 1,
    "max": 3,
    "win": 3,
    "eis": 2,
    "weight": 10,
    "algorithmsimply": 1,
    "nds": 1,
    "func": 2,
    "chosen": 3,
    "representative": 1,
    "construct": 2,
    "derive": 1,
    "algor": 2,
    "ithms": 1,
    "however": 6,
    "theoretical": 5,
    "obtained": 15,
    "considered": 12,
    "weightvectors": 1,
    "second": 3,
    "ss": 1,
    "ni": 1,
    "after": 4,
    "explic": 1,
    "itly": 1,
    "summarize": 3,
    "issues": 2,
    "weightingalgorithm": 3,
    "using": 23,
    "appropriate": 3,
    "determine": 3,
    "properly": 2,
    "designing": 1,
    "structure": 1,
    "addressingthese": 1,
    "leads": 3,
    "pushed": 1,
    "pulled": 1,
    "incorrectanswers": 1,
    "maintaining": 1,
    "address": 1,
    "cri": 1,
    "teria": 1,
    "offend": 1,
    "ing": 5,
    "resort": 1,
    "nearest": 3,
    "neighbor": 2,
    "scheme": 1,
    "note": 9,
    "thenn": 1,
    "nonlinear": 1,
    "mapping": 1,
    "patterns": 1,
    "considerable": 1,
    "attention": 1,
    "aga": 1,
    "recently": 1,
    "since": 13,
    "demonstrated": 2,
    "ef": 1,
    "cient": 3,
    "art": 1,
    "world": 3,
    "additionally": 1,
    "distance": 7,
    "same": 8,
    "nh": 9,
    "determined": 2,
    "so": 7,
    "long": 1,
    "similarly": 10,
    "nm": 7,
    "parame": 1,
    "terized": 1,
    "ande": 1,
    "weighted": 2,
    "manhattan": 3,
    "distances": 4,
    "wt": 29,
    "denotes": 1,
    "element": 1,
    "wise": 1,
    "ab": 1,
    "solute": 1,
    "operator": 1,
    "component": 1,
    "argument": 1,
    "dimension": 2,
    "din": 1,
    "cases": 1,
    "tdenotes": 1,
    "transpose": 1,
    "andwis": 1,
    "associated": 1,
    "solution": 1,
    "basedlearning": 1,
    "setting": 1,
    "step": 10,
    "initialize": 2,
    "dt": 1,
    "andnm": 1,
    "calculate": 4,
    "obtain": 18,
    "optimal": 7,
    "optimization": 3,
    "gradientdescent": 1,
    "illustrate": 2,
    "minimization": 1,
    "next": 2,
    "place": 4,
    "position": 1,
    "frelas": 1,
    "ein": 1,
    "employ": 1,
    "mentioned": 2,
    "integrated": 1,
    "regularizers": 9,
    "objectiveloss": 1,
    "could": 1,
    "derived": 4,
    "local": 3,
    "special": 2,
    "case": 8,
    "combinedwith": 1,
    "enhance": 1,
    "diversity": 2,
    "base": 15,
    "selectors": 7,
    "algo": 3,
    "rithm": 1,
    "offrel": 2,
    "time": 5,
    "perspective": 1,
    "provided": 6,
    "pointed": 1,
    "out": 1,
    "purposes": 2,
    "nns": 8,
    "ne": 7,
    "nonetheless": 1,
    "standard": 1,
    "measures": 1,
    "euclidean": 1,
    "alsoeligible": 1,
    "candidates": 1,
    "creating": 2,
    "any": 7,
    "obtaining": 2,
    "resorting": 1,
    "corresponds": 2,
    "random": 4,
    "sampling": 4,
    "parameters": 1,
    "aandm": 1,
    "produce": 2,
    "bootstrap": 19,
    "rt": 33,
    "perform": 1,
    "wd": 91,
    "mwd": 1,
    "effective": 2,
    "producing": 1,
    "robust": 4,
    "accurate": 2,
    "solutions": 6,
    "learn": 8,
    "signi": 2,
    "cant": 2,
    "applica": 2,
    "tions": 6,
    "learningmaking": 1,
    "bagging": 2,
    "consists": 3,
    "averaging": 5,
    "estimators": 4,
    "built": 1,
    "subsamples": 1,
    "original": 8,
    "similar": 9,
    "supervised": 1,
    "essential": 1,
    "steps": 1,
    "involves": 1,
    "aggregates": 1,
    "onmdifferent": 1,
    "achieved": 1,
    "let": 11,
    "integer": 1,
    "closest": 1,
    "sequence": 5,
    "randomly": 8,
    "draw": 2,
    "natural": 5,
    "replacement": 9,
    "denote": 4,
    "mbootstrap": 3,
    "xrt": 1,
    "yrt": 1,
    "mand": 4,
    "drawn": 7,
    "independently": 1,
    "letwd": 1,
    "outcome": 2,
    "tth": 1,
    "mbase": 4,
    "rm": 5,
    "mm": 8,
    "aggregated": 1,
    "outputs": 7,
    "pseudocode": 1,
    "tability": 1,
    "sense": 6,
    "boundedin": 1,
    "response": 1,
    "may": 4,
    "entail": 1,
    "scenarios": 2,
    "perturbation": 3,
    "level": 4,
    "caused": 3,
    "adding": 3,
    "noise": 1,
    "combination": 1,
    "types": 1,
    "perturbations": 4,
    "mayimpose": 1,
    "cause": 1,
    "concerns": 1,
    "regression": 3,
    "thoroughly": 1,
    "inthe": 1,
    "descr": 1,
    "ibed": 1,
    "sta": 3,
    "bility": 2,
    "empirically": 2,
    "pr": 1,
    "oviding": 1,
    "me": 1,
    "account": 2,
    "property": 4,
    "fol": 1,
    "lows": 1,
    "directly": 2,
    "changing": 3,
    "examine": 5,
    "impact": 1,
    "proceed": 1,
    "dof": 1,
    "nfrom": 1,
    "certain": 1,
    "distribution": 4,
    "independent": 1,
    "identically": 1,
    "distributed": 1,
    "idenote": 1,
    "modi": 1,
    "": 2,
    "bydi": 1,
    "awith": 2,
    "vectors": 5,
    "wdandwd": 5,
    "ifor": 3,
    "aisuniformly": 1,
    "nand": 1,
    "eh": 1,
    "intuitively": 1,
    "greater": 1,
    "theith": 1,
    "distorted": 1,
    "changed": 2,
    "dtodi": 1,
    "el": 1,
    "tt": 1,
    "wdidenote": 1,
    "di": 1,
    "triangle": 4,
    "inequality": 9,
    "wdi": 3,
    "according": 6,
    "reduced": 1,
    "removingone": 1,
    "words": 2,
    "formulated": 1,
    "removal": 1,
    "implies": 1,
    "cept": 1,
    "condition": 2,
    "deviates": 1,
    "stabil": 1,
    "ity": 1,
    "thestability": 1,
    "aunder": 1,
    "beginning": 1,
    "sections": 1,
    "discuss": 1,
    "withr": 1,
    "being": 3,
    "choice": 1,
    "shorthand": 2,
    "wtzi": 3,
    "ziis": 1,
    "trans": 10,
    "formation": 1,
    "expressions": 2,
    "ziare": 1,
    "zi": 6,
    "furthermore": 2,
    "s": 8,
    "bounded": 2,
    "normalized": 1,
    "andld": 4,
    "respec": 2,
    "tively": 2,
    "wtzj": 2,
    "il": 8,
    "theorem": 9,
    "dcontain": 2,
    "ninput": 2,
    "rdwith": 1,
    "transformation": 1,
    "ziprovided": 1,
    "assume": 5,
    "lipchitz": 2,
    "constant": 1,
    "twdandwd": 2,
    "ibe": 4,
    "minimizing": 5,
    "uniformly": 4,
    "stabilitybound": 2,
    "df": 2,
    "proof": 10,
    "refer": 4,
    "appendix": 5,
    "shows": 3,
    "zero": 4,
    "tight": 1,
    "qsamples": 4,
    "single": 6,
    "removed": 5,
    "qtimes": 1,
    "now": 5,
    "turn": 2,
    "regu": 2,
    "larizer": 2,
    "nature": 1,
    "norm": 4,
    "sparse": 13,
    "solu": 1,
    "contains": 4,
    "elements": 1,
    "xu": 2,
    "et": 3,
    "proved": 2,
    "sparsity": 3,
    "odds": 2,
    "show": 3,
    "encouragessparsity": 1,
    "susceptible": 1,
    "identify": 2,
    "irfs": 1,
    "irf": 1,
    "dependent": 1,
    "othe": 1,
    "affect": 1,
    "discriminative": 1,
    "power": 1,
    "nonunique": 1,
    "ill": 1,
    "posed": 1,
    "weprovide": 1,
    "constraints": 2,
    "preserved": 1,
    "dfrom": 2,
    "exists": 1,
    "unique": 2,
    "unknown": 2,
    "estimates": 2,
    "optimality": 2,
    "refers": 2,
    "xj": 5,
    "carry": 1,
    "exactly": 5,
    "below": 4,
    "weights": 12,
    "isexactly": 1,
    "analyze": 5,
    "additional": 1,
    "andjd": 2,
    "differ": 2,
    "entiable": 1,
    "satisfy": 3,
    "strong": 6,
    "convexity": 7,
    "thestrong": 1,
    "inner": 1,
    "product": 1,
    "elaborated": 1,
    "differentiable": 5,
    "strongly": 5,
    "just": 2,
    "andw": 2,
    "exactlysparse": 1,
    "inversely": 1,
    "affected": 1,
    "constants": 2,
    "scales": 1,
    "makes": 2,
    "st": 2,
    "ability": 2,
    "qremoved": 1,
    "remove": 1,
    "asfollows": 1,
    "e": 5,
    "whose": 2,
    "andwd": 1,
    "mis": 3,
    "number": 8,
    "expectation": 2,
    "dcontaining": 1,
    "samp": 1,
    "ling": 1,
    "create": 4,
    "fort": 1,
    "sequencerandomly": 1,
    "rmare": 2,
    "be": 1,
    "withstability": 1,
    "a": 8,
    "indicates": 2,
    "tighter": 1,
    "consistent": 3,
    "observations": 1,
    "exper": 2,
    "iments": 1,
    "improves": 1,
    "approximately": 1,
    "aq": 1,
    "qis": 1,
    "xperiments": 1,
    "evaluate": 4,
    "comparisons": 2,
    "four": 5,
    "life": 1,
    "areconsidered": 1,
    "prob": 1,
    "lems": 1,
    "tox": 3,
    "smk": 3,
    "prostate": 7,
    "sets": 6,
    "datasets": 1,
    "php": 1,
    "later": 1,
    "twoare": 1,
    "goal": 1,
    "linked": 1,
    "diseases": 1,
    "instances": 1,
    "consist": 1,
    "myocarditis": 1,
    "dilated": 1,
    "cardiomyopathy": 1,
    "dcm": 3,
    "infected": 1,
    "males": 2,
    "females": 2,
    "uninfected": 1,
    "often": 2,
    "viral": 1,
    "infec": 1,
    "occur": 1,
    "men": 1,
    "women": 1,
    "infection": 1,
    "increases": 1,
    "person": 1,
    "risk": 1,
    "dying": 1,
    "heart": 1,
    "failure": 1,
    "smokers": 1,
    "lung": 1,
    "total": 2,
    "tested": 3,
    "leukemias": 1,
    "primary": 1,
    "disorders": 1,
    "bone": 1,
    "marrow": 1,
    "malignant": 1,
    "neoplasms": 1,
    "hematopoietic": 1,
    "stem": 1,
    "cells": 1,
    "includes": 2,
    "betested": 1,
    "acute": 3,
    "le": 1,
    "ukemia": 1,
    "patients": 2,
    "lymphoblastic": 1,
    "myelogenous": 1,
    "contai": 1,
    "ns": 1,
    "studied": 1,
    "tumor": 1,
    "normal": 1,
    "share": 1,
    "traits": 1,
    "extremely": 1,
    "dimensionality": 1,
    "latent": 1,
    "variables": 1,
    "typical": 1,
    "comparison": 5,
    "generally": 2,
    "conven": 1,
    "tional": 2,
    "directlyfor": 1,
    "instead": 1,
    "expected": 1,
    "improve": 4,
    "proper": 1,
    "ties": 1,
    "ensemblefrel": 1,
    "conducting": 1,
    "still": 2,
    "provide": 2,
    "em": 1,
    "versions": 2,
    "rithms": 2,
    "ithm": 1,
    "named": 1,
    "en": 37,
    "chose": 1,
    "include": 6,
    "relief": 18,
    "relieff": 14,
    "fisher": 14,
    "score": 8,
    "variance": 2,
    "reduction": 2,
    "vr": 10,
    "lmba": 15,
    "respectivel": 1,
    "ensem": 1,
    "ble": 1,
    "suc": 1,
    "cessful": 1,
    "idea": 2,
    "iteratively": 1,
    "estimate": 1,
    "discrim": 1,
    "inate": 1,
    "neighboring": 1,
    "iteration": 1,
    "iis": 2,
    "xiare": 1,
    "differentclass": 1,
    "pth": 2,
    "updated": 1,
    "iand": 1,
    "extension": 1,
    "considering": 1,
    "deal": 1,
    "multiple": 1,
    "like": 1,
    "highlight": 1,
    "relationship": 1,
    "first": 1,
    "hypothesis": 1,
    "differences": 2,
    "systematic": 1,
    "regularizations": 1,
    "calculates": 1,
    "margins": 1,
    "obtains": 1,
    "pool": 1,
    "candidate": 2,
    "widely": 1,
    "weightssuch": 1,
    "spanned": 1,
    "points": 2,
    "classes": 3,
    "criterionfor": 1,
    "prefers": 1,
    "obtainedby": 1,
    "computing": 3,
    "deviation": 1,
    "mean": 1,
    "nonensemble": 3,
    "uses": 1,
    "performing": 1,
    "aim": 1,
    "combine": 1,
    "derivedfrom": 1,
    "prede": 1,
    "range": 1,
    "measurement": 2,
    "almost": 1,
    "ulti": 1,
    "mate": 1,
    "selector": 2,
    "prominent": 1,
    "litera": 1,
    "ranks": 5,
    "performance": 3,
    "compute": 2,
    "turned": 1,
    "asin": 1,
    "statistically": 1,
    "theref": 1,
    "ore": 1,
    "dwith": 1,
    "ninstances": 1,
    "dfeatures": 2,
    "csampling": 1,
    "fs": 1,
    "n": 3,
    "dbased": 1,
    "name": 1,
    "rl": 12,
    "distinguish": 1,
    "ensemblefeature": 1,
    "procedure": 3,
    "subsequently": 1,
    "performed": 4,
    "csample": 2,
    "emphasized": 1,
    "betransformed": 1,
    "cfeature": 1,
    "rc": 2,
    "oncsample": 1,
    "transform": 1,
    "rank": 6,
    "largest": 1,
    "assigned": 1,
    "worst": 1,
    "sampled": 2,
    "rlt": 3,
    "rlm": 2,
    "featureweighting": 1,
    "correspondingly": 1,
    "transformed": 1,
    "vd": 2,
    "assignment": 1,
    "rule": 1,
    "nal": 2,
    "bootstrapping": 2,
    "lth": 1,
    "comparing": 1,
    "similaritiesamong": 1,
    "overall": 1,
    "average": 2,
    "similarity": 5,
    "pairwise": 2,
    "similarities": 2,
    "sim": 2,
    "represents": 1,
    "rland": 1,
    "spearman": 2,
    "correlation": 1,
    "coef": 2,
    "rp": 2,
    "containing": 1,
    "percentage": 1,
    "respect": 3,
    "relatively": 1,
    "changes": 1,
    "dataset": 1,
    "sam": 1,
    "ple": 1,
    "patient": 1,
    "simultaneously": 1,
    "method": 2,
    "improving": 1,
    "fig": 11,
    "seven": 1,
    "selectionalgorithms": 1,
    "algorith": 1,
    "pairs": 1,
    "calculated": 2,
    "orrelation": 1,
    "effect": 3,
    "namely": 2,
    "how": 1,
    "maffects": 1,
    "display": 1,
    "anupward": 1,
    "trend": 1,
    "mincreases": 1,
    "saturates": 1,
    "around": 1,
    "remains": 1,
    "observethat": 1,
    "always": 1,
    "highest": 1,
    "regular": 4,
    "izer": 2,
    "observation": 1,
    "ization": 1,
    "included": 3,
    "limitations": 1,
    "observe": 1,
    "increase": 1,
    "improved": 1,
    "evaluated": 2,
    "conjunc": 1,
    "conducted": 1,
    "linear": 7,
    "support": 2,
    "svm": 12,
    "polynomial": 5,
    "kernel": 3,
    "consid": 1,
    "ered": 1,
    "easy": 1,
    "assessed": 1,
    "fold": 4,
    "cross": 1,
    "validation": 1,
    "imental": 1,
    "sec": 1,
    "witha": 1,
    "feat": 1,
    "ure": 1,
    "ranked": 1,
    "descending": 1,
    "order": 1,
    "numbers": 1,
    "top": 1,
    "amount": 1,
    "test": 1,
    "testingdata": 1,
    "folds": 1,
    "summary": 2,
    "accu": 1,
    "racy": 1,
    "poly": 1,
    "nomial": 1,
    "ofaccuracy": 1,
    "summarized": 1,
    "figs": 1,
    "consistently": 1,
    "better": 2,
    "tradeoff": 7,
    "take": 1,
    "reference": 1,
    "robustness": 1,
    "clas": 1,
    "trade": 1,
    "off": 1,
    "sat": 2,
    "imple": 1,
    "election": 1,
    "mented": 1,
    "rstain": 1,
    "compared": 1,
    "onclusion": 1,
    "useful": 2,
    "stabilityof": 1,
    "further": 1,
    "improvement": 1,
    "andensemble": 1,
    "benchmark": 1,
    "performances": 1,
    "chal": 1,
    "lenging": 1,
    "thatour": 1,
    "outper": 1,
    "forms": 1,
    "ppendix": 1,
    "iare": 2,
    "retain": 1,
    "mini": 1,
    "mum": 1,
    "equations": 1,
    "replace": 1,
    "evidentthat": 1,
    "dzj": 8,
    "nl": 3,
    "dzi": 9,
    "ease": 1,
    "together": 1,
    "tzj": 4,
    "tzi": 1,
    "izj": 6,
    "jensen": 3,
    "awt": 1,
    "substituting": 1,
    "identities": 1,
    "izi": 4,
    "because": 1,
    "ad": 2,
    "left": 2,
    "amounts": 1,
    "dwd": 1,
    "cauchy": 2,
    "schwarz": 2,
    "combining": 1,
    "letwdandwd": 1,
    "wdand": 1,
    "start": 1,
    "decomposability": 3,
    "exact": 1,
    "suppose": 2,
    "nonzero": 1,
    "sbe": 1,
    "bcomponents": 1,
    "nonzeroweights": 1,
    "fromw": 1,
    "zeros": 1,
    "dbe": 1,
    "thed": 1,
    "subspace": 14,
    "sp": 1,
    "orthogonal": 3,
    "complement": 4,
    "capturing": 1,
    "ofm": 1,
    "deviating": 1,
    "away": 1,
    "ready": 1,
    "itsorthogonal": 1,
    "pair": 1,
    "mandm": 2,
    "decompos": 1,
    "able": 2,
    "simplify": 1,
    "drop": 1,
    "subscript": 1,
    "winstead": 1,
    "minimizer": 1,
    "wmust": 1,
    "ifld": 1,
    "replaced": 1,
    "ences": 1,
    "difference": 2,
    "subspaces": 2,
    "projections": 2,
    "onto": 1,
    "projection": 2,
    "operation": 1,
    "argminu": 1,
    "wm": 34,
    "wonto": 1,
    "nitions": 1,
    "analogous": 1,
    "manner": 1,
    "mcontaining": 1,
    "guarantee": 1,
    "etween": 1,
    "sd": 1,
    "expressed": 1,
    "generality": 2,
    "conclude": 1,
    "hence": 1,
    "wmis": 1,
    "nonexpansive": 1,
    "end": 1,
    "change": 1,
    "wback": 1,
    "taking": 1,
    "inside": 1,
    "sinequality": 1,
    "fbe": 1,
    "xbe": 1,
    "he": 8,
    "xifrom": 1,
    "possibilities": 1,
    "whether": 1,
    "ibelongs": 1,
    "ror": 1,
    "introduce": 1,
    "indicator": 1,
    "abecause": 1,
    "done": 1,
    "references": 1,
    "zhao": 1,
    "spectral": 1,
    "selectio": 1,
    "mining": 8,
    "ultrahigh": 1,
    "ph": 3,
    "dissertation": 1,
    "dept": 2,
    "chool": 1,
    "comput": 3,
    "informat": 1,
    "syst": 3,
    "eng": 2,
    "niv": 1,
    "phoenix": 2,
    "liu": 1,
    "yu": 9,
    "integrating": 1,
    "clustering": 1,
    "knowl": 6,
    "pp": 37,
    "apr": 1,
    "guyon": 1,
    "elisseeff": 3,
    "introduction": 1,
    "jan": 6,
    "saeys": 2,
    "abeel": 2,
    "van": 3,
    "peer": 3,
    "proc": 9,
    "eur": 2,
    "conf": 8,
    "mach": 8,
    "databases": 1,
    "loscalzo": 2,
    "ding": 2,
    "consensus": 1,
    "group": 1,
    "acm": 5,
    "sigkdd": 3,
    "int": 6,
    "helleputte": 1,
    "dupont": 1,
    "biomarker": 2,
    "bioinformatics": 1,
    "gao": 1,
    "aaai": 1,
    "artif": 1,
    "intell": 3,
    "woznica": 1,
    "nguyen": 1,
    "kalousis": 2,
    "han": 2,
    "dec": 1,
    "berens": 1,
    "gene": 4,
    "via": 3,
    "biol": 2,
    "bioinform": 1,
    "feb": 4,
    "dense": 1,
    "groups": 1,
    "chem": 1,
    "lecun": 1,
    "chopra": 1,
    "hadsell": 1,
    "ranzato": 1,
    "tutorial": 1,
    "cambridge": 2,
    "ma": 3,
    "mit": 2,
    "press": 2,
    "das": 1,
    "garg": 1,
    "rajaram": 1,
    "google": 1,
    "news": 1,
    "personalization": 1,
    "scalable": 1,
    "onlin": 1,
    "collaborative": 1,
    "ltering": 1,
    "wide": 1,
    "web": 1,
    "dudoit": 1,
    "fridlyand": 1,
    "spee": 1,
    "discrimination": 1,
    "tum": 1,
    "ors": 1,
    "amer": 1,
    "statist": 3,
    "assoc": 1,
    "sun": 1,
    "todorovic": 1,
    "goodi": 1,
    "son": 1,
    "pattern": 5,
    "anal": 2,
    "sep": 1,
    "domingos": 1,
    "things": 1,
    "know": 1,
    "commun": 1,
    "wang": 3,
    "chiang": 1,
    "elite": 1,
    "pruned": 1,
    "trust": 1,
    "tech": 2,
    "netw": 3,
    "tang": 1,
    "zheng": 1,
    "chua": 1,
    "concept": 1,
    "multimedia": 1,
    "gutta": 1,
    "jonathon": 1,
    "wechsler": 1,
    "mixture": 1,
    "gende": 1,
    "ethnic": 1,
    "origin": 1,
    "pose": 1,
    "human": 1,
    "faces": 1,
    "jul": 1,
    "kuncheva": 1,
    "rodriguez": 1,
    "plumpton": 1,
    "linden": 1,
    "johnston": 1,
    "ense": 1,
    "mbles": 1,
    "fmri": 1,
    "med": 1,
    "imag": 1,
    "breiman": 1,
    "predictors": 1,
    "aug": 1,
    "bousquet": 1,
    "generalization": 1,
    "res": 1,
    "evgeniou": 1,
    "pontil": 1,
    "randomized": 1,
    "agarwal": 1,
    "niyogi": 1,
    "genera": 1,
    "lization": 1,
    "bounds": 1,
    "algorithmic": 1,
    "caramanis": 1,
    "mannor": 1,
    "free": 1,
    "lunch": 1,
    "nesterov": 1,
    "introductory": 1,
    "lectures": 1,
    "basic": 1,
    "course": 1,
    "boston": 1,
    "kluwer": 1,
    "tan": 1,
    "tsang": 1,
    "minimax": 1,
    "logistic": 1,
    "very": 1,
    "oct": 1,
    "golub": 1,
    "molecular": 1,
    "monitoring": 1,
    "singh": 1,
    "correlates": 1,
    "clinical": 1,
    "behavior": 1,
    "cell": 1,
    "kira": 1,
    "rendell": 1,
    "practical": 1,
    "workshop": 1,
    "kononenko": 2,
    "estimating": 1,
    "attributes": 1,
    "extensions": 1,
    "robnik": 1,
    "sikonja": 1,
    "rrelieff": 1,
    "nos": 1,
    "duda": 1,
    "hart": 1,
    "stork": 1,
    "york": 1,
    "ny": 2,
    "wiley": 1,
    "dietterich": 1,
    "directions": 1,
    "ai": 1,
    "mag": 1,
    "crammer": 1,
    "gilad": 1,
    "bachrach": 1,
    "navot": 1,
    "tishby": 1,
    "lvq": 1,
    "advances": 2,
    "processing": 3,
    "lu": 1,
    "recognit": 1,
    "prados": 1,
    "hilario": 1,
    "study": 1,
    "spaces": 1,
    "chang": 1,
    "lin": 1,
    "libsvm": 2,
    "library": 1,
    "machines": 1,
    "online": 1,
    "csie": 1,
    "ntu": 1,
    "tw": 1,
    "cjlin": 1,
    "papers": 3,
    "ps": 1,
    "gz": 1,
    "geer": 1,
    "lasso": 1,
    "ann": 1,
    "negahban": 3,
    "ravikumar": 3,
    "wainwright": 3,
    "decomposable": 3,
    "sci": 1,
    "eecs": 1,
    "univ": 1,
    "california": 1,
    "berkeley": 2,
    "ca": 1,
    "rep": 1,
    "red": 1,
    "hook": 1,
    "curran": 1,
    "associates": 1,
    "inc": 1,
    "m": 1,
    "chongqing": 2,
    "post": 1,
    "doctoral": 1,
    "depart": 2,
    "ment": 2,
    "shang": 1,
    "hai": 1,
    "jiao": 2,
    "tong": 2,
    "shanghai": 3,
    "professor": 2,
    "telecommunica": 1,
    "published": 1,
    "refereed": 1,
    "researchinterests": 1,
    "parallel": 1,
    "dr": 2,
    "co": 2,
    "chair": 1,
    "international": 1,
    "conference": 2,
    "currently": 3,
    "sponsoredby": 1,
    "founda": 1,
    "f": 1,
    "degrees": 1,
    "tsinghua": 1,
    "beijing": 1,
    "theph": 1,
    "notre": 2,
    "dame": 2,
    "she": 8,
    "faculty": 2,
    "department": 1,
    "made": 1,
    "efforts": 1,
    "build": 1,
    "capability": 1,
    "studying": 1,
    "fundamental": 1,
    "neuroscience": 1,
    "questions": 1,
    "regards": 1,
    "tothe": 1,
    "frontal": 1,
    "cortex": 1,
    "lab": 1,
    "equippedwith": 1,
    "multichannel": 1,
    "unit": 1,
    "extracellular": 1,
    "recording": 1,
    "behaving": 1,
    "rat": 1,
    "chronic": 1,
    "physiological": 1,
    "interests": 4,
    "dynamic": 2,
    "neura": 1,
    "network": 1,
    "approximation": 1,
    "approximate": 1,
    "programming": 1,
    "associate": 1,
    "editor": 2,
    "ransactions": 3,
    "semi": 1,
    "conductor": 1,
    "manufacturing": 1,
    "automatic": 1,
    "control": 1,
    "served": 2,
    "professional": 1,
    "organi": 1,
    "zations": 1,
    "executive": 1,
    "boards": 1,
    "interna": 1,
    "committees": 1,
    "vice": 1,
    "president": 1,
    "education": 1,
    "withthe": 1,
    "computation": 1,
    "intelligence": 1,
    "society": 2,
    "advisor": 1,
    "nsf": 1,
    "social": 1,
    "behavioral": 1,
    "economi": 1,
    "cal": 1,
    "directory": 1,
    "proposal": 1,
    "review": 1,
    "panels": 1,
    "consulted": 1,
    "intel": 2,
    "public": 1,
    "service": 1,
    "medtronic": 1,
    "distinguished": 1,
    "lect": 1,
    "urer": 1,
    "computational": 1,
    "ligence": 1,
    "action": 1,
    "recipient": 1,
    "wh": 1,
    "ite": 1,
    "house": 1,
    "presidential": 1,
    "award": 2,
    "motorola": 1,
    "excellence": 1,
    "bachelor": 2,
    "pursuing": 2,
    "master": 2,
    "xuhai": 1,
    "xuzhou": 1,
    "andtelecommunications": 1,
    "mathe": 1,
    "matics": 1,
    "zhejiang": 1,
    "hangzhou": 1,
    "communica": 1,
    "versity": 1,
    "full": 1,
    "authored": 2,
    "scienti": 1,
    "reviewed": 1,
    "recognition": 1
}