{
    "see": 5,
    "discussions": 1,
    "st": 1,
    "ats": 1,
    "author": 2,
    "pr": 1,
    "ofiles": 1,
    "or": 3,
    "this": 16,
    "public": 2,
    "ation": 2,
    "https": 10,
    "www": 7,
    "researchgate": 1,
    "ne": 2,
    "explainable": 33,
    "ai": 61,
    "brief": 3,
    "su": 1,
    "rvey": 1,
    "history": 4,
    "research": 11,
    "areas": 4,
    "approaches": 7,
    "challenges": 4,
    "chapt": 1,
    "er": 2,
    "sept": 1,
    "ember": 1,
    "doi": 4,
    "citations": 4,
    "including": 2,
    "feiyu": 3,
    "leno": 2,
    "vo": 2,
    "publica": 3,
    "tions": 4,
    "": 12,
    "profile": 3,
    "hans": 2,
    "szkoreit": 1,
    "deutsches": 1,
    "orschungsz": 1,
    "entrum": 1,
    "r": 1,
    "nstliche": 1,
    "int": 1,
    "ellig": 1,
    "enz": 1,
    "wei": 2,
    "an": 13,
    "ontent": 1,
    "ollo": 1,
    "wing": 1,
    "age": 1,
    "was": 5,
    "uplo": 1,
    "aded": 2,
    "januar": 1,
    "user": 1,
    "equest": 1,
    "ed": 2,
    "enhanc": 1,
    "ement": 1,
    "wnlo": 1,
    "file": 1,
    "survey": 4,
    "yangzhou": 1,
    "dongyan": 1,
    "jun": 1,
    "lab": 1,
    "lenovo": 3,
    "group": 2,
    "china": 3,
    "fxu": 1,
    "com": 4,
    "gmbh": 1,
    "germany": 1,
    "giance": 1,
    "technologies": 1,
    "uszkoreit": 1,
    "dfki": 1,
    "de": 4,
    "computer": 9,
    "science": 4,
    "technology": 3,
    "peking": 1,
    "university": 2,
    "zhaody": 1,
    "pku": 1,
    "edu": 2,
    "cn": 3,
    "tsinghua": 2,
    "dcszj": 1,
    "mail": 1,
    "abstract": 1,
    "deep": 19,
    "learning": 24,
    "made": 1,
    "signi": 3,
    "cant": 2,
    "contribution": 1,
    "recent": 5,
    "progress": 2,
    "arti": 12,
    "cial": 11,
    "intelligence": 10,
    "comparison": 1,
    "traditional": 2,
    "machine": 11,
    "methods": 9,
    "such": 6,
    "decision": 19,
    "trees": 4,
    "support": 3,
    "vector": 5,
    "machines": 1,
    "achieved": 2,
    "substantial": 1,
    "improvement": 1,
    "various": 1,
    "prediction": 14,
    "tasks": 4,
    "however": 7,
    "neural": 17,
    "networks": 10,
    "dnns": 7,
    "comparably": 1,
    "weak": 1,
    "explaining": 7,
    "their": 9,
    "inference": 5,
    "processes": 2,
    "nal": 3,
    "results": 5,
    "they": 6,
    "typically": 1,
    "treated": 1,
    "black": 5,
    "box": 6,
    "by": 22,
    "both": 11,
    "developers": 5,
    "users": 6,
    "some": 2,
    "people": 5,
    "even": 2,
    "consider": 1,
    "current": 4,
    "stage": 1,
    "rather": 2,
    "alchemy": 6,
    "than": 6,
    "real": 5,
    "many": 2,
    "world": 2,
    "applications": 1,
    "business": 1,
    "process": 3,
    "optimization": 2,
    "medical": 3,
    "diagnosis": 3,
    "investment": 2,
    "recommendation": 1,
    "explainability": 7,
    "transparency": 5,
    "our": 3,
    "systems": 12,
    "become": 6,
    "particularly": 1,
    "essential": 1,
    "who": 4,
    "ected": 5,
    "decisions": 6,
    "furthermore": 2,
    "researchers": 3,
    "create": 1,
    "solutions": 2,
    "years": 4,
    "explainabil": 1,
    "ity": 1,
    "received": 1,
    "increasing": 2,
    "attention": 2,
    "re": 2,
    "search": 1,
    "community": 1,
    "industry": 2,
    "paper": 2,
    "rst": 1,
    "introduces": 3,
    "starting": 3,
    "from": 10,
    "expert": 5,
    "latest": 1,
    "context": 2,
    "modern": 2,
    "then": 3,
    "describes": 1,
    "major": 1,
    "state": 3,
    "art": 1,
    "ends": 1,
    "with": 7,
    "discussion": 1,
    "future": 3,
    "directions": 2,
    "keywords": 1,
    "intelligible": 3,
    "learn": 3,
    "ing": 1,
    "interfaces": 1,
    "xai": 7,
    "interpretability": 2,
    "wiktionary": 3,
    "word": 1,
    "explain": 8,
    "means": 1,
    "humans": 7,
    "to": 1,
    "make": 4,
    "plain": 1,
    "manifest": 1,
    "clear": 1,
    "obscurity": 1,
    "illustrate": 3,
    "meaning": 3,
    "of": 1,
    "scienti": 3,
    "explanation": 9,
    "supposed": 1,
    "cover": 1,
    "least": 2,
    "two": 10,
    "parts": 6,
    "xu": 6,
    "et": 12,
    "al": 12,
    "object": 7,
    "explained": 4,
    "explanandum": 1,
    "latin": 2,
    "content": 3,
    "explanans": 1,
    "not": 9,
    "new": 5,
    "topic": 2,
    "earliest": 1,
    "work": 6,
    "could": 7,
    "found": 2,
    "literature": 1,
    "published": 2,
    "forty": 1,
    "ago": 1,
    "where": 2,
    "via": 2,
    "applied": 1,
    "rules": 4,
    "since": 3,
    "began": 1,
    "scientists": 1,
    "argued": 1,
    "that": 22,
    "intelligent": 1,
    "should": 6,
    "mostly": 2,
    "when": 4,
    "it": 15,
    "comes": 1,
    "if": 5,
    "rule": 1,
    "based": 4,
    "system": 12,
    "rejects": 1,
    "credit": 1,
    "card": 1,
    "payment": 1,
    "reasons": 1,
    "negative": 3,
    "knowledge": 14,
    "ned": 2,
    "formulated": 1,
    "human": 6,
    "experts": 1,
    "these": 3,
    "easy": 1,
    "understand": 12,
    "interpret": 1,
    "tree": 4,
    "typical": 3,
    "method": 5,
    "designed": 2,
    "structure": 2,
    "illustrated": 1,
    "fig": 26,
    "top": 4,
    "going": 2,
    "down": 3,
    "solution": 2,
    "path": 1,
    "presents": 2,
    "reasoning": 1,
    "example": 5,
    "used": 3,
    "level": 2,
    "according": 1,
    "logic": 1,
    "image": 22,
    "courtesy": 9,
    "jordan": 1,
    "without": 2,
    "completely": 1,
    "explanatory": 7,
    "mechanisms": 1,
    "output": 2,
    "today": 2,
    "s": 5,
    "cannot": 3,
    "neither": 2,
    "network": 10,
    "itself": 1,
    "nor": 2,
    "external": 1,
    "component": 1,
    "developer": 1,
    "know": 1,
    "there": 4,
    "di": 6,
    "erent": 6,
    "archi": 1,
    "tectures": 1,
    "problem": 1,
    "classes": 1,
    "input": 8,
    "data": 9,
    "cnn": 9,
    "rnn": 1,
    "lstm": 2,
    "shown": 8,
    "them": 2,
    "considered": 1,
    "boxes": 2,
    "whose": 2,
    "internal": 1,
    "known": 2,
    "observer": 1,
    "interpretable": 3,
    "model": 13,
    "usually": 2,
    "inverse": 2,
    "its": 3,
    "accuracy": 8,
    "higher": 2,
    "lower": 6,
    "darpa": 8,
    "program": 5,
    "nice": 1,
    "chart": 2,
    "interesting": 1,
    "phenomena": 2,
    "excellent": 1,
    "degree": 2,
    "but": 6,
    "exhibit": 1,
    "worst": 1,
    "among": 1,
    "listed": 1,
    "techniques": 2,
    "other": 4,
    "extreme": 1,
    "aretitle": 1,
    "suppressed": 5,
    "due": 5,
    "excessive": 5,
    "length": 5,
    "several": 1,
    "fjodor": 1,
    "van": 2,
    "veen": 2,
    "better": 2,
    "predictive": 1,
    "capacity": 1,
    "any": 1,
    "likely": 1,
    "explicable": 1,
    "models": 11,
    "appear": 3,
    "aim": 1,
    "open": 1,
    "turn": 1,
    "into": 1,
    "transparent": 3,
    "main": 1,
    "strands": 1,
    "design": 3,
    "post": 3,
    "hoc": 3,
    "expla": 2,
    "nation": 2,
    "reveals": 2,
    "how": 3,
    "functions": 1,
    "view": 3,
    "tries": 2,
    "construction": 1,
    "single": 1,
    "components": 2,
    "parameter": 1,
    "logistic": 1,
    "regression": 1,
    "training": 3,
    "algorithms": 2,
    "seeking": 1,
    "con": 1,
    "vex": 1,
    "explains": 4,
    "why": 3,
    "result": 3,
    "inferred": 1,
    "give": 3,
    "analytic": 1,
    "statements": 1,
    "goods": 1,
    "recommended": 1,
    "shopping": 1,
    "website": 1,
    "visualizations": 1,
    "saliency": 4,
    "map": 3,
    "show": 1,
    "pixel": 3,
    "importance": 2,
    "classi": 9,
    "cation": 6,
    "ex": 3,
    "planations": 1,
    "nearest": 1,
    "neighbors": 1,
    "historical": 1,
    "dataset": 3,
    "thorough": 2,
    "description": 1,
    "categorization": 1,
    "lipton": 2,
    "comprehensive": 1,
    "development": 4,
    "provided": 1,
    "categories": 1,
    "planation": 1,
    "relevance": 7,
    "recently": 1,
    "been": 3,
    "paid": 1,
    "across": 1,
    "april": 2,
    "funded": 1,
    "able": 5,
    "aimed": 1,
    "improving": 1,
    "july": 1,
    "chinese": 2,
    "government": 2,
    "released": 1,
    "the": 1,
    "plan": 2,
    "generation": 5,
    "encourage": 1,
    "high": 1,
    "strong": 1,
    "extensibility": 1,
    "may": 3,
    "general": 1,
    "protection": 1,
    "regula": 2,
    "tion": 2,
    "gdpr": 1,
    "which": 12,
    "european": 4,
    "union": 2,
    "grants": 1,
    "citizens": 1,
    "right": 3,
    "algorithmic": 2,
    "making": 5,
    "will": 1,
    "increasingly": 1,
    "important": 4,
    "groups": 1,
    "stakeholders": 1,
    "utilize": 1,
    "recommends": 1,
    "makers": 1,
    "would": 5,
    "need": 4,
    "underlying": 2,
    "reason": 3,
    "doctor": 1,
    "needs": 2,
    "what": 2,
    "pathological": 1,
    "features": 2,
    "were": 7,
    "guiding": 1,
    "algorithm": 5,
    "before": 3,
    "accepting": 1,
    "auto": 1,
    "generated": 1,
    "reports": 1,
    "maintenance": 1,
    "engineer": 1,
    "abnormal": 1,
    "captured": 1,
    "algo": 1,
    "rithm": 1,
    "following": 1,
    "repair": 1,
    "recommendations": 1,
    "nancial": 1,
    "investor": 1,
    "wants": 1,
    "uencing": 1,
    "factors": 1,
    "regarded": 1,
    "critical": 2,
    "ones": 2,
    "verify": 1,
    "works": 1,
    "expected": 1,
    "because": 4,
    "wrong": 2,
    "costly": 1,
    "dangerous": 1,
    "caruana": 2,
    "presented": 3,
    "famous": 1,
    "pneumonia": 5,
    "asthma": 3,
    "point": 1,
    "trained": 2,
    "pre": 2,
    "dict": 1,
    "risk": 4,
    "person": 1,
    "arrived": 1,
    "totally": 1,
    "conclusions": 1,
    "learned": 1,
    "asthmatic": 1,
    "patients": 2,
    "heart": 1,
    "problems": 3,
    "much": 3,
    "dying": 2,
    "healthy": 2,
    "persons": 2,
    "true": 1,
    "factor": 1,
    "negatively": 1,
    "ects": 1,
    "recovery": 1,
    "trainingtitle": 1,
    "systematically": 1,
    "biased": 1,
    "contrast": 6,
    "ma": 1,
    "jority": 1,
    "under": 2,
    "strict": 1,
    "supervision": 1,
    "hence": 1,
    "noted": 1,
    "though": 1,
    "probably": 1,
    "worked": 1,
    "correctly": 3,
    "also": 2,
    "represented": 1,
    "cases": 1,
    "insight": 1,
    "selection": 1,
    "appropriate": 2,
    "predictions": 4,
    "ecting": 1,
    "populations": 1,
    "remain": 1,
    "undiscovered": 1,
    "makes": 1,
    "own": 1,
    "braking": 1,
    "car": 1,
    "shutting": 1,
    "plant": 1,
    "selling": 1,
    "shares": 1,
    "assessing": 1,
    "job": 1,
    "issuing": 1,
    "tra": 1,
    "punishment": 1,
    "order": 1,
    "must": 3,
    "already": 1,
    "legal": 1,
    "codify": 1,
    "demand": 1,
    "houston": 3,
    "schools": 3,
    "using": 5,
    "called": 3,
    "educational": 1,
    "value": 2,
    "added": 2,
    "assessment": 1,
    "evaas": 1,
    "evaluate": 1,
    "performance": 1,
    "teachers": 3,
    "successfully": 1,
    "contested": 1,
    "court": 1,
    "reviews": 1,
    "help": 2,
    "improve": 1,
    "detecting": 1,
    "bias": 1,
    "discovering": 1,
    "mistakes": 1,
    "remedying": 1,
    "weakness": 1,
    "la": 1,
    "puschkin": 1,
    "impressive": 1,
    "observed": 2,
    "fisher": 5,
    "shows": 6,
    "task": 1,
    "recognition": 8,
    "reach": 1,
    "almost": 1,
    "equal": 1,
    "rate": 1,
    "category": 3,
    "horse": 3,
    "unex": 1,
    "pected": 1,
    "layer": 4,
    "wise": 2,
    "propagation": 2,
    "employed": 1,
    "analyze": 1,
    "exactly": 1,
    "arrive": 1,
    "authors": 2,
    "use": 3,
    "strategies": 1,
    "classify": 1,
    "images": 5,
    "looked": 1,
    "contour": 1,
    "actual": 1,
    "whereas": 1,
    "relied": 1,
    "certain": 3,
    "copyright": 2,
    "tag": 2,
    "happens": 1,
    "present": 1,
    "removing": 1,
    "test": 3,
    "consequently": 1,
    "cantly": 1,
    "decrease": 1,
    "upper": 1,
    "lapuschkin": 3,
    "relevant": 13,
    "three": 4,
    "behavior": 1,
    "color": 1,
    "neuron": 2,
    "indicates": 3,
    "activation": 2,
    "status": 1,
    "semantics": 1,
    "often": 1,
    "activated": 1,
    "part": 6,
    "explanations": 9,
    "readable": 1,
    "textual": 1,
    "tells": 1,
    "understanding": 2,
    "indicated": 1,
    "red": 3,
    "dnn": 1,
    "section": 2,
    "popular": 1,
    "namely": 2,
    "sensitivity": 1,
    "analysis": 1,
    "sa": 15,
    "lrp": 12,
    "locally": 1,
    "evaluated": 2,
    "gradient": 1,
    "ri": 1,
    "xif": 1,
    "assumes": 1,
    "most": 4,
    "sensitive": 1,
    "doesn": 2,
    "t": 3,
    "function": 2,
    "quanti": 1,
    "es": 4,
    "each": 6,
    "variable": 4,
    "xi": 1,
    "relative": 1,
    "maximum": 1,
    "uncertainty": 1,
    "redistributes": 1,
    "backwards": 1,
    "local": 1,
    "redistri": 1,
    "bution": 1,
    "until": 1,
    "assigns": 1,
    "score": 2,
    "rito": 1,
    "riof": 1,
    "determines": 1,
    "importancetitle": 1,
    "iri": 1,
    "jrj": 1,
    "krk": 1,
    "conservation": 1,
    "key": 1,
    "property": 3,
    "redistribution": 2,
    "ensures": 1,
    "cially": 1,
    "removed": 1,
    "during": 1,
    "thus": 1,
    "truly": 1,
    "decomposes": 1,
    "values": 1,
    "samek": 5,
    "summarizes": 1,
    "clas": 1,
    "si": 1,
    "rooster": 4,
    "yellow": 2,
    "owers": 1,
    "occlude": 1,
    "changed": 1,
    "look": 1,
    "more": 2,
    "like": 2,
    "predicted": 3,
    "indicate": 2,
    "pixels": 2,
    "actually": 1,
    "piv": 1,
    "otal": 1,
    "heatmap": 1,
    "computed": 2,
    "identi": 2,
    "pivotal": 1,
    "additionally": 1,
    "annotation": 1,
    "text": 3,
    "documents": 1,
    "actions": 1,
    "videos": 1,
    "volcano": 1,
    "co": 2,
    "ee": 1,
    "cup": 1,
    "respectively": 1,
    "gure": 2,
    "heatmaps": 2,
    "noisier": 1,
    "every": 1,
    "contributes": 1,
    "produces": 1,
    "overlaid": 1,
    "document": 1,
    "lpr": 1,
    "don": 1,
    "distinguish": 2,
    "tween": 1,
    "positive": 1,
    "evidence": 1,
    "similarly": 1,
    "only": 1,
    "visualizes": 1,
    "locations": 1,
    "action": 1,
    "within": 2,
    "video": 2,
    "frame": 1,
    "time": 4,
    "points": 1,
    "sequence": 2,
    "semantic": 1,
    "graphs": 2,
    "existing": 1,
    "zhang": 4,
    "proposes": 1,
    "learns": 1,
    "graphical": 1,
    "planatory": 1,
    "graph": 6,
    "hierarchy": 2,
    "hidden": 2,
    "inside": 2,
    "convolutional": 5,
    "consists": 1,
    "multiple": 1,
    "layers": 4,
    "corresponds": 1,
    "node": 1,
    "represents": 2,
    "speci": 2,
    "detected": 1,
    "side": 1,
    "nodes": 2,
    "derived": 1,
    "sponses": 1,
    "lters": 1,
    "disentangle": 1,
    "edge": 1,
    "connecting": 1,
    "relationship": 1,
    "lter": 2,
    "response": 1,
    "spatial": 1,
    "rela": 1,
    "tionship": 1,
    "location": 1,
    "granularity": 1,
    "objects": 1,
    "larger": 1,
    "while": 2,
    "smaller": 1,
    "adopts": 1,
    "bridge": 1,
    "stand": 2,
    "ordinary": 1,
    "later": 1,
    "introduce": 1,
    "additional": 1,
    "losses": 1,
    "force": 1,
    "represent": 1,
    "directly": 1,
    "produce": 3,
    "title": 1,
    "convolu": 1,
    "tional": 1,
    "novel": 1,
    "framework": 1,
    "provides": 2,
    "visual": 9,
    "class": 7,
    "nd": 1,
    "descriptions": 1,
    "sentence": 1,
    "information": 2,
    "necessarily": 2,
    "nitions": 1,
    "western": 2,
    "grebe": 2,
    "bird": 1,
    "long": 1,
    "white": 1,
    "neck": 1,
    "pointy": 1,
    "beak": 1,
    "eye": 2,
    "includes": 1,
    "between": 1,
    "laysan": 1,
    "albatross": 1,
    "therefore": 2,
    "cour": 1,
    "tesy": 1,
    "hendricks": 4,
    "label": 2,
    "run": 1,
    "through": 1,
    "grained": 1,
    "pipeline": 1,
    "pick": 1,
    "out": 1,
    "nuanced": 1,
    "details": 1,
    "classifying": 1,
    "forwarded": 1,
    "stack": 1,
    "words": 1,
    "joint": 2,
    "language": 1,
    "facing": 1,
    "social": 1,
    "demands": 1,
    "expect": 1,
    "mission": 1,
    "trustworthy": 1,
    "instead": 1,
    "ali": 1,
    "rahimi": 4,
    "winner": 1,
    "award": 2,
    "neurips": 1,
    "expressed": 1,
    "expectations": 1,
    "concerning": 1,
    "follows": 1,
    "we": 1,
    "building": 1,
    "govern": 1,
    "healthcare": 2,
    "mediate": 1,
    "civic": 1,
    "dialogue": 1,
    "uence": 1,
    "elections": 1,
    "live": 1,
    "society": 2,
    "built": 1,
    "veri": 1,
    "rigorous": 1,
    "let": 1,
    "take": 1,
    "electricity": 2,
    "term": 1,
    "speech": 1,
    "replaced": 1,
    "chemistry": 1,
    "perspective": 1,
    "invested": 1,
    "million": 1,
    "usd": 1,
    "launched": 1,
    "year": 1,
    "pro": 2,
    "gram": 1,
    "aiming": 1,
    "glass": 1,
    "loop": 1,
    "greatly": 1,
    "sacri": 1,
    "cing": 1,
    "perfor": 1,
    "mance": 1,
    "cognition": 1,
    "after": 1,
    "might": 1,
    "determine": 1,
    "trust": 1,
    "distrusted": 1,
    "phase": 2,
    "planned": 1,
    "achieve": 1,
    "initial": 1,
    "implementations": 1,
    "build": 1,
    "toolkit": 1,
    "library": 1,
    "consisting": 1,
    "interface": 1,
    "software": 1,
    "modules": 1,
    "utilized": 1,
    "developing": 1,
    "acquire": 2,
    "explicit": 3,
    "implicit": 2,
    "moreover": 1,
    "combine": 1,
    "forms": 1,
    "require": 1,
    "form": 1,
    "probabilistic": 1,
    "anything": 1,
    "worlds": 2,
    "still": 1,
    "largely": 1,
    "separated": 1,
    "nowtitle": 1,
    "concept": 1,
    "strengthening": 1,
    "orts": 1,
    "bring": 1,
    "together": 1,
    "driven": 1,
    "source": 1,
    "catalyst": 1,
    "dedicated": 1,
    "grand": 1,
    "challenge": 1,
    "references": 1,
    "baehrens": 1,
    "schroeter": 1,
    "harmeling": 1,
    "kawanabe": 1,
    "hansen": 1,
    "m": 3,
    "uller": 3,
    "individual": 1,
    "mach": 1,
    "res": 1,
    "http": 5,
    "portal": 1,
    "acm": 5,
    "org": 8,
    "citation": 1,
    "cfm": 1,
    "id": 1,
    "cameron": 1,
    "face": 2,
    "teacher": 2,
    "evaluation": 2,
    "lawsuit": 2,
    "courthousenews": 1,
    "lou": 1,
    "gehrke": 1,
    "koch": 1,
    "sturm": 1,
    "elhadad": 1,
    "predicting": 1,
    "hospital": 1,
    "day": 1,
    "readmission": 1,
    "proceedings": 4,
    "sigkdd": 1,
    "international": 4,
    "conference": 9,
    "discovery": 1,
    "mining": 1,
    "pp": 7,
    "deng": 1,
    "dong": 1,
    "socher": 1,
    "li": 3,
    "imagenet": 1,
    "large": 1,
    "scale": 1,
    "hierar": 1,
    "chical": 1,
    "database": 1,
    "ieee": 3,
    "vision": 5,
    "pattern": 3,
    "cvpr": 1,
    "june": 1,
    "miami": 1,
    "florida": 1,
    "usa": 1,
    "cvprw": 2,
    "doilovi": 1,
    "bri": 1,
    "hlupi": 1,
    "convention": 1,
    "communication": 1,
    "tech": 1,
    "nology": 1,
    "electronics": 1,
    "microelectronics": 1,
    "mipro": 2,
    "goodman": 1,
    "flaxman": 1,
    "regulations": 1,
    "magazine": 1,
    "guidotti": 1,
    "monreale": 1,
    "ruggieri": 1,
    "turini": 1,
    "giannotti": 1,
    "pedreschi": 1,
    "computing": 1,
    "surveys": 1,
    "csur": 1,
    "akata": 2,
    "rohrbach": 2,
    "donahue": 2,
    "schiele": 2,
    "darrell": 2,
    "generating": 2,
    "springer": 2,
    "jeremy": 1,
    "jeremyjordan": 1,
    "me": 1,
    "binder": 2,
    "montavon": 2,
    "muller": 1,
    "analyzing": 1,
    "ers": 1,
    "vectors": 1,
    "tool": 1,
    "journal": 2,
    "jmlr": 1,
    "papers": 1,
    "html": 1,
    "mythos": 1,
    "queue": 1,
    "nips": 1,
    "presentation": 1,
    "youtube": 1,
    "watch": 1,
    "orhfonaezpc": 1,
    "wiegand": 1,
    "un": 1,
    "derstanding": 1,
    "visualizing": 1,
    "interpreting": 2,
    "arxiv": 3,
    "preprint": 1,
    "scott": 1,
    "clancey": 1,
    "davis": 1,
    "shortli": 1,
    "capabilities": 1,
    "production": 1,
    "consultation": 1,
    "american": 1,
    "computational": 1,
    "lin": 1,
    "guistics": 1,
    "simonyan": 1,
    "vedaldi": 1,
    "zisserman": 1,
    "visualising": 1,
    "maps": 1,
    "representations": 1,
    "iclr": 1,
    "ban": 1,
    "ab": 1,
    "canada": 1,
    "workshop": 1,
    "track": 1,
    "abs": 1,
    "council": 1,
    "genera": 1,
    "gov": 1,
    "zhengce": 1,
    "htm": 1,
    "swartout": 1,
    "justifying": 1,
    "consulting": 1,
    "programs": 1,
    "ceedings": 1,
    "tony": 1,
    "lecun": 2,
    "vs": 2,
    "medium": 1,
    "synced": 1,
    "turek": 1,
    "mil": 1,
    "zoo": 2,
    "asimovinstitute": 1,
    "en": 1,
    "wiki": 1,
    "cao": 1,
    "shi": 1,
    "wu": 2,
    "zhu": 2,
    "thirty": 1,
    "second": 1,
    "aaai": 1,
    "publication": 1,
    "stats": 1
}