{
    "https": 30,
    "heartfailure": 9,
    "orgabstract": 1,
    "prevalence": 2,
    "heart": 96,
    "failure": 73,
    "hf": 74,
    "increasing": 4,
    "necessitating": 2,
    "accurate": 5,
    "diagnosis": 22,
    "tailored": 2,
    "treatment": 11,
    "accumulation": 2,
    "clinical": 17,
    "information": 8,
    "from": 24,
    "patients": 31,
    "with": 51,
    "generates": 1,
    "big": 20,
    "data": 79,
    "which": 8,
    "poses": 1,
    "challenges": 5,
    "traditional": 9,
    "analytical": 2,
    "methods": 15,
    "address": 3,
    "this": 16,
    "approaches": 8,
    "artificial": 23,
    "intelligence": 24,
    "ai": 65,
    "been": 2,
    "developed": 6,
    "that": 32,
    "effectively": 4,
    "predict": 12,
    "future": 8,
    "observa": 1,
    "tions": 3,
    "outcomes": 7,
    "enabling": 2,
    "precise": 3,
    "diagnoses": 2,
    "personalized": 5,
    "treatments": 1,
    "machine": 28,
    "learning": 49,
    "ml": 43,
    "subfield": 2,
    "allows": 1,
    "computers": 2,
    "analyze": 4,
    "find": 3,
    "pat": 1,
    "terns": 1,
    "make": 2,
    "predictions": 2,
    "without": 5,
    "explicit": 1,
    "instructions": 2,
    "supervised": 9,
    "unsupervised": 6,
    "or": 25,
    "semi": 5,
    "deep": 20,
    "branch": 1,
    "uses": 2,
    "neural": 16,
    "networks": 11,
    "multiple": 6,
    "layers": 3,
    "complex": 6,
    "patterns": 7,
    "these": 10,
    "technologies": 3,
    "shown": 3,
    "significant": 2,
    "poten": 1,
    "tial": 1,
    "various": 6,
    "aspects": 1,
    "research": 9,
    "including": 5,
    "outcome": 3,
    "prediction": 16,
    "classification": 8,
    "phenotypes": 6,
    "optimization": 1,
    "strategies": 1,
    "addition": 7,
    "integrating": 2,
    "sources": 6,
    "such": 20,
    "elec": 10,
    "troc": 10,
    "ardi": 10,
    "ogra": 10,
    "phy": 6,
    "electronic": 5,
    "health": 16,
    "records": 4,
    "imaging": 18,
    "enhance": 1,
    "diagnostic": 4,
    "accuracy": 7,
    "algorithms": 20,
    "currently": 1,
    "wearable": 9,
    "devices": 7,
    "remote": 9,
    "monitoring": 19,
    "aided": 1,
    "by": 25,
    "enable": 2,
    "earlier": 2,
    "detection": 8,
    "improved": 1,
    "patient": 9,
    "care": 7,
    "review": 9,
    "focuses": 1,
    "rationale": 1,
    "behind": 1,
    "utilizing": 3,
    "explores": 1,
    "its": 5,
    "applications": 4,
    "keywords": 1,
    "introduction": 3,
    "along": 1,
    "complexity": 2,
    "relies": 1,
    "invasive": 6,
    "noninvasive": 2,
    "tests": 1,
    "based": 23,
    "characteristics": 5,
    "type": 2,
    "management": 13,
    "require": 1,
    "substantial": 1,
    "amount": 2,
    "leading": 2,
    "however": 6,
    "insufficient": 1,
    "handling": 2,
    "large": 6,
    "datasets": 7,
    "consequently": 1,
    "significance": 1,
    "med": 11,
    "icine": 1,
    "grown": 1,
    "discusses": 1,
    "role": 5,
    "focused": 2,
    "risk": 12,
    "factors": 2,
    "ecg": 22,
    "ehrs": 9,
    "telemonitoring": 1,
    "int": 5,
    "fail": 12,
    "jan": 1,
    "doi": 13,
    "org": 27,
    "ijhf": 9,
    "pissn": 1,
    "eissn": 1,
    "article": 4,
    "received": 1,
    "sep": 1,
    "revised": 1,
    "nov": 3,
    "accepted": 1,
    "published": 1,
    "online": 1,
    "correspondence": 1,
    "dong": 3,
    "ju": 3,
    "choi": 18,
    "md": 3,
    "phd": 1,
    "cardiovascular": 3,
    "center": 1,
    "seoul": 4,
    "national": 4,
    "university": 5,
    "bundang": 3,
    "hospital": 3,
    "college": 3,
    "medicine": 10,
    "gumi": 1,
    "ro": 1,
    "beon": 1,
    "gil": 1,
    "gu": 1,
    "seongnam": 2,
    "korea": 7,
    "email": 1,
    "djchoi": 1,
    "snubh": 1,
    "minjae": 3,
    "yoon": 11,
    "jin": 4,
    "joo": 4,
    "park": 15,
    "contributed": 1,
    "equally": 1,
    "work": 2,
    "share": 1,
    "first": 1,
    "authorship": 1,
    "copyright": 1,
    "korean": 9,
    "society": 6,
    "an": 16,
    "open": 1,
    "access": 2,
    "distributed": 2,
    "under": 2,
    "terms": 1,
    "creative": 1,
    "commons": 1,
    "attribution": 1,
    "non": 6,
    "commercial": 1,
    "license": 1,
    "creativecommons": 1,
    "licenses": 1,
    "nc": 1,
    "permits": 1,
    "unrestricted": 1,
    "noncommercial": 1,
    "use": 5,
    "distribution": 2,
    "reproduction": 1,
    "any": 1,
    "medium": 1,
    "provided": 1,
    "original": 4,
    "properly": 1,
    "cited": 1,
    "taeho": 2,
    "hur": 8,
    "cam": 2,
    "hao": 2,
    "hua": 8,
    "musarrat": 2,
    "hussain": 8,
    "sungyoung": 2,
    "lee": 20,
    "division": 1,
    "cardiology": 4,
    "department": 1,
    "internal": 1,
    "computer": 3,
    "science": 1,
    "engineering": 5,
    "kyung": 1,
    "hee": 1,
    "yongin": 1,
    "kore": 1,
    "aapp": 1,
    "lica": 1,
    "tion": 6,
    "potential": 4,
    "past": 2,
    "present": 5,
    "futureand": 1,
    "excluded": 1,
    "each": 1,
    "detailed": 1,
    "modality": 1,
    "cardiac": 12,
    "magnetic": 3,
    "resonance": 3,
    "image": 9,
    "echo": 7,
    "card": 7,
    "iogr": 7,
    "aphy": 6,
    "nuclear": 1,
    "etc": 1,
    "importance": 1,
    "era": 1,
    "upon": 1,
    "us": 1,
    "term": 3,
    "refers": 1,
    "explo": 1,
    "sion": 2,
    "available": 5,
    "enormous": 1,
    "amounts": 1,
    "extremely": 1,
    "high": 9,
    "dimensional": 4,
    "unstructured": 2,
    "being": 1,
    "produced": 1,
    "stored": 1,
    "much": 1,
    "lower": 1,
    "cost": 1,
    "than": 8,
    "ever": 1,
    "before": 1,
    "driving": 1,
    "movement": 1,
    "main": 1,
    "goal": 1,
    "analyzing": 3,
    "develop": 4,
    "effective": 2,
    "accurately": 2,
    "predicting": 5,
    "observations": 1,
    "results": 5,
    "sample": 1,
    "size": 1,
    "dimensionality": 2,
    "introduce": 1,
    "unique": 2,
    "computa": 2,
    "tional": 2,
    "statistical": 7,
    "development": 6,
    "new": 6,
    "paradigms": 1,
    "analysis": 14,
    "techniques": 8,
    "innovations": 1,
    "aim": 1,
    "issues": 4,
    "noise": 2,
    "erroneous": 1,
    "correlations": 1,
    "computational": 5,
    "power": 3,
    "constraints": 2,
    "one": 13,
    "common": 4,
    "objective": 1,
    "feature": 3,
    "dimension": 3,
    "reduction": 3,
    "modeling": 2,
    "frequently": 2,
    "employed": 2,
    "estimate": 1,
    "populations": 2,
    "inference": 1,
    "experiments": 1,
    "after": 3,
    "preprocessing": 1,
    "performing": 1,
    "possible": 1,
    "reduc": 1,
    "analyses": 1,
    "rely": 2,
    "perform": 3,
    "tasks": 3,
    "specific": 2,
    "user": 3,
    "important": 2,
    "target": 1,
    "because": 5,
    "etiology": 1,
    "numerous": 3,
    "comorbidities": 5,
    "prolonged": 1,
    "progressive": 1,
    "course": 1,
    "disease": 9,
    "most": 3,
    "popular": 1,
    "types": 2,
    "used": 12,
    "omics": 4,
    "clini": 2,
    "cal": 2,
    "collected": 3,
    "using": 19,
    "means": 3,
    "meth": 1,
    "ods": 1,
    "wearables": 1,
    "contrast": 2,
    "genomics": 1,
    "transcriptomics": 1,
    "proteomics": 1,
    "metabolomics": 1,
    "primarily": 1,
    "tissue": 1,
    "blood": 2,
    "samples": 1,
    "struc": 1,
    "ture": 1,
    "volume": 2,
    "advance": 1,
    "biological": 1,
    "comprehension": 1,
    "both": 5,
    "conventional": 4,
    "gather": 1,
    "critical": 3,
    "sights": 1,
    "application": 5,
    "concept": 3,
    "dl": 18,
    "defined": 1,
    "en": 1,
    "ables": 1,
    "it": 6,
    "imitate": 1,
    "mimic": 1,
    "human": 6,
    "capabilities": 2,
    "technol": 3,
    "ogy": 1,
    "decisions": 1,
    "requiring": 1,
    "intervention": 2,
    "empowers": 1,
    "beyond": 1,
    "programmatic": 1,
    "procedures": 2,
    "identify": 6,
    "within": 1,
    "apply": 1,
    "learned": 1,
    "more": 8,
    "humans": 2,
    "several": 2,
    "distinct": 5,
    "overlapping": 1,
    "variables": 2,
    "challenge": 2,
    "regression": 8,
    "whereas": 1,
    "well": 3,
    "suited": 1,
    "handle": 3,
    "moreover": 3,
    "evaluate": 2,
    "intricate": 1,
    "connections": 1,
    "between": 3,
    "predictors": 1,
    "correlated": 1,
    "collinear": 1,
    "accommodate": 1,
    "temporal": 3,
    "changes": 2,
    "generate": 3,
    "dynamic": 1,
    "models": 12,
    "continuously": 1,
    "updated": 1,
    "training": 5,
    "instance": 2,
    "baseline": 2,
    "features": 6,
    "vital": 1,
    "signs": 1,
    "laboratory": 2,
    "may": 5,
    "change": 1,
    "over": 2,
    "time": 5,
    "although": 1,
    "evolution": 3,
    "traits": 3,
    "crucial": 2,
    "tools": 2,
    "fre": 1,
    "quently": 1,
    "ill": 1,
    "equipped": 1,
    "them": 3,
    "offer": 1,
    "ability": 2,
    "calculate": 1,
    "nonlinear": 1,
    "relationships": 2,
    "precisely": 1,
    "their": 6,
    "higher": 2,
    "comes": 1,
    "expense": 1,
    "inte": 2,
    "rpre": 2,
    "tabi": 2,
    "lity": 2,
    "there": 4,
    "primary": 1,
    "representative": 1,
    "figure": 10,
    "su": 2,
    "pervised": 1,
    "characterized": 1,
    "labeled": 3,
    "sets": 2,
    "intended": 1,
    "supervise": 1,
    "train": 1,
    "correctly": 3,
    "classify": 3,
    "unsuper": 1,
    "vised": 1,
    "group": 2,
    "unlabeled": 2,
    "uncov": 1,
    "ering": 1,
    "hidden": 4,
    "method": 2,
    "combines": 1,
    "limited": 3,
    "unla": 1,
    "beled": 1,
    "where": 3,
    "grouped": 2,
    "field": 3,
    "cardiovascu": 1,
    "lar": 1,
    "uncover": 1,
    "mechanisms": 1,
    "increase": 1,
    "precision": 1,
    "identifying": 2,
    "clinically": 3,
    "relevant": 2,
    "not": 4,
    "apparent": 1,
    "clinicians": 2,
    "fact": 1,
    "re": 4,
    "gression": 1,
    "decision": 4,
    "trees": 1,
    "random": 2,
    "forest": 2,
    "support": 9,
    "vector": 4,
    "na\u00efve": 2,
    "bayes": 2,
    "nearest": 2,
    "neighbors": 1,
    "extreme": 1,
    "gradient": 1,
    "boost": 1,
    "ing": 5,
    "commonly": 1,
    "medical": 16,
    "subset": 1,
    "discover": 1,
    "mimics": 1,
    "operation": 1,
    "brain": 5,
    "was": 9,
    "originally": 1,
    "dr": 1,
    "warren": 1,
    "mcculloch": 3,
    "neuroscientist": 1,
    "walter": 1,
    "pitts": 3,
    "scientist": 1,
    "mp": 3,
    "neuron": 1,
    "neurons": 5,
    "structured": 2,
    "similarly": 1,
    "similar": 1,
    "dendrites": 1,
    "they": 4,
    "receive": 1,
    "external": 2,
    "calculations": 1,
    "nucleus": 1,
    "output": 2,
    "binary": 1,
    "signals": 1,
    "orgtransmitted": 1,
    "through": 2,
    "axons": 1,
    "when": 4,
    "con": 3,
    "nected": 1,
    "create": 2,
    "network": 6,
    "structure": 1,
    "resembles": 1,
    "recently": 2,
    "advanced": 2,
    "referred": 1,
    "percep": 1,
    "tron": 1,
    "advancements": 1,
    "computing": 3,
    "also": 3,
    "become": 1,
    "evolving": 3,
    "into": 6,
    "widely": 3,
    "cnn": 1,
    "especially": 5,
    "helpful": 1,
    "less": 1,
    "dependent": 1,
    "vari": 1,
    "able": 1,
    "selection": 1,
    "overall": 1,
    "compelling": 1,
    "relations": 1,
    "among": 2,
    "events": 2,
    "incident": 2,
    "tem": 1,
    "poral": 1,
    "number": 3,
    "physiological": 2,
    "measurements": 2,
    "indices": 1,
    "medication": 1,
    "prescriptions": 1,
    "classi": 3,
    "cation": 4,
    "clustering": 1,
    "adaboost": 1,
    "gaussian": 1,
    "mixture": 1,
    "model": 14,
    "autoencoders": 2,
    "co": 1,
    "neighbor": 2,
    "bayesian": 1,
    "markov": 1,
    "sne": 2,
    "multi": 3,
    "view": 1,
    "umap": 2,
    "three": 1,
    "lpvm": 1,
    "linear": 3,
    "glm": 2,
    "medoids": 1,
    "fuzzy": 1,
    "principal": 1,
    "component": 1,
    "label": 1,
    "propagation": 1,
    "discriminant": 2,
    "svr": 2,
    "gpr": 2,
    "hierarchical": 1,
    "self": 1,
    "transductive": 1,
    "generalized": 1,
    "ground": 1,
    "penetrating": 1,
    "radar": 1,
    "stochastic": 1,
    "embedding": 1,
    "uniform": 1,
    "manifold": 1,
    "approximation": 1,
    "projection": 1,
    "machines": 2,
    "perceptron": 1,
    "dnn": 1,
    "input": 3,
    "layer": 16,
    "lp": 29,
    "two": 7,
    "lpoutput": 1,
    "generative": 8,
    "emerged": 1,
    "great": 2,
    "innovation": 1,
    "domain": 3,
    "digital": 1,
    "novel": 3,
    "content": 1,
    "creating": 1,
    "quality": 1,
    "images": 4,
    "writing": 3,
    "rather": 2,
    "solving": 1,
    "regres": 1,
    "problems": 2,
    "example": 2,
    "chatgpt": 2,
    "released": 1,
    "general": 2,
    "public": 1,
    "about": 1,
    "year": 2,
    "ago": 1,
    "efficiently": 1,
    "understand": 1,
    "queries": 1,
    "responds": 1,
    "ques": 1,
    "even": 2,
    "script": 1,
    "source": 1,
    "code": 1,
    "versatile": 1,
    "ap": 1,
    "plications": 1,
    "far": 1,
    "reaching": 1,
    "implications": 1,
    "improving": 1,
    "advancing": 1,
    "key": 1,
    "al": 45,
    "gorithms": 3,
    "adversarial": 1,
    "gans": 1,
    "variational": 1,
    "excel": 1,
    "generating": 2,
    "syn": 1,
    "thetic": 1,
    "ray": 1,
    "computed": 1,
    "tomography": 1,
    "result": 1,
    "facilitate": 2,
    "robust": 1,
    "sys": 1,
    "tems": 1,
    "conducted": 1,
    "if": 1,
    "could": 9,
    "capture": 1,
    "congestive": 3,
    "chf": 3,
    "unlike": 1,
    "other": 1,
    "diseases": 3,
    "lung": 1,
    "cancer": 1,
    "found": 1,
    "local": 1,
    "area": 2,
    "characteris": 1,
    "tics": 1,
    "widespread": 2,
    "making": 1,
    "difficult": 1,
    "detect": 3,
    "authors": 1,
    "created": 2,
    "synthesized": 2,
    "wasserstein": 1,
    "gan": 1,
    "subtracting": 1,
    "healthy": 1,
    "diseased": 1,
    "adding": 1,
    "veri": 1,
    "fied": 1,
    "radiologist": 1,
    "reflect": 1,
    "ed": 1,
    "proving": 1,
    "performance": 6,
    "usability": 1,
    "additionally": 1,
    "digitization": 1,
    "benefits": 2,
    "gen": 1,
    "erative": 1,
    "particularly": 5,
    "context": 5,
    "natural": 3,
    "language": 4,
    "process": 2,
    "proficiently": 1,
    "summarize": 1,
    "notes": 1,
    "extract": 1,
    "text": 3,
    "automate": 1,
    "entry": 1,
    "ehr": 3,
    "systems": 2,
    "ultimately": 1,
    "saving": 1,
    "valuable": 2,
    "healthcare": 1,
    "professionals": 1,
    "specialists": 3,
    "diagnosing": 2,
    "challeng": 1,
    "syndrome": 1,
    "caused": 1,
    "structur": 1,
    "functional": 1,
    "disorders": 1,
    "single": 2,
    "entity": 1,
    "classic": 1,
    "leg": 1,
    "edema": 1,
    "symptom": 1,
    "right": 1,
    "sided": 1,
    "congestion": 1,
    "alternative": 1,
    "conditions": 1,
    "chronic": 6,
    "venous": 1,
    "sufficiency": 1,
    "kidney": 1,
    "drug": 2,
    "side": 1,
    "effects": 1,
    "sequently": 1,
    "practice": 2,
    "many": 2,
    "misdiagnosed": 1,
    "vice": 1,
    "versa": 1,
    "contemporary": 1,
    "physicians": 4,
    "face": 1,
    "difficulties": 1,
    "keeping": 1,
    "rapidly": 1,
    "scientific": 1,
    "evidence": 4,
    "medications": 1,
    "guidelines": 7,
    "outpatient": 1,
    "clinics": 1,
    "help": 3,
    "early": 4,
    "system": 4,
    "cdss": 8,
    "scalable": 1,
    "flexible": 1,
    "assistant": 1,
    "platform": 3,
    "different": 4,
    "sists": 1,
    "total": 1,
    "acquisition": 4,
    "persistence": 2,
    "recognition": 2,
    "knowledge": 10,
    "acquisi": 3,
    "inferencing": 3,
    "interface": 2,
    "third": 2,
    "creates": 1,
    "hybrid": 2,
    "combining": 1,
    "rule": 1,
    "generated": 2,
    "rules": 1,
    "experts": 1,
    "automatically": 1,
    "evolve": 1,
    "et": 40,
    "evaluated": 2,
    "ac": 2,
    "curacy": 1,
    "demonstrated": 2,
    "remarkable": 1,
    "diag": 1,
    "nostic": 1,
    "suggests": 1,
    "prove": 1,
    "useful": 1,
    "situations": 1,
    "simple": 1,
    "tool": 4,
    "checkups": 1,
    "previous": 1,
    "studies": 3,
    "signifi": 1,
    "cant": 1,
    "association": 3,
    "attia": 2,
    "showed": 8,
    "powerful": 1,
    "screening": 6,
    "left": 6,
    "ventricular": 4,
    "dysfunction": 2,
    "asymptomatic": 1,
    "individu": 1,
    "als": 1,
    "achieve": 2,
    "kwon": 8,
    "analyzed": 1,
    "ecgs": 1,
    "algorithm": 12,
    "identification": 3,
    "compared": 1,
    "logistic": 1,
    "superior": 1,
    "effectiveness": 1,
    "reduced": 6,
    "ejection": 12,
    "fraction": 12,
    "curve": 1,
    "confidence": 1,
    "interval": 1,
    "stages": 2,
    "arti": 1,
    "cial": 1,
    "pre": 2,
    "manual": 1,
    "nine": 3,
    "five": 1,
    "zero": 11,
    "endash": 4,
    "cap": 7,
    "six": 2,
    "periodcentered": 3,
    "applied": 2,
    "preserved": 4,
    "hfpef": 3,
    "cause": 1,
    "hospitalization": 2,
    "people": 1,
    "aged": 1,
    "years": 1,
    "older": 1,
    "admission": 3,
    "immediately": 1,
    "discharge": 1,
    "therefore": 1,
    "stratification": 1,
    "readmission": 3,
    "golas": 2,
    "outperformed": 1,
    "tech": 1,
    "niques": 1,
    "day": 2,
    "furthermore": 3,
    "predicted": 1,
    "mortality": 5,
    "long": 1,
    "existing": 1,
    "scores": 1,
    "get": 1,
    "score": 2,
    "gwtg": 1,
    "meta": 1,
    "global": 1,
    "maggic": 1,
    "might": 1,
    "restrict": 1,
    "fea": 1,
    "tures": 1,
    "limiting": 1,
    "those": 3,
    "established": 1,
    "associations": 1,
    "biologically": 1,
    "plausible": 1,
    "rationales": 1,
    "cohort": 3,
    "study": 9,
    "implanted": 2,
    "resy": 3,
    "nchr": 3,
    "oniz": 3,
    "atio": 6,
    "therapy": 8,
    "crt": 4,
    "were": 1,
    "alert": 1,
    "sounds": 1,
    "respiratory": 1,
    "rate": 4,
    "tidal": 1,
    "activity": 2,
    "provide": 2,
    "sensitive": 1,
    "timely": 1,
    "predictor": 1,
    "impending": 2,
    "decompensation": 1,
    "enhanced": 2,
    "phe": 1,
    "notype": 1,
    "mapping": 1,
    "performed": 2,
    "prospective": 3,
    "trial": 2,
    "ambulatory": 1,
    "cre": 1,
    "ated": 1,
    "technique": 1,
    "participants": 1,
    "aphi": 1,
    "pa": 2,
    "rameters": 1,
    "hemodynamics": 1,
    "anoth": 1,
    "er": 1,
    "hospitalized": 1,
    "across": 1,
    "lvef": 2,
    "spectrum": 1,
    "identified": 1,
    "phenogroups": 2,
    "comor": 1,
    "bidities": 1,
    "coronary": 1,
    "artery": 1,
    "valvular": 1,
    "atrial": 1,
    "fibrillation": 1,
    "obstructive": 2,
    "pulmonary": 1,
    "sleep": 1,
    "apnea": 1,
    "few": 1,
    "grouping": 1,
    "stratified": 1,
    "improve": 4,
    "assessing": 1,
    "heterogeneity": 2,
    "response": 5,
    "therapies": 3,
    "ahmad": 2,
    "services": 3,
    "follow": 1,
    "analyticsrisk": 1,
    "severity": 1,
    "predictionhf": 1,
    "pressure": 1,
    "glucose": 1,
    "delirium": 1,
    "ui": 3,
    "environment": 1,
    "feedback": 1,
    "module": 2,
    "infe": 1,
    "renc": 1,
    "ingk": 1,
    "nowl": 1,
    "edge": 1,
    "hybr": 1,
    "idiz": 1,
    "nstr": 1,
    "uctu": 1,
    "red": 1,
    "acqu": 3,
    "isit": 3,
    "iond": 1,
    "escr": 1,
    "ipti": 1,
    "ve": 1,
    "ioni": 1,
    "mage": 1,
    "ione": 1,
    "ngin": 1,
    "eeri": 1,
    "ng": 1,
    "level": 2,
    "recognizer": 2,
    "low": 1,
    "storage": 1,
    "processing": 3,
    "log": 1,
    "repo": 1,
    "sito": 1,
    "rymu": 1,
    "ltim": 1,
    "odal": 1,
    "processingai": 1,
    "expert": 1,
    "studied": 1,
    "swedish": 1,
    "registry": 2,
    "utilized": 1,
    "subgroups": 1,
    "therapeutics": 1,
    "survival": 1,
    "rates": 1,
    "stratifi": 1,
    "allowed": 1,
    "likely": 2,
    "benefit": 2,
    "guideline": 3,
    "directed": 2,
    "prioritize": 1,
    "who": 1,
    "interven": 1,
    "optimize": 1,
    "assist": 2,
    "determining": 1,
    "optimal": 2,
    "sequenc": 1,
    "dosing": 1,
    "optimizing": 2,
    "se": 2,
    "lection": 1,
    "device": 2,
    "responders": 3,
    "post": 1,
    "hoc": 1,
    "multicenter": 2,
    "automatic": 1,
    "defibrillator": 4,
    "implantation": 3,
    "param": 1,
    "eters": 1,
    "cycle": 1,
    "phenotyp": 1,
    "ically": 1,
    "heterogeneous": 2,
    "thus": 3,
    "potentially": 1,
    "implantable": 4,
    "cardioverter": 4,
    "defibrillators": 1,
    "icds": 1,
    "reduce": 1,
    "sudden": 1,
    "death": 1,
    "phenomapping": 3,
    "phenotype": 2,
    "sub": 1,
    "groups": 1,
    "receiving": 1,
    "sec": 1,
    "ondary": 1,
    "prophylactic": 1,
    "icd": 4,
    "aiding": 1,
    "implementation": 1,
    "shakibfar": 2,
    "vealed": 1,
    "daily": 1,
    "summaries": 1,
    "absence": 1,
    "short": 1,
    "electrical": 2,
    "storms": 2,
    "selecting": 1,
    "eligible": 1,
    "subcutaneous": 2,
    "serves": 2,
    "essential": 1,
    "clin": 1,
    "ical": 1,
    "judgment": 1,
    "diagnose": 1,
    "integrated": 1,
    "further": 1,
    "ongoing": 1,
    "areas": 1,
    "mining": 1,
    "cho": 6,
    "screened": 1,
    "only": 1,
    "lead": 4,
    "but": 2,
    "corporating": 1,
    "assistance": 1,
    "ana": 1,
    "lyzing": 1,
    "raw": 1,
    "expanding": 1,
    "enabled": 2,
    "smartwatch": 2,
    "detected": 1,
    "acceptable": 1,
    "link": 2,
    "multisensor": 2,
    "exacerbation": 1,
    "per": 1,
    "formance": 1,
    "continuous": 3,
    "streams": 1,
    "reho": 1,
    "spit": 1,
    "aliz": 2,
    "telemetry": 1,
    "sensor": 1,
    "rehos": 1,
    "pitalization": 1,
    "expected": 2,
    "limitations": 3,
    "dichotomy": 1,
    "improper": 1,
    "cali": 1,
    "bration": 1,
    "recognized": 1,
    "compromised": 1,
    "inaccu": 1,
    "missing": 3,
    "true": 1,
    "inputs": 1,
    "must": 1,
    "cleansed": 1,
    "validated": 1,
    "de": 1,
    "tecting": 1,
    "out": 1,
    "range": 1,
    "values": 1,
    "skewness": 1,
    "filled": 1,
    "while": 1,
    "maintaining": 1,
    "obvious": 1,
    "situation": 1,
    "visual": 1,
    "predictive": 2,
    "segmentation": 1,
    "ventricle": 1,
    "endocar": 1,
    "dium": 1,
    "epicardium": 1,
    "atrium": 1,
    "regions": 1,
    "providing": 1,
    "fine": 1,
    "grained": 1,
    "availability": 1,
    "annotated": 1,
    "owing": 1,
    "expensive": 1,
    "labor": 1,
    "costs": 1,
    "consumption": 1,
    "vulnerable": 1,
    "shift": 1,
    "wherein": 1,
    "diagnos": 1,
    "tic": 1,
    "adversely": 1,
    "affected": 1,
    "inherent": 1,
    "differences": 1,
    "trained": 1,
    "combined": 1,
    "hospitals": 1,
    "configurations": 1,
    "capturing": 1,
    "validation": 3,
    "another": 1,
    "drawback": 1,
    "opaque": 1,
    "reasoning": 1,
    "lack": 1,
    "explain": 1,
    "underlie": 1,
    "diction": 1,
    "skeptical": 1,
    "recommendations": 1,
    "black": 1,
    "box": 1,
    "false": 1,
    "due": 1,
    "wrong": 2,
    "rises": 1,
    "problem": 2,
    "im": 1,
    "age": 1,
    "slight": 1,
    "manipulation": 1,
    "leads": 1,
    "conclusion": 2,
    "hallucination": 2,
    "arises": 1,
    "believes": 1,
    "correct": 1,
    "misled": 1,
    "impact": 2,
    "algo": 1,
    "rithms": 1,
    "makes": 1,
    "hypothetical": 1,
    "biggest": 1,
    "obstacles": 1,
    "orgadoption": 1,
    "need": 2,
    "valida": 1,
    "lastly": 1,
    "recent": 1,
    "protected": 1,
    "nowadays": 1,
    "prognosis": 2,
    "therapeutic": 1,
    "integration": 1,
    "expanded": 1,
    "po": 1,
    "tential": 1,
    "incorporation": 1,
    "revolutionize": 1,
    "significantly": 1,
    "thereby": 1,
    "orcid": 8,
    "ids": 1,
    "funding": 2,
    "supported": 1,
    "grant": 2,
    "technology": 1,
    "project": 2,
    "industry": 1,
    "institute": 1,
    "khidi": 1,
    "funded": 1,
    "ministry": 1,
    "welfare": 1,
    "republic": 1,
    "conflict": 2,
    "interest": 2,
    "associate": 1,
    "editor": 1,
    "international": 3,
    "journal": 1,
    "publish": 1,
    "except": 1,
    "reported": 1,
    "author": 1,
    "contributions": 1,
    "conc": 1,
    "eptu": 1,
    "jj": 9,
    "ch": 6,
    "dj": 10,
    "curation": 1,
    "investigation": 1,
    "methodology": 1,
    "ad": 1,
    "ministration": 1,
    "supervision": 1,
    "visualization": 1,
    "draft": 1,
    "editing": 1,
    "references": 1,
    "conrad": 1,
    "judge": 1,
    "tran": 1,
    "trends": 1,
    "incidence": 1,
    "population": 1,
    "million": 1,
    "individuals": 1,
    "lancet": 1,
    "pubmed": 57,
    "crossref": 66,
    "cj": 1,
    "sj": 2,
    "statistics": 1,
    "report": 2,
    "heidenreich": 1,
    "bozkurt": 2,
    "aguilar": 1,
    "aha": 1,
    "acc": 1,
    "hfsa": 1,
    "american": 2,
    "joint": 1,
    "committee": 1,
    "coll": 3,
    "cardiol": 7,
    "mcdonagh": 1,
    "ta": 1,
    "metra": 1,
    "adamo": 1,
    "corrigendum": 1,
    "esc": 4,
    "acute": 5,
    "task": 1,
    "force": 1,
    "european": 1,
    "special": 1,
    "contribution": 1,
    "hfa": 1,
    "eur": 6,
    "jy": 2,
    "dh": 2,
    "youn": 2,
    "jc": 3,
    "definition": 1,
    "kim": 6,
    "lanzer": 1,
    "jd": 1,
    "leuschner": 1,
    "kramann": 1,
    "levinson": 1,
    "rt": 1,
    "saez": 1,
    "rodriguez": 1,
    "curr": 5,
    "rep": 4,
    "orgapplication": 1,
    "current": 1,
    "approach": 2,
    "record": 1,
    "docherty": 1,
    "ab": 3,
    "lone": 1,
    "ni": 1,
    "exploiting": 1,
    "opin": 2,
    "crit": 1,
    "averbuch": 1,
    "sullivan": 2,
    "sauer": 1,
    "digit": 4,
    "fan": 2,
    "lv": 1,
    "sure": 1,
    "independence": 1,
    "ultrahigh": 1,
    "space": 1,
    "stat": 2,
    "soc": 1,
    "series": 1,
    "methodol": 1,
    "han": 1,
    "liu": 1,
    "natl": 1,
    "sci": 3,
    "rev": 6,
    "meng": 1,
    "zeleznik": 1,
    "oa": 1,
    "thallinger": 1,
    "gg": 1,
    "kuster": 1,
    "gholami": 1,
    "culhane": 1,
    "integrative": 1,
    "brief": 1,
    "bioinform": 1,
    "ry": 1,
    "coyner": 1,
    "kalpathy": 1,
    "cramer": 1,
    "chiang": 1,
    "mf": 1,
    "campbell": 1,
    "jp": 2,
    "transl": 1,
    "vis": 1,
    "sm": 3,
    "sy": 2,
    "jung": 1,
    "mh": 2,
    "underlying": 1,
    "etiologies": 1,
    "circ": 4,
    "fu": 1,
    "eisen": 2,
    "hj": 3,
    "genetics": 2,
    "dilated": 1,
    "cardiomyopathy": 1,
    "rau": 1,
    "cd": 1,
    "lusis": 1,
    "aj": 2,
    "wang": 1,
    "forms": 1,
    "solutions": 1,
    "hassani": 1,
    "silva": 1,
    "es": 1,
    "unger": 1,
    "tajmazinani": 1,
    "mac": 1,
    "feely": 1,
    "augmentation": 2,
    "ia": 1,
    "what": 1,
    "mintz": 1,
    "brodie": 1,
    "minim": 1,
    "ther": 1,
    "allied": 1,
    "rajkomar": 1,
    "dean": 1,
    "kohane": 1,
    "engl": 1,
    "rajula": 1,
    "hs": 1,
    "verlato": 1,
    "manchia": 1,
    "antonucci": 1,
    "fanos": 1,
    "comparison": 2,
    "medicina": 1,
    "kaunas": 1,
    "weller": 1,
    "love": 1,
    "tm": 2,
    "wiedmann": 1,
    "versus": 2,
    "built": 1,
    "measures": 1,
    "coli": 1,
    "levels": 1,
    "agricultural": 1,
    "water": 1,
    "front": 1,
    "artif": 3,
    "intell": 3,
    "latif": 1,
    "xiao": 1,
    "imran": 1,
    "tu": 1,
    "proceedings": 3,
    "conference": 4,
    "mathematics": 1,
    "icomet": 1,
    "january": 2,
    "sukkur": 1,
    "pakistan": 1,
    "york": 2,
    "ieee": 4,
    "johnson": 1,
    "kw": 1,
    "torres": 1,
    "soto": 1,
    "glicksberg": 1,
    "bs": 1,
    "noorbakhsh": 1,
    "sabet": 1,
    "zand": 1,
    "zhang": 1,
    "abedi": 1,
    "transforms": 1,
    "ws": 1,
    "logical": 1,
    "calculus": 1,
    "ideas": 1,
    "immanent": 1,
    "nervous": 1,
    "bull": 1,
    "math": 1,
    "biol": 1,
    "ej": 1,
    "yh": 1,
    "kang": 1,
    "dw": 1,
    "stroke": 2,
    "schuetz": 2,
    "stewart": 2,
    "wf": 2,
    "sun": 2,
    "recurrent": 1,
    "onset": 1,
    "inform": 3,
    "assoc": 2,
    "rao": 2,
    "li": 1,
    "ramakrishnan": 1,
    "explainable": 1,
    "transformer": 1,
    "biomed": 1,
    "gozalo": 1,
    "brizuela": 1,
    "garrido": 1,
    "merchan": 1,
    "ec": 1,
    "you": 1,
    "state": 1,
    "art": 1,
    "arxiv": 8,
    "kebaili": 1,
    "lapuyade": 1,
    "lahorgue": 1,
    "ruan": 1,
    "seah": 1,
    "tang": 1,
    "js": 1,
    "kitchen": 1,
    "gaillard": 1,
    "dixon": 1,
    "af": 1,
    "chest": 1,
    "radiographs": 1,
    "visualizing": 1,
    "radiology": 1,
    "harvey": 1,
    "lobban": 1,
    "rayson": 1,
    "warner": 1,
    "jones": 1,
    "bipolar": 1,
    "disorder": 1,
    "scoping": 1,
    "jmir": 1,
    "ment": 1,
    "guo": 1,
    "pasque": 1,
    "loh": 1,
    "mann": 1,
    "payne": 1,
    "pr": 2,
    "epidemiol": 1,
    "representation": 1,
    "june": 1,
    "ali": 1,
    "npj": 1,
    "nainwal": 1,
    "kumar": 1,
    "jha": 1,
    "morphological": 1,
    "advances": 1,
    "communication": 1,
    "automation": 1,
    "icacca": 1,
    "fall": 1,
    "september": 1,
    "october": 2,
    "bareilly": 1,
    "india": 1,
    "hendry": 1,
    "pb": 1,
    "krisdinarti": 1,
    "erika": 1,
    "scoring": 1,
    "zi": 1,
    "kapa": 1,
    "lopez": 1,
    "jimenez": 1,
    "contractile": 1,
    "nat": 2,
    "jm": 5,
    "kh": 5,
    "assessment": 1,
    "phic": 1,
    "chang": 1,
    "oh": 1,
    "gc": 2,
    "hy": 2,
    "waveforms": 1,
    "jeon": 2,
    "unterhuber": 1,
    "rommel": 1,
    "kp": 2,
    "kresoja": 1,
    "detects": 1,
    "bui": 1,
    "horwich": 1,
    "tb": 1,
    "fonarow": 1,
    "epidemiology": 1,
    "profile": 1,
    "korahf": 1,
    "sb": 1,
    "shibahara": 1,
    "agboola": 1,
    "readmissions": 1,
    "retrospective": 1,
    "bmc": 1,
    "decis": 1,
    "mak": 1,
    "plos": 1,
    "boehmer": 1,
    "hariharan": 1,
    "devecchi": 1,
    "fg": 1,
    "predicts": 1,
    "multisense": 1,
    "jacc": 2,
    "shah": 2,
    "katz": 1,
    "selvaraj": 1,
    "circulation": 1,
    "gevaert": 1,
    "tibebu": 1,
    "mamas": 2,
    "ma": 2,
    "categories": 1,
    "stratifying": 1,
    "lund": 2,
    "lh": 1,
    "prognostication": 1,
    "bazoukis": 1,
    "stavrakis": 1,
    "zhou": 1,
    "guiding": 1,
    "systematic": 1,
    "jing": 1,
    "ulloa": 1,
    "cerna": 1,
    "ae": 1,
    "good": 1,
    "cw": 1,
    "van": 1,
    "spall": 1,
    "hg": 1,
    "titration": 1,
    "daubert": 1,
    "behar": 1,
    "martins": 1,
    "rp": 1,
    "mabo": 1,
    "leclercq": 1,
    "avoiding": 1,
    "practical": 1,
    "guide": 1,
    "cikes": 1,
    "sanchez": 1,
    "martinez": 1,
    "claggett": 1,
    "phenogrouping": 1,
    "deng": 1,
    "cheng": 1,
    "huang": 1,
    "secondary": 1,
    "prevention": 1,
    "proof": 1,
    "cardiovasc": 2,
    "krause": 1,
    "andersen": 1,
    "europace": 1,
    "elrefai": 2,
    "abouelasaad": 1,
    "wiles": 2,
    "bm": 2,
    "ann": 1,
    "electrocardiol": 1,
    "dunn": 1,
    "roberts": 1,
    "coniglio": 1,
    "zemkoho": 1,
    "eligibility": 1,
    "yasmin": 1,
    "naeem": 1,
    "asaio": 1,
    "bhatia": 1,
    "maddox": 1,
    "efficacy": 1,
    "jo": 1,
    "yy": 1,
    "diagnostics": 1,
    "basel": 1,
    "stehlik": 1,
    "schmalfuss": 1,
    "analytics": 1,
    "breck": 1,
    "polyzotis": 1,
    "roy": 1,
    "whang": 1,
    "zinkevich": 1,
    "sysml": 1,
    "palo": 1,
    "alto": 1,
    "ca": 1,
    "usa": 1,
    "emmanuel": 1,
    "maupong": 1,
    "mpoeleng": 1,
    "semong": 1,
    "mphago": 1,
    "tabona": 1,
    "survey": 1,
    "vargas": 1,
    "dv": 1,
    "sakurai": 1,
    "pixel": 1,
    "attack": 1,
    "fooling": 1,
    "trans": 1,
    "evol": 1,
    "comput": 1,
    "dombrowski": 1,
    "ak": 1,
    "alber": 1,
    "anders": 1,
    "ackermann": 1,
    "m\u00fcller": 1,
    "kr": 1,
    "kessel": 1,
    "explanations": 1,
    "manipulated": 1,
    "geometry": 1,
    "blame": 1,
    "neurips": 1,
    "vancouver": 1,
    "canada": 1,
    "ghorbani": 1,
    "abid": 1,
    "zou": 1,
    "interpretation": 1,
    "fragile": 1,
    "proc": 1,
    "conf": 1,
    "aaai": 1,
    "pal": 1,
    "umapathi": 1,
    "lk": 1,
    "sankarasubbu": 1,
    "halt": 1,
    "test": 1,
    "nori": 1,
    "king": 1,
    "mckinney": 1,
    "carignan": 1,
    "horvitz": 1,
    "gpt": 1,
    "april": 1
}