{
    "exploring": 2,
    "symptoms": 47,
    "chronic": 10,
    "heart": 49,
    "failure": 36,
    "abstract": 1,
    "patients": 60,
    "with": 41,
    "chf": 17,
    "cry": 2,
    "help": 2,
    "reflecting": 3,
    "not": 12,
    "only": 5,
    "physical": 4,
    "aspects": 2,
    "disease": 23,
    "but": 8,
    "impact": 3,
    "lifestyle": 3,
    "anxiety": 2,
    "depression": 1,
    "expectations": 3,
    "patient": 21,
    "studies": 6,
    "consistently": 2,
    "show": 2,
    "difference": 3,
    "self": 9,
    "assessed": 9,
    "functional": 4,
    "classification": 7,
    "compared": 3,
    "investigator": 2,
    "reported": 6,
    "nyha": 9,
    "moreover": 1,
    "recentlybeen": 1,
    "shown": 1,
    "independently": 2,
    "predict": 2,
    "hospitalisation": 3,
    "mortality": 4,
    "over": 3,
    "years": 2,
    "recognition": 2,
    "appreciation": 2,
    "theirimportance": 1,
    "justifies": 1,
    "use": 7,
    "structured": 3,
    "assessment": 7,
    "order": 6,
    "provide": 2,
    "optimal": 2,
    "medical": 5,
    "care": 9,
    "model": 3,
    "how": 3,
    "structure": 4,
    "symptom": 9,
    "equally": 1,
    "signs": 9,
    "presented": 1,
    "this": 6,
    "paper": 1,
    "european": 5,
    "society": 2,
    "cardiology": 4,
    "published": 3,
    "by": 26,
    "elsevier": 3,
    "rights": 2,
    "reserved": 2,
    "keywords": 1,
    "adherence": 6,
    "background": 1,
    "few": 1,
    "present": 2,
    "health": 6,
    "professional": 3,
    "com": 10,
    "plaining": 1,
    "specific": 1,
    "most": 4,
    "seek": 1,
    "helpbecause": 1,
    "they": 14,
    "which": 6,
    "reflect": 5,
    "feeland": 1,
    "what": 1,
    "viewed": 1,
    "others": 1,
    "current": 1,
    "predominant": 1,
    "theoretical": 1,
    "frame": 1,
    "reference": 1,
    "from": 15,
    "providers": 2,
    "assumes": 1,
    "that": 22,
    "symptomsare": 1,
    "interpreted": 2,
    "reflections": 1,
    "disordered": 1,
    "somatic": 5,
    "biochemical": 1,
    "neur": 1,
    "ophy": 1,
    "siol": 1,
    "ogic": 1,
    "al": 11,
    "etc": 1,
    "processes": 1,
    "task": 2,
    "clinician": 2,
    "therefore": 3,
    "bdecode": 1,
    "qthe": 1,
    "their": 10,
    "biological": 2,
    "referents": 1,
    "todiagnose": 1,
    "entity": 3,
    "however": 6,
    "clinicians": 3,
    "recognize": 1,
    "many": 6,
    "poorly": 3,
    "related": 2,
    "anyobvious": 1,
    "disorder": 4,
    "complicates": 1,
    "diag": 1,
    "nostic": 1,
    "process": 3,
    "consequence": 1,
    "iden": 1,
    "tify": 1,
    "pati": 1,
    "ents": 1,
    "worsening": 5,
    "properly": 1,
    "offer": 1,
    "corr": 1,
    "ectt": 1,
    "reat": 1,
    "ment": 3,
    "development": 1,
    "diagnostic": 1,
    "tools": 1,
    "such": 5,
    "echo": 3,
    "card": 5,
    "iogr": 3,
    "aphy": 4,
    "coronary": 2,
    "angiography": 1,
    "plasma": 1,
    "bnp": 1,
    "used": 2,
    "confirm": 1,
    "or": 11,
    "exclude": 1,
    "little": 1,
    "consideration": 1,
    "given": 3,
    "trying": 2,
    "understand": 3,
    "howpatients": 1,
    "experiences": 3,
    "should": 3,
    "integrated": 1,
    "into": 1,
    "currentpractice": 1,
    "recommendations": 1,
    "paucity": 1,
    "scien": 1,
    "tific": 1,
    "information": 3,
    "obviously": 2,
    "an": 10,
    "important": 4,
    "aspect": 1,
    "frequently": 1,
    "evaluated": 2,
    "research": 3,
    "new": 2,
    "york": 1,
    "association": 1,
    "been": 5,
    "three": 1,
    "decades": 1,
    "summary": 2,
    "measure": 1,
    "theclinicians": 1,
    "impression": 1,
    "class": 1,
    "predicts": 1,
    "outcome": 2,
    "based": 3,
    "onfunctional": 1,
    "limitation": 2,
    "due": 1,
    "alsoinfluenced": 1,
    "knowledge": 2,
    "severity": 3,
    "cardiac": 1,
    "dysfunction": 2,
    "prior": 1,
    "history": 1,
    "likely": 2,
    "prog": 2,
    "nosis": 1,
    "degree": 2,
    "extent": 1,
    "dyspnoea": 4,
    "fatigue": 10,
    "often": 7,
    "documented": 2,
    "records": 1,
    "may": 6,
    "lack": 3,
    "objective": 1,
    "methods": 1,
    "formeasuring": 1,
    "variable": 1,
    "relationship": 4,
    "withenvironment": 1,
    "activity": 2,
    "mood": 1,
    "these": 3,
    "factors": 3,
    "theability": 1,
    "induce": 1,
    "temporary": 1,
    "relief": 3,
    "severe": 1,
    "symptomsmay": 1,
    "reduced": 2,
    "importance": 4,
    "atarget": 1,
    "therapy": 3,
    "clinical": 7,
    "trialists": 1,
    "subjective": 3,
    "recog": 1,
    "nise": 1,
    "value": 2,
    "reflecthow": 1,
    "feels": 1,
    "diseasebut": 1,
    "associated": 2,
    "depressionand": 1,
    "reasons": 2,
    "will": 2,
    "vary": 1,
    "markedly": 1,
    "amongst": 2,
    "andwithin": 1,
    "same": 2,
    "one": 4,
    "time": 2,
    "another": 1,
    "conditions": 9,
    "provoke": 1,
    "emotional": 1,
    "responses": 1,
    "make": 3,
    "feel": 3,
    "more": 2,
    "seve": 1,
    "rely": 1,
    "affe": 1,
    "cted": 1,
    "re": 1,
    "stabilised": 1,
    "even": 4,
    "if": 2,
    "notimproved": 1,
    "adjust": 1,
    "abate": 1,
    "capacity": 1,
    "does": 3,
    "notrecover": 1,
    "learn": 1,
    "live": 1,
    "andthereby": 1,
    "report": 1,
    "less": 2,
    "perc": 1,
    "eive": 1,
    "ddis": 1,
    "comf": 1,
    "ort": 1,
    "well": 3,
    "actual": 1,
    "cause": 2,
    "both": 2,
    "interest": 1,
    "professionals": 3,
    "target": 1,
    "forpatients": 1,
    "recognised": 2,
    "agency": 2,
    "evaluation": 2,
    "products": 1,
    "emea": 2,
    "aswell": 1,
    "american": 1,
    "food": 1,
    "drug": 1,
    "administration": 1,
    "fda": 1,
    "see": 5,
    "front": 1,
    "matter": 1,
    "doi": 5,
    "ejheart": 5,
    "journal": 1,
    "www": 2,
    "locate": 1,
    "breathlessness": 8,
    "classical": 1,
    "probably": 1,
    "because": 5,
    "other": 2,
    "rarely": 1,
    "inpatients": 1,
    "diff": 2,
    "eren": 2,
    "tsym": 2,
    "ptom": 2,
    "during": 4,
    "theirlast": 1,
    "months": 2,
    "life": 5,
    "difficulty": 1,
    "concentrating": 1,
    "bodily": 2,
    "pain": 2,
    "than": 2,
    "chest": 2,
    "common": 2,
    "women": 5,
    "men": 5,
    "experience": 5,
    "similar": 1,
    "perceived": 1,
    "differentways": 1,
    "social": 5,
    "restrictions": 1,
    "affecting": 2,
    "daily": 1,
    "lifeactivities": 1,
    "problematic": 1,
    "whereas": 3,
    "restric": 1,
    "tions": 1,
    "ability": 1,
    "support": 3,
    "family": 2,
    "friendsare": 1,
    "difficult": 3,
    "personal": 4,
    "then": 1,
    "subjectively": 1,
    "byhealth": 1,
    "surprisingly": 1,
    "there": 1,
    "disp": 1,
    "arit": 1,
    "ybet": 1,
    "ween": 1,
    "comparedto": 1,
    "physicians": 3,
    "nurses": 2,
    "according": 1,
    "tiesinga": 1,
    "et": 10,
    "nurse": 5,
    "intensity": 3,
    "relates": 1,
    "own": 2,
    "perceptions": 2,
    "while": 2,
    "relatives": 1,
    "accu": 1,
    "rately": 1,
    "about": 3,
    "isimportant": 1,
    "when": 7,
    "assessing": 1,
    "greaterconcern": 1,
    "poor": 1,
    "reproducibility": 2,
    "assessmentby": 1,
    "it": 5,
    "assumed": 1,
    "sensation": 1,
    "varies": 1,
    "certain": 1,
    "descriptors": 3,
    "shortness": 1,
    "breath": 4,
    "bemore": 1,
    "endorsed": 1,
    "spec": 1,
    "ific": 1,
    "cond": 1,
    "itio": 1,
    "ns": 1,
    "example": 3,
    "obstructive": 1,
    "pulmonary": 2,
    "copd": 1,
    "chose": 2,
    "bmy": 1,
    "ing": 2,
    "requires": 1,
    "effort": 1,
    "bi": 1,
    "suffocating": 2,
    "characterize": 1,
    "compar": 1,
    "among": 2,
    "found": 2,
    "did": 1,
    "choose": 1,
    "any": 1,
    "part": 2,
    "icul": 1,
    "arde": 1,
    "scri": 1,
    "ptor": 1,
    "scored": 1,
    "following": 1,
    "thre": 1,
    "edes": 1,
    "crip": 1,
    "tors": 1,
    "significantly": 1,
    "higher": 6,
    "my": 1,
    "go": 5,
    "way": 3,
    "andi": 1,
    "cannot": 3,
    "get": 1,
    "enough": 1,
    "air": 1,
    "furthermore": 1,
    "greater": 1,
    "accuracy": 1,
    "inmen": 1,
    "major": 1,
    "reason": 2,
    "failing": 1,
    "accurate": 1,
    "diagnosis": 5,
    "presentations": 1,
    "mirror": 1,
    "our": 1,
    "cultural": 2,
    "contexts": 1,
    "understanding": 4,
    "ofsymptoms": 1,
    "deri": 1,
    "vedp": 1,
    "rima": 1,
    "rily": 1,
    "male": 1,
    "trials": 1,
    "oftenfocus": 1,
    "left": 2,
    "ventricular": 1,
    "systolic": 1,
    "dysf": 1,
    "unct": 1,
    "ionl": 1,
    "eadi": 1,
    "ng": 1,
    "proportion": 1,
    "under": 1,
    "its": 1,
    "symptomburden": 1,
    "meaningful": 1,
    "adifference": 1,
    "classifica": 2,
    "tion": 4,
    "fig": 2,
    "recently": 1,
    "comet": 2,
    "trial": 3,
    "predicted": 3,
    "angina": 1,
    "were": 1,
    "rated": 1,
    "using": 1,
    "point": 2,
    "scale": 1,
    "follows": 1,
    "asymptomatic": 1,
    "walking": 2,
    "upstairs": 1,
    "normalpace": 1,
    "normal": 1,
    "pace": 1,
    "flat": 2,
    "walkingslowly": 1,
    "washing": 1,
    "dressing": 1,
    "rest": 2,
    "multivariate": 1,
    "cox": 1,
    "regression": 1,
    "anal": 1,
    "ysis": 1,
    "incl": 1,
    "udin": 1,
    "baseline": 1,
    "covariates": 1,
    "increase": 1,
    "whilst": 1,
    "develop": 2,
    "clearly": 1,
    "symp": 1,
    "toms": 1,
    "repo": 1,
    "rted": 1,
    "targets": 1,
    "fortherapy": 1,
    "right": 2,
    "also": 4,
    "indicate": 1,
    "need": 2,
    "fortreatment": 1,
    "improve": 4,
    "prognosis": 1,
    "readily": 1,
    "available": 1,
    "inex": 1,
    "pensive": 1,
    "acquire": 1,
    "valid": 1,
    "operator": 1,
    "dependent": 1,
    "helping": 1,
    "physician": 2,
    "andnurse": 1,
    "realityshould": 1,
    "therapeutic": 3,
    "alliance": 1,
    "between": 9,
    "patientsand": 1,
    "caregivers": 1,
    "illness": 17,
    "distinction": 1,
    "must": 1,
    "made": 1,
    "defined": 1,
    "abnormality": 1,
    "thestructure": 1,
    "function": 3,
    "body": 1,
    "organs": 1,
    "systems": 2,
    "andcan": 1,
    "identified": 2,
    "asoedema": 1,
    "ejection": 1,
    "fraction": 1,
    "means": 4,
    "experienced": 2,
    "reduction": 1,
    "states": 1,
    "being": 2,
    "socialfunction": 1,
    "manifesting": 1,
    "iii": 1,
    "ii": 1,
    "iiv": 1,
    "conventional": 1,
    "modified": 3,
    "after": 2,
    "ref": 2,
    "editorial": 3,
    "downloaded": 4,
    "https": 8,
    "onlinelibrary": 8,
    "wiley": 16,
    "education": 4,
    "commission": 4,
    "online": 8,
    "library": 8,
    "terms": 8,
    "rules": 4,
    "oa": 4,
    "articles": 4,
    "governed": 4,
    "applicable": 4,
    "creative": 4,
    "commons": 4,
    "license": 4,
    "without": 1,
    "similardegrees": 1,
    "organ": 1,
    "pathology": 1,
    "generate": 1,
    "quite": 1,
    "known": 1,
    "occur": 1,
    "absence": 1,
    "detectable": 1,
    "accordingly": 1,
    "course": 2,
    "verydifferent": 1,
    "accompanying": 1,
    "modelof": 1,
    "practice": 3,
    "integrating": 1,
    "perspectives": 1,
    "developed": 1,
    "anthro": 1,
    "pologists": 1,
    "byron": 1,
    "good": 5,
    "mary": 1,
    "jo": 1,
    "delvecchio": 2,
    "state": 1,
    "whatever": 1,
    "correlates": 1,
    "grounds": 1,
    "becomes": 1,
    "inte": 1,
    "rpre": 1,
    "tedp": 1,
    "erso": 1,
    "nal": 1,
    "diseaseis": 1,
    "primarily": 1,
    "considered": 1,
    "object": 1,
    "ther": 1,
    "apeu": 1,
    "tica": 1,
    "tten": 1,
    "provider": 2,
    "modeluseful": 1,
    "match": 1,
    "treatment": 11,
    "describedstep": 1,
    "step": 3,
    "table": 2,
    "first": 2,
    "pathological": 2,
    "identifies": 1,
    "tiredness": 1,
    "signssuch": 1,
    "ankle": 1,
    "swelling": 1,
    "next": 1,
    "relevance": 4,
    "reveals": 1,
    "meaning": 3,
    "explains": 1,
    "he": 1,
    "she": 1,
    "manage": 1,
    "stairs": 2,
    "home": 8,
    "elicitation": 2,
    "procedure": 2,
    "perspective": 3,
    "confirms": 1,
    "thesuspected": 1,
    "listening": 1,
    "thepatient": 2,
    "explanation": 3,
    "interpretative": 2,
    "goal": 4,
    "view": 2,
    "perspectiveit": 1,
    "interpretation": 3,
    "condition": 2,
    "treat": 1,
    "finally": 1,
    "intervene": 2,
    "orie": 1,
    "nted": 1,
    "appr": 1,
    "oach": 1,
    "meanstrying": 1,
    "reach": 1,
    "concordance": 2,
    "prescribed": 2,
    "suggest": 1,
    "medicines": 5,
    "taken": 1,
    "asprescribed": 1,
    "largely": 1,
    "unknown": 1,
    "indicates": 1,
    "taking": 2,
    "maybe": 1,
    "needs": 1,
    "effects": 2,
    "ssubjective": 2,
    "perception": 4,
    "lattervary": 1,
    "individuals": 1,
    "within": 1,
    "individual": 1,
    "depending": 1,
    "psychological": 1,
    "requirecareful": 1,
    "communication": 1,
    "caregiver": 1,
    "consider": 1,
    "adhering": 1,
    "guidelines": 2,
    "fallshort": 1,
    "breakdown": 1,
    "comm": 1,
    "unic": 1,
    "atio": 1,
    "nsbe": 1,
    "twee": 1,
    "healthcare": 1,
    "instance": 1,
    "week": 1,
    "supply": 1,
    "ofmedication": 1,
    "leave": 1,
    "hospital": 4,
    "some": 1,
    "maythink": 1,
    "very": 2,
    "reasonably": 1,
    "finished": 1,
    "theirdischarge": 1,
    "medication": 3,
    "complete": 1,
    "just": 2,
    "like": 1,
    "anti": 1,
    "biotic": 1,
    "confusing": 1,
    "faced": 1,
    "pre": 1,
    "admission": 2,
    "disc": 1,
    "harg": 1,
    "emed": 1,
    "icat": 1,
    "ion": 1,
    "mult": 1,
    "idis": 1,
    "cipl": 1,
    "inar": 1,
    "management": 3,
    "pro": 1,
    "grammes": 1,
    "quality": 4,
    "reduce": 1,
    "anddelay": 1,
    "subsequent": 1,
    "hosp": 1,
    "ital": 1,
    "isat": 1,
    "ions": 1,
    "interventions": 1,
    "vaguely": 1,
    "described": 1,
    "boptimal": 1,
    "pharmacological": 1,
    "educa": 1,
    "counselling": 2,
    "qand": 1,
    "reproduce": 1,
    "further": 2,
    "non": 1,
    "disobeying": 1,
    "orforgetting": 1,
    "solved": 1,
    "solely": 1,
    "pharmaco": 1,
    "logical": 1,
    "approached": 1,
    "toreach": 1,
    "thinking": 1,
    "adapt": 1,
    "theirway": 1,
    "approaches": 1,
    "tele": 1,
    "monitoring": 1,
    "telephone": 1,
    "models": 2,
    "tailor": 1,
    "intervention": 2,
    "reports": 2,
    "latter": 1,
    "approach": 1,
    "emphasizes": 1,
    "healthprovider": 1,
    "explore": 1,
    "apatient": 1,
    "particular": 1,
    "expression": 1,
    "distress": 2,
    "physiolog": 1,
    "ical": 1,
    "lesion": 1,
    "edemaillness": 1,
    "reality": 1,
    "tired": 1,
    "relevant": 1,
    "data": 2,
    "those": 2,
    "reveal": 2,
    "weight": 1,
    "gainrelevant": 1,
    "review": 1,
    "laboratory": 1,
    "tests": 1,
    "eval": 1,
    "uate": 1,
    "explanatory": 1,
    "old": 1,
    "age": 1,
    "fail": 5,
    "ureu": 1,
    "nder": 1,
    "stan": 1,
    "ding": 1,
    "create": 1,
    "andhealth": 1,
    "pedagogical": 1,
    "conversations": 1,
    "basis": 1,
    "collected": 1,
    "dataeditorial": 1,
    "eitherthe": 1,
    "itself": 1,
    "assessmentin": 1,
    "references": 1,
    "eisenberg": 3,
    "kleiman": 1,
    "editors": 2,
    "science": 2,
    "medicine": 3,
    "london": 3,
    "reidal": 2,
    "publishing": 2,
    "company": 2,
    "bj": 1,
    "mj": 1,
    "hermeneutic": 1,
    "kleinman": 1,
    "foucault": 1,
    "birth": 1,
    "clinic": 3,
    "archaeology": 1,
    "naissance": 1,
    "de": 2,
    "la": 1,
    "clinique": 1,
    "presses": 1,
    "universitaires": 1,
    "france": 1,
    "classics": 1,
    "bennett": 1,
    "ja": 2,
    "riegel": 1,
    "bittner": 1,
    "nichols": 1,
    "validity": 1,
    "reliability": 1,
    "classes": 1,
    "measuring": 1,
    "outcomes": 3,
    "withcardiac": 1,
    "lung": 3,
    "swedberg": 6,
    "cleland": 6,
    "dargie": 1,
    "drexler": 1,
    "follath": 2,
    "komajda": 2,
    "heartfailure": 1,
    "eur": 12,
    "human": 2,
    "http": 1,
    "eu": 1,
    "int": 1,
    "pdfs": 1,
    "ewp": 1,
    "pdf": 1,
    "lynn": 1,
    "teno": 1,
    "jm": 2,
    "phillips": 1,
    "rs": 1,
    "members": 1,
    "dying": 1,
    "older": 2,
    "seriously": 1,
    "ill": 1,
    "investigators": 1,
    "study": 3,
    "prognoses": 1,
    "preferences": 1,
    "risks": 1,
    "treatments": 1,
    "ann": 1,
    "intern": 1,
    "parshall": 1,
    "mp": 2,
    "welsh": 1,
    "dj": 1,
    "brockopp": 1,
    "dy": 1,
    "heiser": 1,
    "rm": 3,
    "schooler": 1,
    "cassidy": 1,
    "kb": 1,
    "dyspnea": 3,
    "duration": 1,
    "emergency": 1,
    "department": 5,
    "visits": 1,
    "nordgren": 1,
    "frensen": 1,
    "last": 1,
    "six": 1,
    "end": 1,
    "stage": 1,
    "scand": 2,
    "caring": 2,
    "sci": 4,
    "zambroski": 1,
    "ch": 1,
    "moser": 1,
    "dk": 1,
    "bhat": 1,
    "ziegler": 1,
    "prevalence": 1,
    "burden": 1,
    "cardiovasc": 6,
    "nurs": 7,
    "press": 2,
    "friedman": 1,
    "mm": 1,
    "gender": 4,
    "differences": 2,
    "adults": 1,
    "ekman": 8,
    "ehrenberg": 2,
    "str": 1,
    "fmberg": 1,
    "olofsson": 1,
    "boman": 2,
    "aires": 1,
    "makes": 1,
    "description": 1,
    "fatigued": 1,
    "elderly": 2,
    "nursing": 2,
    "documentation": 1,
    "correspond": 1,
    "diagn": 1,
    "gadsboll": 1,
    "hoilund": 1,
    "carlsen": 1,
    "pf": 1,
    "nielsen": 1,
    "gg": 1,
    "myocardial": 1,
    "infarction": 1,
    "ray": 1,
    "radionuclide": 1,
    "vent": 1,
    "ricu": 1,
    "logr": 1,
    "catheterisation": 1,
    "tiesenga": 1,
    "dijkstra": 1,
    "dassen": 1,
    "twn": 1,
    "halfens": 1,
    "rjd": 1,
    "van": 2,
    "den": 1,
    "heuve": 1,
    "able": 1,
    "assess": 1,
    "exertion": 1,
    "types": 2,
    "residential": 1,
    "simon": 1,
    "pm": 1,
    "schwartzstein": 2,
    "weiss": 1,
    "jw": 1,
    "fencl": 1,
    "teghtsoonian": 1,
    "weinberger": 1,
    "se": 3,
    "distinguishable": 1,
    "withshortness": 1,
    "rev": 1,
    "respir": 1,
    "dis": 1,
    "mahler": 1,
    "da": 1,
    "harver": 1,
    "lentine": 1,
    "scott": 1,
    "beck": 1,
    "iore": 1,
    "spir": 1,
    "ator": 1,
    "diseases": 1,
    "jrespir": 1,
    "crit": 1,
    "med": 4,
    "andersson": 3,
    "brunlof": 1,
    "lundberg": 1,
    "lindstedt": 1,
    "managed": 1,
    "provides": 1,
    "foundation": 1,
    "lakartidningen": 1,
    "jcf": 1,
    "charlesworth": 2,
    "metra": 1,
    "poole": 2,
    "wilson": 3,
    "pa": 1,
    "prognostic": 1,
    "predictors": 1,
    "insights": 1,
    "distinctions": 1,
    "popular": 1,
    "ideas": 1,
    "sickness": 1,
    "cult": 1,
    "psychiatry": 1,
    "russell": 1,
    "sd": 1,
    "mcneer": 1,
    "fr": 1,
    "higginbotham": 1,
    "mb": 1,
    "duke": 1,
    "university": 5,
    "ducc": 1,
    "exercise": 2,
    "group": 1,
    "circ": 1,
    "exer": 1,
    "tional": 1,
    "unrelated": 1,
    "shah": 1,
    "mr": 1,
    "hasselblad": 1,
    "stinnett": 1,
    "ss": 1,
    "kramer": 1,
    "grossman": 1,
    "gheorghiade": 1,
    "dissociation": 1,
    "hemodynamic": 1,
    "changesand": 1,
    "improvement": 1,
    "advanced": 1,
    "congestive": 1,
    "evangelista": 1,
    "doering": 1,
    "lv": 1,
    "dracup": 1,
    "westlake": 1,
    "hamilton": 1,
    "fonarow": 1,
    "gc": 1,
    "compliance": 1,
    "behaviors": 1,
    "advancedheart": 1,
    "struthers": 1,
    "ad": 1,
    "anderson": 1,
    "macfadyen": 1,
    "rj": 1,
    "fraser": 1,
    "macdonald": 1,
    "tm": 1,
    "nonadherence": 1,
    "ace": 2,
    "inhibitors": 1,
    "bedetected": 1,
    "routine": 1,
    "serum": 1,
    "congest": 1,
    "bohachick": 1,
    "burke": 1,
    "le": 1,
    "sereika": 1,
    "murali": 1,
    "dunbar": 1,
    "jacob": 1,
    "angiotensin": 1,
    "converting": 1,
    "enzyme": 1,
    "inhibitor": 1,
    "forheart": 1,
    "pound": 1,
    "britten": 1,
    "morgan": 1,
    "yardley": 1,
    "pope": 1,
    "daker": 1,
    "white": 1,
    "resisting": 1,
    "synthesis": 1,
    "qualitative": 1,
    "medicinetaking": 1,
    "soc": 2,
    "jgf": 2,
    "five": 1,
    "year": 1,
    "randomised": 3,
    "pat": 1,
    "educ": 1,
    "counsel": 1,
    "horowitz": 1,
    "cr": 1,
    "rein": 1,
    "sb": 1,
    "leventhal": 1,
    "story": 1,
    "maladies": 1,
    "misconceptions": 1,
    "mishaps": 1,
    "effective": 1,
    "aguilar": 1,
    "jc": 1,
    "cohen": 1,
    "solal": 1,
    "euroheart": 1,
    "survey": 2,
    "programme": 1,
    "europe": 1,
    "stromberg": 1,
    "martensson": 1,
    "fridlund": 1,
    "led": 2,
    "clinics": 1,
    "survival": 1,
    "behaviour": 1,
    "results": 1,
    "prospective": 1,
    "thompson": 1,
    "dr": 1,
    "roebuck": 1,
    "stewart": 1,
    "recurrent": 2,
    "focus": 1,
    "content": 1,
    "form": 1,
    "louis": 1,
    "aa": 1,
    "rigby": 1,
    "janssens": 1,
    "balk": 1,
    "ahmm": 1,
    "noninvasive": 1,
    "telemonitoring": 1,
    "high": 1,
    "risk": 1,
    "death": 1,
    "coll": 1,
    "cardiol": 1,
    "jaarsma": 1,
    "der": 1,
    "wal": 1,
    "mh": 1,
    "hogenhuis": 1,
    "lesman": 1,
    "luttik": 1,
    "ml": 1,
    "veeger": 1,
    "nj": 1,
    "design": 1,
    "methodology": 1,
    "coach": 1,
    "multicenter": 1,
    "coordinating": 1,
    "evaluating": 1,
    "advising": 1,
    "inger": 2,
    "sahlgrenska": 4,
    "academy": 1,
    "teborg": 4,
    "box": 1,
    "sweden": 3,
    "mail": 1,
    "address": 1,
    "fhs": 1,
    "gu": 1,
    "corresponding": 1,
    "author": 1,
    "fax": 1,
    "john": 1,
    "hull": 2,
    "kingston": 1,
    "upon": 1,
    "ukbert": 1,
    "karl": 1,
    "stra": 1,
    "july": 1
}