{
    "timely": 1,
    "accurate": 1,
    "heart": 51,
    "failure": 44,
    "diagnosis": 28,
    "gateway": 1,
    "effective": 1,
    "treatment": 2,
    "that": 4,
    "improve": 2,
    "quality": 3,
    "life": 3,
    "prognosis": 2,
    "patients": 19,
    "however": 3,
    "almost": 1,
    "people": 3,
    "receive": 2,
    "an": 3,
    "initial": 1,
    "following": 3,
    "emergency": 2,
    "admission": 1,
    "hospital": 4,
    "this": 3,
    "distressing": 1,
    "families": 2,
    "costly": 2,
    "nhs": 2,
    "usually": 1,
    "denotes": 1,
    "progression": 1,
    "later": 1,
    "stage": 2,
    "disease": 3,
    "british": 5,
    "foundation": 4,
    "called": 2,
    "earlier": 5,
    "prioritised": 2,
    "but": 4,
    "what": 2,
    "challenges": 2,
    "primary": 18,
    "care": 21,
    "burden": 1,
    "around": 2,
    "million": 2,
    "england": 2,
    "living": 1,
    "with": 18,
    "nearly": 1,
    "newly": 1,
    "diagnosed": 2,
    "each": 1,
    "year": 2,
    "typically": 1,
    "experience": 1,
    "increasing": 2,
    "breathlessness": 4,
    "fatigue": 1,
    "leg": 1,
    "swelling": 3,
    "which": 3,
    "impair": 1,
    "their": 1,
    "outlook": 1,
    "worse": 2,
    "than": 1,
    "many": 1,
    "common": 5,
    "cancers": 2,
    "survival": 3,
    "rates": 1,
    "not": 5,
    "improved": 1,
    "substantially": 1,
    "last": 1,
    "two": 1,
    "decades": 1,
    "spends": 1,
    "billion": 1,
    "per": 1,
    "most": 3,
    "cost": 1,
    "incurred": 1,
    "through": 2,
    "department": 3,
    "attendance": 1,
    "prolonged": 1,
    "stay": 1,
    "frequent": 1,
    "readmissions": 1,
    "carers": 1,
    "also": 6,
    "impacted": 1,
    "often": 2,
    "play": 1,
    "vital": 2,
    "role": 1,
    "supporting": 1,
    "treatable": 3,
    "condition": 5,
    "categorised": 1,
    "according": 1,
    "left": 1,
    "ventricular": 1,
    "ejection": 3,
    "fraction": 3,
    "guide": 1,
    "management": 4,
    "reduced": 1,
    "hfref": 2,
    "preserved": 1,
    "hfpef": 2,
    "there": 3,
    "substantial": 1,
    "evidence": 2,
    "base": 1,
    "treatments": 2,
    "such": 4,
    "angiotensin": 1,
    "converting": 1,
    "enzyme": 1,
    "inhibitors": 4,
    "beta": 1,
    "blockers": 1,
    "mine": 1,
    "ralo": 1,
    "cort": 1,
    "icoi": 1,
    "receptor": 1,
    "antagonists": 1,
    "reduce": 1,
    "admissions": 2,
    "increase": 1,
    "newer": 1,
    "drugs": 1,
    "sacubitril": 1,
    "valsartan": 1,
    "ivabradine": 1,
    "recently": 3,
    "sodium": 1,
    "glucose": 1,
    "cotransporter": 1,
    "available": 2,
    "specialist": 4,
    "initiation": 1,
    "prognostically": 1,
    "beneficial": 1,
    "been": 3,
    "limited": 2,
    "until": 1,
    "when": 1,
    "dapagliflozin": 1,
    "empagliflozin": 1,
    "showed": 3,
    "promising": 1,
    "results": 1,
    "clinical": 3,
    "trials": 2,
    "valvular": 1,
    "arrhythmias": 1,
    "important": 1,
    "if": 2,
    "correctable": 1,
    "cause": 1,
    "found": 2,
    "types": 1,
    "diuretic": 1,
    "therapy": 1,
    "relieve": 1,
    "fluid": 1,
    "overload": 1,
    "natriuretic": 11,
    "peptide": 11,
    "testing": 8,
    "national": 3,
    "institute": 3,
    "health": 6,
    "excellence": 2,
    "nice": 6,
    "chronic": 2,
    "guideline": 1,
    "recommends": 2,
    "presenting": 2,
    "symptoms": 8,
    "suggestive": 2,
    "undergo": 1,
    "type": 1,
    "bnp": 2,
    "nt": 5,
    "probnp": 5,
    "both": 1,
    "clinically": 1,
    "perform": 1,
    "similarly": 1,
    "level": 4,
    "raised": 1,
    "patient": 4,
    "requires": 1,
    "referral": 4,
    "echo": 3,
    "card": 3,
    "iogr": 3,
    "aphy": 3,
    "further": 2,
    "assessment": 2,
    "by": 4,
    "confirm": 1,
    "thresholds": 1,
    "differ": 1,
    "between": 3,
    "european": 1,
    "guidelines": 3,
    "explored": 1,
    "our": 1,
    "accompanying": 1,
    "diagnostic": 6,
    "accuracy": 2,
    "study": 9,
    "edition": 1,
    "bjgp": 4,
    "very": 1,
    "high": 1,
    "associated": 1,
    "increased": 2,
    "risk": 1,
    "hospitalisation": 1,
    "so": 1,
    "ng": 2,
    "seen": 2,
    "within": 2,
    "weeks": 2,
    "delays": 3,
    "pathway": 2,
    "complex": 1,
    "dependent": 1,
    "clinician": 1,
    "system": 2,
    "factors": 1,
    "lead": 1,
    "mean": 1,
    "age": 2,
    "years": 1,
    "other": 1,
    "long": 2,
    "term": 3,
    "conditions": 1,
    "take": 1,
    "several": 1,
    "medications": 1,
    "main": 1,
    "variety": 1,
    "causes": 1,
    "awareness": 6,
    "among": 4,
    "public": 6,
    "qualitative": 2,
    "interviews": 1,
    "participants": 1,
    "\u00bdnormalised\u00ef": 1,
    "putting": 1,
    "it": 1,
    "down": 1,
    "old": 1,
    "or": 2,
    "another": 1,
    "led": 2,
    "delay": 1,
    "accessing": 1,
    "medical": 1,
    "services": 3,
    "\u00bdheart": 1,
    "failure\u00ef": 1,
    "itself": 1,
    "was": 1,
    "perceived": 1,
    "frightening": 1,
    "misunderstood": 1,
    "first": 1,
    "subsequent": 1,
    "clinicians": 2,
    "may": 1,
    "initially": 1,
    "link": 1,
    "existing": 1,
    "disorders": 1,
    "example": 1,
    "lung": 1,
    "optimise": 1,
    "before": 1,
    "considering": 2,
    "alternative": 1,
    "normal": 1,
    "helpful": 2,
    "rule": 1,
    "out": 1,
    "universal": 1,
    "access": 2,
    "rapid": 2,
    "needed": 2,
    "recent": 1,
    "large": 1,
    "using": 2,
    "data": 3,
    "analyse": 1,
    "trends": 4,
    "during": 1,
    "period": 1,
    "being": 4,
    "favoured": 1,
    "test": 3,
    "only": 1,
    "one": 1,
    "four": 1,
    "prior": 1,
    "capacity": 2,
    "issues": 1,
    "analysis": 2,
    "timeframes": 1,
    "recommended": 1,
    "formal": 1,
    "imaging": 1,
    "were": 1,
    "achieved": 1,
    "practice": 3,
    "raising": 1,
    "despite": 1,
    "malignant": 2,
    "prioritisation": 2,
    "given": 2,
    "improving": 2,
    "understanding": 2,
    "careeditorials": 1,
    "journal": 2,
    "general": 2,
    "january": 2,
    "\u00bdthe": 1,
    "\u00bddespite": 1,
    "\u00bdamong": 1,
    "cancer": 1,
    "campaigns": 1,
    "successfully": 2,
    "highlighted": 1,
    "similar": 1,
    "approach": 1,
    "could": 1,
    "encourage": 1,
    "symptomatic": 1,
    "seek": 1,
    "help": 1,
    "inspired": 1,
    "\u00bdfast\u00ef": 2,
    "acronym": 3,
    "stroke": 2,
    "created": 2,
    "beat": 4,
    "hf": 3,
    "breathless": 3,
    "exhausted": 2,
    "ankle": 2,
    "time": 3,
    "simple": 2,
    "blood": 2,
    "aim": 2,
    "raise": 2,
    "healthcare": 3,
    "workers": 2,
    "secondary": 2,
    "consider": 2,
    "charity": 1,
    "pumping": 1,
    "marvellous": 1,
    "leading": 1,
    "campaign": 1,
    "hope": 1,
    "will": 1,
    "adopted": 1,
    "more": 3,
    "generally": 1,
    "across": 2,
    "achieving": 1,
    "yet": 1,
    "syndrome": 1,
    "while": 1,
    "offer": 1,
    "clear": 1,
    "pathways": 2,
    "complexity": 1,
    "multimorbidity": 1,
    "means": 1,
    "reality": 1,
    "journey": 1,
    "far": 1,
    "challenging": 1,
    "changes": 1,
    "required": 1,
    "prevent": 1,
    "facilitate": 1,
    "greater": 1,
    "new": 1,
    "onset": 2,
    "worsening": 1,
    "use": 1,
    "inform": 1,
    "decision": 1,
    "making": 1,
    "investment": 1,
    "achieve": 1,
    "clare": 4,
    "taylor": 8,
    "orcid": 1,
    "gp": 1,
    "research": 1,
    "academic": 1,
    "lecturer": 1,
    "nuffield": 2,
    "sciences": 2,
    "university": 2,
    "oxford": 4,
    "provenance": 1,
    "commissioned": 1,
    "externally": 1,
    "peer": 1,
    "reviewed": 1,
    "competing": 1,
    "interests": 1,
    "reports": 1,
    "personal": 1,
    "fees": 1,
    "from": 2,
    "roche": 1,
    "outside": 1,
    "submitted": 1,
    "work": 1,
    "doi": 6,
    "https": 4,
    "org": 5,
    "ress": 1,
    "correspondence": 1,
    "radcliffe": 2,
    "building": 1,
    "observatory": 1,
    "quarter": 1,
    "woodstock": 1,
    "road": 1,
    "uk": 5,
    "email": 1,
    "phc": 1,
    "ox": 1,
    "ac": 1,
    "clarejtaylor": 1,
    "adults": 1,
    "london": 1,
    "www": 2,
    "guidance": 1,
    "accessed": 2,
    "dec": 2,
    "bottle": 1,
    "kim": 2,
    "aylin": 2,
    "et": 9,
    "al": 9,
    "routes": 1,
    "observational": 1,
    "linked": 1,
    "blueprint": 2,
    "change": 2,
    "bhf": 1,
    "media": 1,
    "files": 1,
    "intelligence": 1,
    "pdf": 1,
    "conrad": 1,
    "judge": 1,
    "tran": 1,
    "temporal": 1,
    "patterns": 1,
    "incidence": 1,
    "population": 2,
    "based": 2,
    "individuals": 1,
    "lancet": 2,
    "cj": 4,
    "ord\u00ef": 3,
    "\u00bd\u00ef": 3,
    "\u00bdez": 3,
    "mena": 3,
    "jm": 3,
    "roalfe": 2,
    "ak": 2,
    "after": 1,
    "united": 1,
    "kingdom": 1,
    "cohort": 2,
    "bmj": 2,
    "vaduganathan": 1,
    "docherty": 1,
    "kf": 1,
    "claggett": 1,
    "bl": 1,
    "sglt": 1,
    "comprehensive": 1,
    "meta": 1,
    "five": 1,
    "randomised": 1,
    "controlled": 1,
    "booth": 1,
    "ra": 1,
    "hill": 1,
    "sa": 1,
    "don": 1,
    "wauchope": 1,
    "performance": 1,
    "systematic": 1,
    "review": 1,
    "fail": 1,
    "rev": 1,
    "lay": 2,
    "flurrie": 2,
    "sl": 2,
    "br": 1,
    "gen": 1,
    "pract": 1,
    "hobbs": 2,
    "fd": 1,
    "marshall": 1,
    "symptom": 1,
    "meaning": 1,
    "open": 2,
    "hayhoe": 1,
    "pp": 1,
    "adherence": 1,
    "eur": 1,
    "hartshorne": 1,
    "evans": 1,
    "satchithananda": 1,
    "fdr": 1,
    "faster": 1,
    "bjgpo": 1,
    "\u00bdinspired": 1
}