{
    "years": 24,
    "time": 188,
    "series": 181,
    "forecasting": 555,
    "jan": 1,
    "de": 45,
    "gooijera": 1,
    "rob": 2,
    "hyndmanb": 1,
    "adepartment": 1,
    "quantitative": 2,
    "economics": 4,
    "university": 7,
    "amsterdam": 7,
    "roetersstraat": 1,
    "wb": 1,
    "netherlands": 1,
    "bdepartment": 1,
    "econometrics": 10,
    "business": 16,
    "statistics": 18,
    "monash": 1,
    "vic": 1,
    "australia": 2,
    "abstract": 1,
    "review": 25,
    "past": 13,
    "research": 49,
    "into": 5,
    "this": 74,
    "silver": 3,
    "jubilee": 2,
    "issue": 12,
    "naturally": 2,
    "highlight": 2,
    "results": 20,
    "published": 13,
    "journals": 3,
    "managed": 1,
    "by": 107,
    "international": 287,
    "institute": 8,
    "forecasters": 8,
    "journal": 375,
    "during": 2,
    "period": 13,
    "over": 13,
    "one": 39,
    "third": 2,
    "papers": 20,
    "these": 39,
    "concerned": 2,
    "also": 38,
    "highly": 3,
    "influential": 2,
    "works": 3,
    "that": 124,
    "been": 61,
    "elsewhere": 1,
    "enormous": 2,
    "progress": 2,
    "made": 5,
    "many": 28,
    "areas": 10,
    "but": 16,
    "find": 3,
    "there": 29,
    "large": 17,
    "number": 9,
    "oftopics": 1,
    "need": 7,
    "further": 15,
    "development": 4,
    "conclude": 1,
    "with": 118,
    "comments": 7,
    "possible": 9,
    "future": 25,
    "directions": 4,
    "field": 4,
    "elsevier": 4,
    "rights": 2,
    "reserved": 2,
    "keywords": 1,
    "accuracy": 31,
    "measures": 18,
    "arch": 12,
    "arima": 51,
    "combining": 21,
    "count": 18,
    "data": 62,
    "densities": 9,
    "exponential": 49,
    "smoothing": 49,
    "kalman": 13,
    "filter": 14,
    "long": 29,
    "memory": 24,
    "multivariate": 32,
    "neural": 19,
    "nets": 2,
    "nonlinearity": 2,
    "prediction": 55,
    "intervals": 41,
    "regime": 6,
    "switching": 6,
    "robustness": 3,
    "seasonality": 15,
    "state": 41,
    "space": 45,
    "structural": 15,
    "models": 258,
    "transfer": 13,
    "function": 16,
    "univariate": 28,
    "var": 14,
    "introduction": 5,
    "iif": 5,
    "was": 39,
    "established": 3,
    "ago": 6,
    "its": 16,
    "provides": 6,
    "an": 71,
    "opportunity": 1,
    "seriesforecasting": 3,
    "injournalsspons": 1,
    "oredbytheinstitute": 1,
    "althoughwealso": 1,
    "cover": 1,
    "key": 9,
    "publications": 1,
    "other": 27,
    "theiif": 1,
    "set": 6,
    "jof": 6,
    "publishedwith": 1,
    "john": 2,
    "wiley": 5,
    "sons": 4,
    "after": 1,
    "break": 1,
    "wileyin": 1,
    "decided": 1,
    "start": 3,
    "ijf": 10,
    "since": 8,
    "paper": 13,
    "selective": 1,
    "guide": 1,
    "tothe": 4,
    "literature": 9,
    "covering": 1,
    "theperiod": 1,
    "summarizing": 4,
    "papersincluding": 1,
    "about": 6,
    "under": 7,
    "biif": 1,
    "flag": 1,
    "proportion": 1,
    "concern": 1,
    "fairly": 2,
    "stable": 1,
    "wealso": 1,
    "books": 3,
    "else": 1,
    "where": 13,
    "various": 19,
    "developments": 11,
    "referenced": 3,
    "see": 26,
    "front": 1,
    "matter": 1,
    "doi": 1,
    "ijforecast": 1,
    "corresponding": 3,
    "author": 2,
    "tel": 1,
    "fax": 2,
    "mail": 1,
    "addresses": 1,
    "degooijer": 2,
    "uva": 1,
    "hyndm": 1,
    "buseco": 1,
    "onash": 1,
    "edu": 2,
    "au": 1,
    "hyndman": 53,
    "involved": 3,
    "www": 3,
    "com": 6,
    "locate": 1,
    "ijforecastcomprise": 1,
    "monographs": 1,
    "it": 38,
    "felt": 1,
    "convenient": 2,
    "first": 8,
    "classify": 2,
    "according": 2,
    "exponentialsmoothing": 5,
    "introduced": 6,
    "seriesliterature": 1,
    "rather": 10,
    "than": 27,
    "putting": 2,
    "headingassociated": 1,
    "particular": 6,
    "method": 57,
    "instance": 5,
    "bayesian": 22,
    "methods": 92,
    "general": 12,
    "applied": 12,
    "not": 37,
    "concerning": 1,
    "model": 107,
    "were": 23,
    "then": 7,
    "classified": 1,
    "problems": 15,
    "they": 20,
    "address": 3,
    "inonly": 1,
    "few": 4,
    "cases": 4,
    "subjective": 1,
    "decision": 2,
    "needed": 2,
    "onour": 1,
    "part": 4,
    "sectionheading": 1,
    "facilitate": 1,
    "quick": 1,
    "overview": 2,
    "particularfield": 1,
    "listed": 4,
    "alphabetical": 1,
    "order": 10,
    "undereach": 1,
    "section": 20,
    "headings": 1,
    "determining": 1,
    "what": 8,
    "include": 5,
    "list": 4,
    "references": 2,
    "problem": 12,
    "may": 9,
    "missed": 1,
    "papersthat": 1,
    "authors": 10,
    "silveranniversary": 1,
    "such": 20,
    "somewhatbselective": 1,
    "although": 12,
    "does": 7,
    "imply": 1,
    "unimportant": 1,
    "if": 6,
    "reviewed": 1,
    "intended": 1,
    "critical": 1,
    "brief": 2,
    "historical": 2,
    "personal": 4,
    "tour": 1,
    "main": 3,
    "still": 9,
    "cautious": 1,
    "reader": 1,
    "detectcertain": 1,
    "fruits": 1,
    "intensiveresearch": 1,
    "interest": 7,
    "limited": 4,
    "conversely": 1,
    "clearexplanations": 1,
    "previously": 1,
    "anomalous": 1,
    "timeseries": 2,
    "provided": 17,
    "theend": 1,
    "discusses": 1,
    "some": 42,
    "currentresearch": 1,
    "hold": 1,
    "promise": 2,
    "course": 3,
    "far": 4,
    "from": 52,
    "exhaustive": 1,
    "preamble": 3,
    "twenty": 3,
    "five": 6,
    "often": 8,
    "considered": 16,
    "collection": 2,
    "ad": 1,
    "hoc": 2,
    "techniques": 5,
    "extrapolating": 1,
    "types": 3,
    "ofunivariate": 1,
    "smooth": 8,
    "ing": 27,
    "widely": 9,
    "used": 41,
    "andindustry": 1,
    "received": 3,
    "little": 5,
    "attention": 9,
    "fromstatisticians": 1,
    "did": 3,
    "well": 8,
    "developedstatistical": 1,
    "foundation": 2,
    "originated": 1,
    "inthe": 5,
    "work": 24,
    "brown": 4,
    "holt": 22,
    "reprinted": 2,
    "winters": 21,
    "pegels": 3,
    "simple": 14,
    "useful": 7,
    "classification": 2,
    "trend": 20,
    "seasonal": 51,
    "patternsdepending": 1,
    "whether": 2,
    "additive": 17,
    "linear": 47,
    "ormultiplicative": 1,
    "nonlinear": 43,
    "muth": 3,
    "suggest": 2,
    "statistical": 40,
    "ses": 10,
    "demonstrating": 1,
    "optimal": 5,
    "fore": 21,
    "casts": 2,
    "random": 13,
    "walk": 9,
    "plus": 3,
    "noise": 3,
    "steps": 1,
    "towards": 2,
    "within": 7,
    "astatistical": 1,
    "framework": 5,
    "box": 14,
    "jenkins": 14,
    "roberts": 2,
    "abraham": 5,
    "ledolter": 7,
    "who": 17,
    "showed": 23,
    "forecasts": 111,
    "arise": 2,
    "special": 7,
    "casesof": 1,
    "however": 17,
    "notextend": 1,
    "any": 6,
    "boost": 1,
    "two": 12,
    "which": 23,
    "laid": 1,
    "thefoundation": 1,
    "much": 8,
    "subsequent": 1,
    "thisarea": 1,
    "gardner": 7,
    "thorough": 2,
    "synthesis": 1,
    "date": 2,
    "extended": 9,
    "toinclude": 1,
    "damped": 8,
    "brought": 1,
    "together": 1,
    "lot": 1,
    "existing": 3,
    "stimulated": 1,
    "use": 31,
    "prompted": 1,
    "substantial": 4,
    "amount": 4,
    "ofadditional": 1,
    "later": 6,
    "same": 8,
    "year": 2,
    "snyder": 14,
    "could": 2,
    "arising": 2,
    "innovation": 4,
    "amodel": 1,
    "single": 5,
    "source": 3,
    "error": 48,
    "thisinsight": 1,
    "went": 1,
    "largely": 1,
    "unnoticed": 1,
    "recentyears": 1,
    "basis": 1,
    "underlying": 5,
    "most": 12,
    "studying": 1,
    "empirical": 15,
    "properties": 18,
    "barto": 1,
    "lomei": 1,
    "sweet": 6,
    "makridakis": 19,
    "hibon": 12,
    "proposals": 2,
    "new": 33,
    "estimation": 28,
    "or": 28,
    "initiali": 1,
    "zation": 1,
    "evaluation": 21,
    "mcclain": 2,
    "wilson": 2,
    "consid": 1,
    "ered": 1,
    "underly": 2,
    "mckenzie": 7,
    "multiplicative": 8,
    "taylor": 12,
    "provide": 6,
    "only": 9,
    "genuinely": 1,
    "numerous": 4,
    "studies": 14,
    "applying": 1,
    "contexts": 1,
    "including": 20,
    "computercomponents": 1,
    "air": 2,
    "passengers": 2,
    "grubb": 2,
    "gooijer": 40,
    "production": 7,
    "planning": 3,
    "miller": 11,
    "liberatore": 2,
    "thehyndman": 1,
    "koehler": 22,
    "grose": 2,
    "taxonomy": 1,
    "helpful": 2,
    "categorization": 1,
    "describing": 1,
    "variousmethods": 1,
    "each": 7,
    "consists": 1,
    "typesof": 2,
    "none": 3,
    "multiplica": 2,
    "tive": 3,
    "three": 5,
    "thus": 4,
    "different": 17,
    "bestknown": 1,
    "addi": 1,
    "multiplicativemethod": 1,
    "variations": 6,
    "original": 4,
    "proposed": 25,
    "example": 9,
    "carreno": 2,
    "madina": 1,
    "veitia": 1,
    "williams": 5,
    "pro": 3,
    "posed": 2,
    "modifications": 1,
    "deal": 3,
    "discontinuities": 2,
    "androsas": 1,
    "guerrero": 4,
    "looked": 11,
    "subject": 7,
    "more": 33,
    "con": 2,
    "straints": 1,
    "how": 12,
    "when": 27,
    "components": 5,
    "should": 6,
    "normalized": 1,
    "lawton": 5,
    "argued": 7,
    "renormalization": 2,
    "indices": 4,
    "removes": 1,
    "bias": 5,
    "inestimates": 1,
    "level": 7,
    "slightlydifferent": 1,
    "normalization": 2,
    "schemes": 2,
    "given": 5,
    "byroberts": 1,
    "archibald": 4,
    "developed": 7,
    "equations": 2,
    "simpler": 2,
    "give": 5,
    "point": 10,
    "variation": 2,
    "way": 5,
    "between": 19,
    "drift": 2,
    "equivalent": 6,
    "toholt": 1,
    "parameter": 22,
    "zero": 6,
    "billah": 2,
    "assimakopoulos": 2,
    "nikolo": 1,
    "poulos": 3,
    "btheta": 1,
    "qwhen": 1,
    "param": 3,
    "eter": 1,
    "half": 1,
    "slope": 1,
    "fitted": 2,
    "theta": 3,
    "performed": 2,
    "extremely": 1,
    "competition": 15,
    "why": 3,
    "particularchoice": 1,
    "parameters": 12,
    "good": 9,
    "yetbeen": 1,
    "determined": 3,
    "remarkably": 3,
    "developing": 3,
    "versions": 3,
    "smoothingmethods": 3,
    "notable": 1,
    "exception": 2,
    "ispfeffermann": 1,
    "allon": 2,
    "israeli": 1,
    "tourism": 3,
    "processcontrol": 1,
    "charts": 3,
    "pan": 2,
    "called": 7,
    "bmultivariate": 1,
    "exponentially": 3,
    "weighted": 5,
    "moving": 11,
    "averages": 5,
    "here": 2,
    "focus": 2,
    "ord": 25,
    "built": 2,
    "ofsnyder": 1,
    "proposing": 3,
    "class": 13,
    "asunderlying": 1,
    "meth": 1,
    "ods": 1,
    "et": 27,
    "al": 26,
    "fact": 3,
    "multipli": 2,
    "cative": 2,
    "unique": 1,
    "andother": 1,
    "related": 8,
    "presented": 7,
    "chatfield": 20,
    "known": 12,
    "linearexponential": 1,
    "significance": 1,
    "recent": 9,
    "canalso": 1,
    "derived": 6,
    "selection": 11,
    "rules": 2,
    "based": 26,
    "variances": 7,
    "differenced": 3,
    "choosing": 1,
    "appropriate": 4,
    "tashman": 6,
    "kruk": 2,
    "pared": 1,
    "others": 4,
    "collopy": 8,
    "armstrong": 9,
    "approach": 36,
    "bic": 2,
    "information": 10,
    "criterion": 7,
    "using": 69,
    "performance": 27,
    "addressedby": 1,
    "several": 19,
    "satchell": 2,
    "timmermann": 7,
    "andchatfield": 2,
    "wide": 4,
    "range": 6,
    "generating": 2,
    "processes": 16,
    "asmall": 1,
    "simulation": 6,
    "study": 21,
    "thatj": 1,
    "better": 10,
    "because": 5,
    "so": 8,
    "subjectto": 1,
    "particularly": 4,
    "dataare": 1,
    "non": 31,
    "normal": 5,
    "criticisms": 1,
    "produce": 11,
    "firstanalytical": 1,
    "assume": 1,
    "thatthe": 3,
    "generated": 2,
    "deterministic": 10,
    "functions": 7,
    "oftime": 1,
    "white": 8,
    "regression": 14,
    "expo": 3,
    "nential": 3,
    "newbold": 10,
    "bos": 2,
    "strongly": 2,
    "criticized": 1,
    "approaches": 5,
    "assumption": 4,
    "sought": 1,
    "obtain": 3,
    "via": 4,
    "equivalence": 2,
    "johnston": 4,
    "harrison": 10,
    "found": 9,
    "forecast": 98,
    "spacemodels": 2,
    "multiple": 7,
    "sources": 2,
    "errors": 18,
    "yar": 5,
    "obtained": 15,
    "deriving": 1,
    "theunderlying": 1,
    "approximateprediction": 1,
    "win": 1,
    "ters": 1,
    "discussed": 12,
    "making": 6,
    "step": 34,
    "ahead": 29,
    "independent": 2,
    "approximate": 2,
    "formula": 1,
    "variance": 13,
    "differing": 1,
    "standard": 5,
    "deviation": 1,
    "aheadforecast": 1,
    "estimated": 5,
    "andhyndman": 1,
    "tosimulate": 1,
    "sample": 20,
    "paths": 2,
    "thereby": 1,
    "obtainedprediction": 1,
    "derive": 1,
    "analytical": 1,
    "commonly": 4,
    "theyprovide": 1,
    "comprehensive": 2,
    "algebraic": 1,
    "approachto": 1,
    "handling": 3,
    "distributionproblem": 1,
    "majority": 1,
    "common": 4,
    "practice": 4,
    "restrict": 1,
    "now": 3,
    "thatunderlying": 1,
    "available": 6,
    "natural": 3,
    "invertible": 2,
    "beused": 1,
    "instead": 3,
    "usual": 2,
    "conse": 1,
    "quently": 1,
    "impact": 7,
    "change": 6,
    "thepast": 2,
    "values": 12,
    "negligible": 3,
    "intuitively": 1,
    "poor": 3,
    "theforecast": 2,
    "deteriorates": 1,
    "early": 7,
    "attempts": 1,
    "century": 2,
    "generally": 2,
    "characterized": 1,
    "theidea": 1,
    "world": 1,
    "majorcontribution": 1,
    "yule": 3,
    "launched": 1,
    "notion": 1,
    "stochasticity": 1,
    "postulating": 1,
    "every": 1,
    "regarded": 1,
    "realization": 1,
    "astochastic": 1,
    "process": 9,
    "idea": 8,
    "anumber": 1,
    "developedsince": 1,
    "workers": 3,
    "slutsky": 1,
    "walker": 1,
    "yaglom": 1,
    "formulated": 1,
    "concept": 4,
    "autoregres": 3,
    "sive": 2,
    "ar": 26,
    "average": 12,
    "ma": 2,
    "wold": 1,
    "sdecomposition": 1,
    "theorem": 1,
    "led": 2,
    "formulation": 2,
    "solution": 2,
    "kolmo": 2,
    "gorov": 2,
    "considerable": 4,
    "body": 1,
    "appeared": 4,
    "area": 19,
    "dealing": 1,
    "identification": 9,
    "checking": 1,
    "survey": 11,
    "publication": 1,
    "analysis": 40,
    "control": 16,
    "bybox": 1,
    "knowledge": 2,
    "moreover": 1,
    "coherent": 1,
    "versatile": 1,
    "stage": 2,
    "iterative": 1,
    "book": 2,
    "reinsel": 3,
    "gregory": 1,
    "co": 2,
    "updated": 2,
    "version": 3,
    "bclassic": 1,
    "text": 1,
    "includes": 3,
    "material": 2,
    "intervention": 3,
    "outlier": 2,
    "detection": 1,
    "testing": 10,
    "unit": 11,
    "roots": 5,
    "andprocess": 1,
    "verification": 1,
    "rightly": 1,
    "jenkinsapproach": 1,
    "impacton": 1,
    "theory": 8,
    "modern": 1,
    "seriesanalysis": 1,
    "advent": 2,
    "thecomputer": 1,
    "popularized": 1,
    "auto": 2,
    "regr": 2,
    "essi": 2,
    "vein": 2,
    "tegr": 1,
    "ated": 2,
    "theirextensions": 1,
    "science": 8,
    "indeed": 2,
    "discrete": 4,
    "through": 6,
    "dynamic": 18,
    "regres": 1,
    "sion": 2,
    "vector": 18,
    "arimamodels": 1,
    "quite": 2,
    "ijfpapers": 2,
    "nature": 2,
    "ormore": 1,
    "benchmark": 2,
    "comparison": 17,
    "without": 3,
    "pretending": 1,
    "complete": 1,
    "table": 3,
    "gives": 1,
    "aremore": 1,
    "successful": 1,
    "experiences": 1,
    "reported": 3,
    "valuable": 3,
    "theyhave": 1,
    "whichmay": 1,
    "summarized": 1,
    "follows": 3,
    "success": 1,
    "methodology": 5,
    "founded": 1,
    "them": 6,
    "mimic": 1,
    "behaviour": 3,
    "diverse": 1,
    "adequately": 1,
    "usuallyrequiring": 1,
    "very": 8,
    "final": 4,
    "choice": 2,
    "mid": 1,
    "sixties": 1,
    "amatter": 1,
    "researcher": 1,
    "judgment": 1,
    "noalgorithm": 1,
    "specify": 2,
    "uniquely": 1,
    "examples": 2,
    "real": 7,
    "applications": 9,
    "dataset": 1,
    "horizon": 3,
    "reference": 2,
    "electricity": 7,
    "load": 5,
    "min": 2,
    "wiener": 4,
    "di": 2,
    "caprio": 2,
    "genesio": 2,
    "pozzi": 2,
    "vicino": 2,
    "quarterly": 15,
    "automobile": 2,
    "insurance": 2,
    "paid": 2,
    "claim": 2,
    "quarters": 4,
    "log": 6,
    "cummins": 2,
    "griepentrog": 2,
    "daily": 7,
    "federal": 2,
    "funds": 2,
    "rate": 11,
    "day": 5,
    "hein": 2,
    "spudeck": 2,
    "macroeconomic": 12,
    "wharton": 1,
    "dhrymes": 4,
    "peristiani": 2,
    "monthly": 18,
    "department": 1,
    "store": 1,
    "sales": 5,
    "month": 4,
    "geurts": 4,
    "kelly": 4,
    "pack": 3,
    "demand": 14,
    "telephone": 2,
    "services": 2,
    "grambsch": 2,
    "stahel": 2,
    "yearly": 3,
    "population": 4,
    "totals": 2,
    "demographic": 1,
    "pflaumer": 2,
    "months": 3,
    "spacedu": 1,
    "preez": 2,
    "witt": 2,
    "telecommunications": 1,
    "traffic": 2,
    "layton": 2,
    "defris": 2,
    "zehnwirth": 2,
    "weekly": 1,
    "leone": 2,
    "call": 1,
    "volumes": 1,
    "week": 1,
    "bianchi": 2,
    "jarrett": 2,
    "hanumara": 2,
    "employment": 3,
    "levels": 6,
    "weller": 2,
    "consumption": 7,
    "quarter": 1,
    "liu": 6,
    "lin": 4,
    "harris": 2,
    "varima": 4,
    "municipal": 2,
    "budget": 2,
    "downs": 2,
    "rocke": 2,
    "accounting": 4,
    "functionhillmer": 1,
    "larcker": 2,
    "schroeder": 2,
    "judgmental": 1,
    "arimao": 1,
    "ller": 4,
    "truck": 2,
    "heuts": 2,
    "bronckers": 2,
    "hospital": 2,
    "patient": 2,
    "movements": 2,
    "unemployment": 4,
    "edlund": 3,
    "karlsson": 2,
    "suggested": 9,
    "add": 1,
    "mathematical": 1,
    "rigour": 1,
    "search": 1,
    "anarma": 1,
    "akaike": 2,
    "crite": 1,
    "rion": 1,
    "aic": 1,
    "fpe": 2,
    "andthe": 2,
    "bayes": 1,
    "thesecriteria": 1,
    "come": 3,
    "down": 1,
    "minimizing": 1,
    "penalty": 3,
    "term": 13,
    "foroverfitting": 1,
    "generalized": 7,
    "multi": 26,
    "bhansali": 5,
    "generalization": 3,
    "utilized": 1,
    "seems": 5,
    "casewith": 1,
    "criteria": 3,
    "cross": 2,
    "validation": 4,
    "split": 1,
    "west": 8,
    "principles": 2,
    "genuine": 1,
    "out": 12,
    "seepen": 1,
    "sa": 3,
    "nchez": 2,
    "worth": 3,
    "considering": 1,
    "cf": 1,
    "estimating": 4,
    "arma": 18,
    "equi": 1,
    "vale": 1,
    "ntas": 1,
    "ympt": 1,
    "otic": 1,
    "ally": 1,
    "sense": 4,
    "estimates": 9,
    "tend": 3,
    "distribution": 11,
    "differ": 2,
    "ences": 1,
    "finite": 3,
    "comparativestudy": 1,
    "software": 8,
    "packages": 2,
    "agiakloglou": 2,
    "difference": 2,
    "consequence": 1,
    "influ": 1,
    "ence": 1,
    "recommended": 5,
    "fullmaximum": 1,
    "likelihood": 4,
    "effect": 18,
    "esti": 6,
    "mation": 4,
    "probability": 3,
    "limits": 1,
    "forecastswas": 1,
    "noticed": 2,
    "zellner": 2,
    "he": 4,
    "predictive": 7,
    "distri": 2,
    "bution": 2,
    "observations": 9,
    "treating": 1,
    "eters": 2,
    "variables": 14,
    "recently": 6,
    "kim": 7,
    "small": 5,
    "samples": 1,
    "hefound": 1,
    "bootstrap": 17,
    "corrected": 6,
    "mators": 1,
    "accurate": 5,
    "leastsquares": 1,
    "estimator": 2,
    "landsman": 2,
    "damodaran": 2,
    "evidence": 9,
    "james": 2,
    "stein": 2,
    "arimaparameter": 1,
    "improves": 1,
    "accuracyrelative": 1,
    "mse": 10,
    "loss": 5,
    "follow": 1,
    "disaggregated": 4,
    "obser": 1,
    "vations": 1,
    "terms": 2,
    "least": 5,
    "asforecasts": 1,
    "aggregated": 5,
    "inpractical": 1,
    "factors": 8,
    "beconsidered": 1,
    "missing": 2,
    "disaggregatedseries": 1,
    "both": 11,
    "hotta": 4,
    "analyzed": 2,
    "parametersare": 1,
    "stationary": 9,
    "cardoso": 2,
    "neto": 2,
    "efficiency": 3,
    "even": 4,
    "ifthe": 1,
    "bedone": 1,
    "either": 2,
    "incorporating": 3,
    "external": 1,
    "prior": 9,
    "cholette": 4,
    "andde": 1,
    "alba": 2,
    "alternative": 11,
    "parzen": 2,
    "ararma": 6,
    "istransformed": 1,
    "short": 11,
    "avoiding": 1,
    "bharsher": 1,
    "qdifferenc": 1,
    "operator": 1,
    "addition": 3,
    "dconventional": 1,
    "tbox": 1,
    "achieved": 2,
    "lowest": 1,
    "mape": 7,
    "longer": 5,
    "horizons": 11,
    "hence": 1,
    "issurprising": 1,
    "apart": 3,
    "meade": 7,
    "smith": 14,
    "really": 2,
    "taken": 1,
    "off": 2,
    "ultimate": 1,
    "value": 7,
    "perhaps": 2,
    "judged": 1,
    "assessing": 3,
    "bymeade": 1,
    "compared": 17,
    "automated": 2,
    "automatedararma": 1,
    "automatic": 10,
    "modelling": 10,
    "shown": 2,
    "accu": 1,
    "those": 6,
    "produced": 2,
    "competent": 1,
    "modellers": 1,
    "hill": 6,
    "fildes": 15,
    "libert": 2,
    "kvanli": 2,
    "pavur": 2,
    "texter": 2,
    "vendors": 1,
    "implemented": 1,
    "geriner": 2,
    "leach": 2,
    "act": 1,
    "black": 1,
    "boxes": 1,
    "technology": 2,
    "expert": 3,
    "systems": 11,
    "me": 2,
    "lard": 2,
    "pasteels": 2,
    "avoid": 1,
    "guidelines": 1,
    "chat": 1,
    "adopting": 1,
    "kang": 2,
    "empirically": 4,
    "investi": 1,
    "gated": 1,
    "case": 8,
    "forecastingar": 1,
    "selected": 1,
    "separately": 1,
    "theforecasting": 2,
    "cedure": 1,
    "appears": 2,
    "depend": 1,
    "among": 7,
    "things": 1,
    "periods": 1,
    "difficult": 3,
    "inputvariable": 1,
    "impulse": 2,
    "response": 2,
    "input": 4,
    "arecorrelated": 1,
    "koreisha": 2,
    "rela": 1,
    "tionships": 1,
    "causal": 2,
    "implica": 1,
    "tions": 3,
    "econometric": 7,
    "specification": 6,
    "gupta": 2,
    "identified": 2,
    "major": 4,
    "pitfalls": 2,
    "causality": 4,
    "principal": 3,
    "component": 8,
    "parsi": 1,
    "monio": 1,
    "usrep": 1,
    "resen": 1,
    "tatio": 1,
    "del": 2,
    "moral": 2,
    "valderrama": 2,
    "krishnamurthi": 2,
    "narayan": 2,
    "raj": 2,
    "ofinterventions": 1,
    "beobtained": 1,
    "variable": 7,
    "arimamodel": 3,
    "characteristics": 2,
    "varmaprocesses": 1,
    "appear": 4,
    "byquenouille": 1,
    "implement": 1,
    "became": 5,
    "accommodate": 1,
    "assump": 1,
    "exogeneity": 1,
    "contemporaneous": 1,
    "relation": 1,
    "ships": 1,
    "offered": 1,
    "challenges": 1,
    "policymakers": 1,
    "riise": 2,
    "tjstheim": 2,
    "addressed": 1,
    "varmaforecasts": 1,
    "lamy": 2,
    "filters": 5,
    "varma": 3,
    "prevents": 1,
    "irregular": 2,
    "fluctuations": 1,
    "inexplanatory": 1,
    "migrating": 1,
    "forecastsof": 1,
    "dependent": 4,
    "determine": 1,
    "maximum": 2,
    "klein": 2,
    "theoretical": 9,
    "cumulated": 2,
    "cumulat": 1,
    "ed": 11,
    "lu": 2,
    "tkepohl": 2,
    "studied": 6,
    "effects": 7,
    "temporal": 4,
    "aggregation": 4,
    "andsystematic": 1,
    "sampling": 3,
    "assuming": 3,
    "avarma": 1,
    "unknown": 1,
    "bidar": 1,
    "kota": 1,
    "observed": 3,
    "integrated": 8,
    "autoregressions": 2,
    "vars": 6,
    "constitute": 1,
    "inessence": 1,
    "unrestricted": 2,
    "flexible": 6,
    "approximation": 1,
    "reduced": 2,
    "form": 4,
    "awide": 1,
    "variety": 3,
    "varmodels": 1,
    "specified": 5,
    "ways": 1,
    "funke": 2,
    "specifications": 1,
    "their": 15,
    "usingmonthly": 1,
    "industrial": 3,
    "thomakos": 2,
    "issues": 5,
    "regarding": 3,
    "hafer": 2,
    "sheehan": 2,
    "changes": 4,
    "structure": 2,
    "explicit": 1,
    "expressions": 2,
    "varforecasts": 1,
    "arin": 2,
    "franses": 20,
    "ea": 1,
    "wieringa": 2,
    "horva": 2,
    "th": 2,
    "hansson": 2,
    "jansson": 2,
    "lo": 2,
    "factor": 5,
    "starting": 2,
    "forecastsfrom": 2,
    "parsimoniously": 2,
    "parametrized": 3,
    "suffer": 1,
    "doverfitting": 1,
    "twith": 1,
    "too": 3,
    "free": 1,
    "insignificant": 1,
    "result": 5,
    "though": 2,
    "fit": 1,
    "ting": 2,
    "gerlow": 2,
    "irwin": 2,
    "andsimkins": 1,
    "restricting": 1,
    "litterman": 3,
    "imposed": 2,
    "expressing": 1,
    "belief": 1,
    "economic": 28,
    "variablesbehave": 1,
    "like": 4,
    "bvar": 2,
    "beenchiefly": 1,
    "artis": 2,
    "zhang": 3,
    "ashley": 2,
    "holden": 2,
    "broomhead": 2,
    "kunst": 2,
    "neusser": 2,
    "market": 11,
    "shares": 2,
    "ribeiro": 2,
    "ramos": 2,
    "labor": 1,
    "lesage": 4,
    "magura": 2,
    "spencer": 2,
    "local": 5,
    "kling": 2,
    "bessler": 4,
    "includinglitterman": 1,
    "theengle": 1,
    "granger": 29,
    "cointe": 1,
    "gration": 1,
    "raised": 1,
    "interesting": 5,
    "questions": 1,
    "re": 1,
    "garding": 1,
    "ability": 4,
    "correctionmodels": 1,
    "ecms": 1,
    "bvars": 1,
    "shoesmith": 5,
    "tegene": 2,
    "kuchler": 2,
    "wang": 2,
    "ecmsoutperform": 1,
    "longerj": 1,
    "villani": 2,
    "improve": 3,
    "cointegratedvars": 1,
    "reimers": 2,
    "perfor": 2,
    "mance": 2,
    "seasonally": 4,
    "cointegrated": 6,
    "seriesprocesses": 1,
    "ecm": 2,
    "fourth": 1,
    "differences": 2,
    "poskitt": 4,
    "va": 1,
    "rm": 1,
    "ys": 1,
    "ems": 2,
    "chevillon": 2,
    "hendry": 8,
    "relationship": 3,
    "direct": 2,
    "nonstationary": 2,
    "andforecast": 1,
    "oldest": 1,
    "extract": 1,
    "decomposition": 6,
    "procedure": 8,
    "variants": 4,
    "themost": 1,
    "findley": 4,
    "monsell": 4,
    "bell": 2,
    "otto": 2,
    "chen": 6,
    "extensively": 3,
    "line": 4,
    "decomposi": 1,
    "tion": 8,
    "dagum": 1,
    "andhuot": 1,
    "chiu": 2,
    "higginson": 2,
    "reduce": 1,
    "size": 3,
    "ofrevisions": 1,
    "adjustment": 9,
    "andpfeffermann": 1,
    "morry": 2,
    "wong": 2,
    "explored": 7,
    "andseasonally": 1,
    "adjusted": 3,
    "quenneville": 3,
    "ladiray": 4,
    "lefranc": 3,
    "ois": 4,
    "took": 1,
    "perspective": 1,
    "implied": 4,
    "asymmetric": 5,
    "look": 4,
    "effectiveness": 2,
    "adjusteddata": 1,
    "greater": 4,
    "shrinking": 2,
    "commentaries": 2,
    "latter": 5,
    "wills": 2,
    "quenne": 1,
    "ville": 1,
    "gave": 2,
    "suggestions": 3,
    "implementation": 3,
    "forseasonal": 1,
    "importantbeing": 1,
    "tramo": 1,
    "seats": 1,
    "go": 2,
    "mez": 2,
    "maravall": 4,
    "kaiser": 2,
    "nonparametric": 5,
    "stl": 2,
    "cleveland": 4,
    "mcrae": 2,
    "terpenning": 2,
    "another": 8,
    "proposal": 1,
    "sinusoidal": 2,
    "simmons": 2,
    "similar": 8,
    "ycombe": 1,
    "efficient": 2,
    "estimate": 2,
    "combined": 10,
    "group": 2,
    "individual": 2,
    "seasonalpatterns": 1,
    "bunn": 12,
    "vassilopoulos": 4,
    "demonstrat": 1,
    "clustering": 2,
    "groupsfor": 1,
    "situation": 1,
    "improved": 5,
    "estimators": 9,
    "groupseasonal": 1,
    "root": 8,
    "tests": 14,
    "invented": 1,
    "yet": 3,
    "subsequently": 1,
    "beenconsiderable": 1,
    "done": 8,
    "implementa": 1,
    "hylleberg": 4,
    "pagan": 4,
    "paap": 4,
    "hoek": 2,
    "clements": 15,
    "especially": 4,
    "context": 3,
    "shifts": 3,
    "cautioned": 1,
    "against": 2,
    "spread": 2,
    "foreconomic": 1,
    "osborn": 4,
    "stochastic": 12,
    "romijn": 2,
    "periodic": 11,
    "wells": 2,
    "herwartz": 4,
    "novales": 2,
    "fruto": 2,
    "whom": 1,
    "lead": 8,
    "tonon": 1,
    "conditions": 1,
    "casting": 17,
    "isconsidered": 1,
    "ullah": 2,
    "robust": 6,
    "ness": 1,
    "regressionmodel": 1,
    "dummies": 1,
    "andholt": 1,
    "twoyield": 1,
    "relatively": 3,
    "modelmisspecification": 1,
    "noakes": 2,
    "mcleod": 2,
    "hipel": 2,
    "albertson": 2,
    "aylen": 2,
    "kulendran": 2,
    "king": 2,
    "van": 7,
    "dijk": 7,
    "eachj": 1,
    "season": 1,
    "best": 4,
    "performingmodel": 1,
    "varies": 1,
    "across": 3,
    "depending": 1,
    "whichmodels": 1,
    "tried": 2,
    "thereappears": 1,
    "consensus": 2,
    "conditionsunder": 1,
    "preferred": 4,
    "beginning": 5,
    "statisticians": 2,
    "forforecasting": 1,
    "ideas": 6,
    "beenpresent": 1,
    "engineering": 2,
    "ground": 1,
    "breaking": 1,
    "unifying": 2,
    "written": 1,
    "cast": 2,
    "ingc": 1,
    "ontr": 1,
    "ibut": 1,
    "ion": 1,
    "recursive": 3,
    "algorithm": 3,
    "computing": 8,
    "inter": 3,
    "ested": 1,
    "schweppe": 2,
    "efficientalgorithm": 1,
    "predic": 1,
    "associated": 4,
    "shumway": 2,
    "stoffer": 4,
    "em": 2,
    "includingallowing": 1,
    "asbdynamic": 1,
    "dlm": 2,
    "byharrison": 1,
    "stevens": 3,
    "andstevens": 1,
    "methodssuch": 1,
    "concluded": 3,
    "additional": 2,
    "complexity": 4,
    "improvedforecasting": 1,
    "migon": 2,
    "harvey": 11,
    "followed": 3,
    "healso": 1,
    "renamed": 1,
    "bstructural": 1,
    "uses": 1,
    "bunobserved": 1,
    "prehensive": 1,
    "ofmodels": 1,
    "continuous": 8,
    "gaussian": 8,
    "bear": 1,
    "similarities": 1,
    "sourcesof": 1,
    "bbasic": 1,
    "bsm": 2,
    "seasonalcomponents": 1,
    "ray": 12,
    "convergence": 2,
    "rates": 11,
    "growth": 5,
    "theinitial": 1,
    "states": 2,
    "usually": 5,
    "chosen": 1,
    "subjectively": 1,
    "forinventory": 1,
    "proietti": 2,
    "evaluated": 2,
    "resulting": 2,
    "withthe": 2,
    "power": 7,
    "steady": 3,
    "ofproportions": 1,
    "grunwald": 6,
    "raftery": 2,
    "guttorp": 2,
    "counts": 2,
    "fernandes": 2,
    "hamza": 2,
    "havethe": 1,
    "flaw": 1,
    "converging": 1,
    "toa": 1,
    "constant": 2,
    "less": 3,
    "thewhole": 1,
    "unsuitable": 1,
    "anythingother": 1,
    "bbalanced": 1,
    "primarily": 1,
    "mittnik": 2,
    "vinod": 2,
    "basu": 2,
    "income": 3,
    "ratesusing": 1,
    "balanced": 2,
    "modelshave": 1,
    "subsumevarious": 1,
    "armaxmodels": 1,
    "rational": 1,
    "distributed": 2,
    "lag": 2,
    "bsingle": 1,
    "qmodels": 1,
    "insection": 1,
    "methodological": 1,
    "innovativestate": 1,
    "solve": 2,
    "practical": 8,
    "forecastingproblems": 1,
    "coomes": 2,
    "aj": 1,
    "jobs": 1,
    "industry": 3,
    "regions": 7,
    "patterson": 2,
    "disposableincome": 1,
    "amongst": 1,
    "filtering": 4,
    "struc": 1,
    "tural": 1,
    "durbin": 2,
    "koopman": 2,
    "thestate": 1,
    "havebeen": 3,
    "surprising": 2,
    "today": 1,
    "sometextbook": 1,
    "seem": 2,
    "realize": 1,
    "thekalman": 1,
    "track": 1,
    "nonstationaryprocess": 1,
    "stably": 1,
    "infancy": 2,
    "attributed": 2,
    "tov": 1,
    "olterra": 1,
    "tcould": 1,
    "approximated": 2,
    "volterra": 2,
    "interested": 1,
    "functional": 7,
    "representation": 3,
    "andfurther": 1,
    "theprobabilistic": 1,
    "fitting": 3,
    "beenneglected": 1,
    "neglect": 1,
    "largelybe": 1,
    "proposedwiener": 1,
    "simplified": 1,
    "forms": 2,
    "thebilinear": 1,
    "tremayne": 2,
    "insur": 1,
    "mountable": 1,
    "computational": 2,
    "difficulties": 2,
    "linearity": 1,
    "powerful": 2,
    "tool": 1,
    "increasinglyclear": 1,
    "late": 1,
    "linearmodels": 2,
    "insufficient": 1,
    "forexample": 2,
    "sustained": 2,
    "animal": 1,
    "cycles": 1,
    "thewell": 1,
    "canadian": 4,
    "lynx": 1,
    "solarcycles": 1,
    "annual": 1,
    "sunspot": 2,
    "numbers": 3,
    "energy": 1,
    "flow": 1,
    "andamplitude": 1,
    "frequency": 7,
    "relations": 3,
    "besuitable": 1,
    "accelerated": 1,
    "demands": 2,
    "modelswere": 1,
    "kumar": 2,
    "develop": 3,
    "ments": 1,
    "theseauthors": 2,
    "superiorforecasting": 1,
    "patchy": 1,
    "probably": 1,
    "retarded": 1,
    "reporting": 1,
    "closed": 1,
    "formanalytical": 1,
    "chapman": 1,
    "exact": 2,
    "squares": 4,
    "principle": 1,
    "complex": 1,
    "numericalintegration": 1,
    "pemberton": 2,
    "qassem": 2,
    "lane": 2,
    "nowadays": 2,
    "monte": 4,
    "carlo": 4,
    "bybootstrapping": 1,
    "sinceno": 1,
    "assumptions": 1,
    "theerror": 1,
    "monograph": 1,
    "tera": 8,
    "svirta": 8,
    "boosted": 1,
    "evaluat": 1,
    "selecting": 3,
    "financial": 13,
    "goodoverview": 1,
    "current": 2,
    "art": 3,
    "ijfspecial": 1,
    "introductory": 1,
    "clem": 2,
    "ents": 1,
    "swanson": 5,
    "outlined": 1,
    "topics": 6,
    "thatb": 1,
    "reliable": 1,
    "easy": 2,
    "procedures": 9,
    "will": 10,
    "readily": 2,
    "self": 1,
    "exciting": 1,
    "threshold": 9,
    "setar": 7,
    "prominently": 1,
    "promoted": 1,
    "thebooks": 1,
    "tong": 5,
    "piecewise": 1,
    "basic": 2,
    "attracted": 1,
    "obtaining": 1,
    "univariatediscrete": 1,
    "thatforecasts": 1,
    "aresatisfactory": 1,
    "thedisturbances": 1,
    "otherwise": 2,
    "bootstrapj": 1,
    "byde": 1,
    "vidiella": 2,
    "anguera": 2,
    "brockwell": 2,
    "univari": 1,
    "ate": 1,
    "ctar": 2,
    "calculation": 2,
    "involves": 1,
    "complicated": 1,
    "higherdimensional": 1,
    "integration": 5,
    "ctars": 1,
    "relative": 17,
    "astatkie": 2,
    "watts": 2,
    "watt": 2,
    "boero": 2,
    "marrocu": 2,
    "enders": 3,
    "falk": 2,
    "drawback": 1,
    "dynamics": 5,
    "discontinuously": 1,
    "contrast": 3,
    "transition": 2,
    "star": 5,
    "allows": 3,
    "gradual": 1,
    "regimes": 1,
    "sarantis": 3,
    "type": 8,
    "upon": 1,
    "arand": 1,
    "stock": 14,
    "prices": 3,
    "atboth": 1,
    "medium": 1,
    "ingly": 1,
    "bradley": 2,
    "jansen": 2,
    "refute": 1,
    "conclusion": 2,
    "aggregates": 2,
    "total": 2,
    "output": 6,
    "panel": 3,
    "fordisaggregated": 1,
    "examinedbyfok": 1,
    "investigating": 4,
    "moredetail": 1,
    "govern": 1,
    "theregime": 1,
    "onsimulation": 1,
    "experiments": 1,
    "findings": 3,
    "improvements": 2,
    "vroomen": 2,
    "plausibleinference": 1,
    "specific": 2,
    "parameterdepend": 1,
    "leading": 4,
    "indicator": 2,
    "resultingmodel": 1,
    "outperforms": 2,
    "varying": 5,
    "mar": 1,
    "kov": 1,
    "coefficient": 7,
    "fcar": 2,
    "coefficients": 4,
    "areallowed": 1,
    "vary": 3,
    "measurable": 1,
    "ofanother": 1,
    "lagged": 1,
    "itself": 1,
    "exogenous": 4,
    "fcarmodel": 1,
    "tar": 1,
    "specialcases": 1,
    "analogous": 1,
    "additivemodel": 1,
    "hastie": 2,
    "tibshirani": 2,
    "tsay": 5,
    "modeling": 14,
    "parametric": 4,
    "assumes": 2,
    "suffering": 1,
    "bcurse": 2,
    "dimensionality": 1,
    "cai": 2,
    "fan": 4,
    "yao": 6,
    "harvill": 2,
    "multivariatefunctional": 1,
    "restricted": 4,
    "forecastingmethods": 2,
    "nai": 2,
    "ve": 3,
    "plug": 1,
    "predictor": 4,
    "simula": 1,
    "indicate": 1,
    "slightly": 1,
    "forecastresults": 1,
    "potentially": 2,
    "iswhether": 1,
    "vfcar": 1,
    "canbe": 1,
    "enhanced": 1,
    "artificial": 6,
    "network": 13,
    "ann": 7,
    "unknownfunctional": 1,
    "tofit": 1,
    "darbellay": 2,
    "slama": 2,
    "anns": 13,
    "inputs": 2,
    "getfiltered": 1,
    "hidden": 4,
    "layers": 1,
    "ofwhich": 1,
    "consist": 1,
    "units": 1,
    "nodes": 1,
    "before": 1,
    "theyreach": 1,
    "intermediate": 1,
    "morestructure": 1,
    "application": 10,
    "seezhang": 1,
    "patuwo": 2,
    "hu": 2,
    "hippert": 4,
    "pedreira": 2,
    "souza": 8,
    "surveys": 2,
    "outside": 1,
    "documented": 1,
    "successes": 1,
    "editorials": 2,
    "thisjournal": 1,
    "questioned": 1,
    "oversold": 1,
    "miracle": 1,
    "forecastingtechnique": 1,
    "papersdocumenting": 1,
    "outperform": 6,
    "callen": 2,
    "kwan": 2,
    "yip": 2,
    "yuan": 2,
    "church": 2,
    "curram": 2,
    "conejo": 2,
    "espi": 2,
    "nola": 2,
    "plazas": 2,
    "gorr": 4,
    "nagin": 2,
    "szczypula": 2,
    "tkacz": 2,
    "consistent": 2,
    "adya": 2,
    "evaluating": 8,
    "marquez": 2,
    "oconnor": 2,
    "remus": 2,
    "investigate": 1,
    "define": 3,
    "border": 1,
    "btraditional": 1,
    "qtechniques": 1,
    "theme": 1,
    "likely": 4,
    "high": 9,
    "balkin": 2,
    "stressed": 3,
    "importance": 1,
    "ensure": 1,
    "training": 1,
    "qi": 2,
    "pointed": 1,
    "kept": 1,
    "seealso": 1,
    "olson": 2,
    "mossman": 2,
    "para": 1,
    "metrization": 1,
    "parsimony": 1,
    "important": 12,
    "compare": 3,
    "versus": 6,
    "inquite": 1,
    "depth": 1,
    "layerdfeed": 1,
    "forward": 1,
    "tann": 1,
    "popular": 1,
    "offers": 1,
    "auseful": 1,
    "fixed": 3,
    "specificationlinear": 1,
    "heravi": 2,
    "birchenhall": 2,
    "accurateforecasts": 1,
    "unadjusted": 1,
    "europeanindustrial": 1,
    "ghiassi": 2,
    "saidane": 2,
    "zimbra": 2,
    "traditional": 1,
    "times": 1,
    "fair": 2,
    "say": 1,
    "risk": 9,
    "parametrization": 1,
    "overfitting": 1,
    "recog": 1,
    "nized": 1,
    "neurons": 1,
    "outputs": 1,
    "electric": 2,
    "ity": 1,
    "profiles": 1,
    "nevertheless": 2,
    "question": 1,
    "ofwhether": 1,
    "stillremains": 1,
    "unanswered": 1,
    "building": 2,
    "inference": 8,
    "medeiros": 1,
    "possibility": 1,
    "nonlinearities": 2,
    "frequen": 1,
    "cy": 1,
    "hourly": 1,
    "returns": 13,
    "low": 5,
    "dimensional": 1,
    "chaotic": 1,
    "hasbeen": 1,
    "cecen": 2,
    "erkal": 2,
    "exploit": 1,
    "dependence": 3,
    "dailyspot": 1,
    "lisi": 2,
    "medio": 2,
    "reconstructed": 1,
    "exchange": 8,
    "system": 4,
    "sampleforecasting": 2,
    "arandom": 1,
    "performedbycao": 1,
    "soofi": 2,
    "miscellaneous": 1,
    "host": 1,
    "purposes": 1,
    "forinstance": 1,
    "ludlow": 2,
    "adopted": 1,
    "fourier": 2,
    "ofnonlinearities": 1,
    "present": 3,
    "allow": 3,
    "asymmetries": 5,
    "dahl": 2,
    "hamilton": 2,
    "mod": 3,
    "el": 2,
    "projection": 1,
    "pursuit": 1,
    "areincluded": 1,
    "comparative": 8,
    "marcellino": 2,
    "nearest": 2,
    "neighbour": 2,
    "ferna": 2,
    "ndez": 2,
    "rodri": 2,
    "guez": 2,
    "sosvilla": 2,
    "rivero": 2,
    "andrada": 2,
    "fe": 2,
    "lix": 2,
    "din": 1,
    "fractional": 4,
    "processexhibits": 1,
    "along": 3,
    "span": 1,
    "termed": 1,
    "fractionally": 7,
    "farma": 3,
    "orj": 1,
    "arfima": 14,
    "fields": 1,
    "seegranger": 1,
    "joyeux": 2,
    "motivation": 1,
    "empiricaltime": 1,
    "autocorrelation": 1,
    "functionwhich": 1,
    "declines": 1,
    "slower": 1,
    "orders": 1,
    "integer": 3,
    "potential": 4,
    "opposed": 1,
    "atopic": 1,
    "undertook": 1,
    "compar": 3,
    "ison": 1,
    "andstandard": 1,
    "show": 1,
    "higher": 1,
    "arecapable": 1,
    "following": 2,
    "yadav": 2,
    "investigated": 6,
    "cost": 1,
    "isonly": 1,
    "differenc": 1,
    "forecastingperformance": 1,
    "lossthereafter": 1,
    "differencing": 4,
    "ismore": 1,
    "costly": 1,
    "larger": 1,
    "losses": 1,
    "mis": 1,
    "andersson": 2,
    "misspecification": 1,
    "affects": 1,
    "theestimated": 1,
    "arule": 1,
    "test": 4,
    "man": 1,
    "suitably": 1,
    "adapted": 1,
    "arecompetitive": 1,
    "hurvich": 2,
    "kokoszka": 2,
    "extensions": 4,
    "isons": 2,
    "ooms": 2,
    "dcan": 1,
    "ravishanker": 2,
    "baillie": 4,
    "chung": 2,
    "while": 5,
    "byberan": 1,
    "feng": 2,
    "ghosh": 2,
    "sibbertsen": 2,
    "trends": 4,
    "na": 1,
    "andforecasts": 1,
    "contextof": 1,
    "quality": 3,
    "ramjee": 2,
    "crato": 2,
    "hyperbolically": 1,
    "chart": 3,
    "designed": 2,
    "specif": 1,
    "ically": 1,
    "garch": 25,
    "feature": 2,
    "absolute": 15,
    "periodswhich": 1,
    "display": 1,
    "volatility": 29,
    "phenomenon": 2,
    "referred": 3,
    "finance": 6,
    "autoregressive": 23,
    "condi": 2,
    "tiona": 2,
    "lhete": 2,
    "rosce": 1,
    "dasti": 2,
    "engle": 15,
    "describe": 1,
    "conditional": 20,
    "typically": 1,
    "quadratic": 1,
    "isknown": 1,
    "next": 3,
    "computed": 1,
    "recursively": 1,
    "parsimonious": 1,
    "bollerslev": 10,
    "nelson": 2,
    "dependencies": 2,
    "permitted": 1,
    "lags": 1,
    "agarch": 1,
    "sothat": 1,
    "share": 2,
    "family": 2,
    "surveyed": 2,
    "chou": 2,
    "kroner": 4,
    "bera": 2,
    "higgins": 2,
    "diebold": 14,
    "lopez": 2,
    "surprisingly": 1,
    "ofthe": 1,
    "economet": 1,
    "rics": 1,
    "hand": 1,
    "tonote": 1,
    "neither": 1,
    "nor": 1,
    "forum": 1,
    "public": 1,
    "ations": 1,
    "seen": 2,
    "below": 1,
    "fewijf": 1,
    "dealt": 1,
    "topic": 4,
    "sabbatini": 2,
    "linton": 2,
    "goodparametrization": 1,
    "swissmarket": 1,
    "index": 5,
    "suggests": 2,
    "bej": 1,
    "caution": 1,
    "ghijsels": 2,
    "due": 5,
    "neglectedadditive": 1,
    "outliers": 5,
    "ao": 2,
    "noted": 4,
    "garchmodels": 1,
    "improvedforecasts": 1,
    "brooks": 4,
    "finds": 1,
    "clear": 3,
    "cut": 1,
    "winner": 2,
    "comparing": 6,
    "symmetric": 5,
    "burke": 2,
    "persand": 2,
    "clearly": 2,
    "forecastingaccuracy": 1,
    "observation": 4,
    "verymuch": 1,
    "spirit": 1,
    "outsidetheijf": 1,
    "mean": 36,
    "karanasos": 2,
    "employed": 1,
    "derivation": 1,
    "predictions": 3,
    "plicated": 1,
    "galbraith": 2,
    "kisinbay": 2,
    "content": 3,
    "andfrom": 1,
    "figarch": 3,
    "mikkelsen": 2,
    "haveinformation": 1,
    "approximately": 1,
    "trading": 1,
    "days": 1,
    "vepr": 1,
    "ojec": 1,
    "realized": 3,
    "volatilities": 1,
    "betterresults": 1,
    "byquasi": 1,
    "confirm": 1,
    "earlier": 1,
    "wright": 2,
    "heard": 1,
    "criticism": 3,
    "izations": 1,
    "rationale": 1,
    "forfinancial": 1,
    "having": 1,
    "amore": 1,
    "fundamental": 1,
    "oflong": 1,
    "refer": 1,
    "negatively": 1,
    "correlated": 1,
    "negative": 3,
    "positive": 2,
    "upward": 1,
    "downward": 1,
    "revisions": 3,
    "conditionalvolatility": 1,
    "asasymmetric": 1,
    "ng": 2,
    "motivated": 1,
    "researchers": 2,
    "includingregime": 1,
    "hentschel": 2,
    "overviews": 1,
    "awartaniand": 1,
    "corradi": 2,
    "ofdifferent": 1,
    "besides": 2,
    "poon": 5,
    "landmark": 1,
    "excellent": 1,
    "carefully": 1,
    "conducted": 1,
    "areain": 1,
    "last": 2,
    "working": 2,
    "insights": 2,
    "forecastevaluation": 1,
    "volatilityforecast": 1,
    "measurement": 1,
    "bactual": 1,
    "confounding": 1,
    "extreme": 2,
    "manymore": 1,
    "option": 2,
    "volatilityprovides": 1,
    "seriesmodels": 1,
    "historicalaverages": 1,
    "includingarch": 1,
    "classesof": 1,
    "update": 1,
    "contains": 1,
    "asymmetricgarch": 1,
    "came": 1,
    "contest": 1,
    "unclear": 1,
    "extentthis": 1,
    "asym": 1,
    "metries": 1,
    "moments": 1,
    "anotherissue": 1,
    "concerns": 2,
    "combination": 13,
    "doidge": 2,
    "wei": 2,
    "kneafsey": 2,
    "claessens": 2,
    "vasilellis": 2,
    "would": 1,
    "examine": 1,
    "ofmultivariate": 1,
    "multivariatenonlinear": 1,
    "andcontemporaneous": 1,
    "occur": 1,
    "frequently": 1,
    "inventory": 3,
    "areoften": 1,
    "bintermittent": 1,
    "consequent": 1,
    "onad": 1,
    "fewpapers": 1,
    "seriesusing": 1,
    "croston": 7,
    "independently": 1,
    "willemain": 5,
    "smart": 4,
    "shockor": 2,
    "desautels": 2,
    "morerobust": 1,
    "mapeswhich": 1,
    "undefined": 2,
    "theconditions": 1,
    "betterthan": 1,
    "boylan": 4,
    "schwarz": 2,
    "intermittent": 6,
    "eitherses": 1,
    "nine": 1,
    "raises": 1,
    "presence": 2,
    "zeros": 1,
    "syntetos": 2,
    "integral": 2,
    "transform": 2,
    "gunther": 4,
    "tay": 8,
    "tedesco": 2,
    "tweedie": 2,
    "variousapproaches": 1,
    "bra": 4,
    "nna": 4,
    "poisson": 1,
    "depends": 1,
    "unobserved": 2,
    "autocorrelated": 1,
    "valued": 2,
    "hellstro": 2,
    "nordstro": 2,
    "occupancy": 1,
    "swedish": 2,
    "hotels": 2,
    "buthow": 1,
    "summarize": 1,
    "obvious": 1,
    "freeland": 2,
    "mccabe": 4,
    "median": 12,
    "methodfor": 1,
    "confidence": 4,
    "entireforecast": 1,
    "valuedautoregressive": 1,
    "inar": 2,
    "martin": 2,
    "presenting": 1,
    "forecastingfrom": 1,
    "great": 4,
    "biostatistical": 2,
    "diggle": 2,
    "heagerty": 2,
    "liang": 2,
    "zeger": 2,
    "concentrates": 1,
    "ofhistorical": 1,
    "autocorrelatederrors": 1,
    "anyone": 1,
    "forecastingought": 1,
    "abreast": 1,
    "bewildering": 1,
    "array": 1,
    "evaluate": 2,
    "mahmoud": 2,
    "lety": 1,
    "tdenote": 1,
    "tand": 1,
    "ft": 4,
    "denote": 3,
    "yt": 9,
    "percentage": 8,
    "pt": 3,
    "scaling": 1,
    "divide": 1,
    "anotherstandard": 1,
    "let": 1,
    "base": 2,
    "basemethod": 1,
    "bnai": 1,
    "qwhere": 1,
    "tis": 1,
    "equal": 3,
    "notation": 1,
    "xt": 3,
    "analogously": 1,
    "gmean": 2,
    "geometric": 3,
    "monly": 1,
    "defined": 2,
    "page": 1,
    "subscript": 1,
    "refers": 1,
    "tomeasures": 1,
    "note": 7,
    "relmae": 3,
    "cumrae": 1,
    "relrmse": 2,
    "alsoknown": 1,
    "theil": 3,
    "ustatistic": 1,
    "chapter": 2,
    "sometimes": 2,
    "ranking": 1,
    "evolution": 1,
    "toevaluate": 1,
    "thathave": 1,
    "undertaken": 1,
    "included": 1,
    "mdape": 4,
    "pb": 5,
    "aschatfield": 1,
    "andarmstrong": 1,
    "scale": 2,
    "contained": 1,
    "discussion": 8,
    "serieshas": 1,
    "close": 1,
    "wheelwright": 2,
    "excessively": 1,
    "infinite": 2,
    "mapes": 1,
    "avoided": 1,
    "competitions": 2,
    "werepositive": 1,
    "isimpossible": 1,
    "apply": 2,
    "situations": 1,
    "ijfcarried": 1,
    "articles": 2,
    "meas": 2,
    "ures": 2,
    "gmrae": 4,
    "mdrae": 4,
    "despite": 2,
    "relativeerrors": 2,
    "bwinsorizing": 1,
    "qto": 1,
    "trim": 1,
    "partially": 1,
    "overcomes": 1,
    "butwhich": 1,
    "adds": 1,
    "alevel": 1,
    "arbitrariness": 1,
    "trimming": 1,
    "mustbe": 1,
    "expressed": 1,
    "square": 3,
    "squared": 9,
    "beennoticed": 1,
    "discussants": 1,
    "commentariesofahlburg": 1,
    "tele": 2,
    "communications": 1,
    "taking": 2,
    "account": 2,
    "smape": 2,
    "smdape": 2,
    "bsymmetric": 2,
    "qmeasures": 1,
    "thedisadvantage": 1,
    "put": 2,
    "heavier": 2,
    "onpositive": 1,
    "qas": 1,
    "name": 1,
    "seegoodwin": 1,
    "andkoehler": 1,
    "notably": 1,
    "distinct": 1,
    "lmr": 2,
    "thompson": 5,
    "inthompson": 1,
    "ofthese": 1,
    "wun": 2,
    "pearn": 2,
    "mae": 7,
    "novel": 1,
    "measure": 4,
    "btime": 1,
    "distance": 3,
    "jeontable": 1,
    "rmse": 3,
    "msep": 1,
    "mdae": 1,
    "mrae": 1,
    "rt": 4,
    "ratio": 2,
    "relmse": 1,
    "bmae": 1,
    "bmse": 1,
    "true": 2,
    "lagging": 1,
    "captured": 1,
    "again": 1,
    "majorcomparative": 1,
    "parallel": 1,
    "foreca": 1,
    "sting": 1,
    "contribution": 2,
    "flores": 2,
    "mariano": 2,
    "modification": 2,
    "leybourne": 2,
    "mccracken": 2,
    "newmethod": 1,
    "adjusting": 1,
    "serious": 1,
    "bdata": 1,
    "sharing": 1,
    "sullivan": 2,
    "overcome": 1,
    "distortion": 1,
    "ofstatistical": 1,
    "els": 1,
    "lines": 1,
    "notinvariant": 1,
    "preserving": 1,
    "transformationssuch": 1,
    "theyproposed": 1,
    "bgeneralized": 1,
    "second": 1,
    "moment": 1,
    "gfesm": 1,
    "undesirable": 1,
    "property": 1,
    "aredifficult": 1,
    "mixing": 1,
    "pooling": 2,
    "quan": 1,
    "titative": 1,
    "informa": 1,
    "decades": 1,
    "contributions": 2,
    "weremade": 1,
    "bates": 3,
    "winkler": 5,
    "compelling": 1,
    "effi": 1,
    "ciency": 1,
    "interms": 1,
    "summarizedbyclemen": 1,
    "bibliography": 1,
    "weights": 11,
    "isthe": 2,
    "en": 1,
    "utilize": 1,
    "precision": 1,
    "theforecasts": 1,
    "mixture": 1,
    "theindividual": 1,
    "deter": 1,
    "mined": 1,
    "ols": 5,
    "unbiasedness": 1,
    "thematrix": 1,
    "pastobservations": 1,
    "ramanathan": 2,
    "ever": 1,
    "inefficient": 1,
    "serial": 1,
    "correlation": 1,
    "thecombined": 1,
    "aksu": 2,
    "gunter": 3,
    "andgunter": 1,
    "detail": 1,
    "combina": 1,
    "sum": 1,
    "tounity": 1,
    "deutsch": 2,
    "allowed": 1,
    "starmodels": 1,
    "weighting": 1,
    "schemewas": 1,
    "fiordaliso": 2,
    "fuzzy": 2,
    "combine": 3,
    "pauly": 2,
    "shrinkage": 5,
    "incorpo": 1,
    "ration": 1,
    "ofcombining": 1,
    "verysimilar": 1,
    "sequentially": 1,
    "zou": 2,
    "yang": 2,
    "invari": 1,
    "ant": 1,
    "nonstationarity": 2,
    "occurs": 1,
    "clemen": 2,
    "examined": 1,
    "dlocation": 1,
    "shift": 1,
    "tnonstationarity": 1,
