{
    "special": 4,
    "issue": 1,
    "forecasting": 17,
    "ricardop": 1,
    "erfor": 1,
    "stati": 4,
    "stics": 3,
    "andma": 1,
    "chine": 1,
    "learning": 8,
    "princetonuniversity": 1,
    "usa": 1,
    "aulos": 1,
    "chool": 1,
    "ofeco": 1,
    "nomic": 2,
    "getulio": 2,
    "vargasfoundation": 2,
    "brazil": 4,
    "pontifical": 1,
    "olofa": 1,
    "pplie": 2,
    "dmath": 1,
    "emati": 1,
    "cs": 2,
    "correspondence": 1,
    "marceloc": 2,
    "medeiros": 28,
    "pontificalcatholic": 1,
    "univ": 3,
    "ersi": 2,
    "tyof": 2,
    "riod": 1,
    "ejan": 1,
    "eiro": 1,
    "ruamarqus": 1,
    "desovicente": 1,
    "gvea": 1,
    "riodejaneiro": 1,
    "rj": 1,
    "email": 1,
    "mcm": 1,
    "econ": 2,
    "puc": 1,
    "rio": 1,
    "br": 1,
    "fundinginformation": 1,
    "cnpqandcapes": 1,
    "conselhonacionalde": 1,
    "this": 10,
    "paper": 6,
    "survey": 3,
    "most": 7,
    "recent": 2,
    "advances": 1,
    "supervised": 3,
    "machine": 5,
    "ml": 7,
    "high": 14,
    "dimensional": 15,
    "models": 26,
    "time": 14,
    "series": 12,
    "among": 2,
    "linear": 7,
    "methods": 8,
    "pay": 2,
    "attention": 2,
    "penal": 4,
    "thenonlinear": 1,
    "considered": 4,
    "include": 2,
    "shallow": 2,
    "deep": 4,
    "neural": 9,
    "networks": 5,
    "their": 7,
    "feedforward": 2,
    "recurrent": 1,
    "versions": 2,
    "tree": 3,
    "based": 3,
    "such": 6,
    "random": 7,
    "forests": 5,
    "boosted": 1,
    "trees": 4,
    "also": 6,
    "consider": 7,
    "fromd": 1,
    "iffer": 1,
    "ental": 1,
    "terna": 1,
    "tives": 1,
    "tests": 1,
    "forsu": 1,
    "perio": 1,
    "rpred": 1,
    "ictiv": 1,
    "ability": 2,
    "briefly": 1,
    "reviewed": 1,
    "finally": 10,
    "discuss": 2,
    "appli": 1,
    "illustrationwithhigh": 1,
    "frequencyfinancialdata": 1,
    "keywords": 1,
    "bagging": 2,
    "boosting": 4,
    "nonlinear": 8,
    "penalized": 6,
    "regressions": 8,
    "ran": 1,
    "domforests": 1,
    "regressiontrees": 1,
    "regularization": 2,
    "sieveapproximation": 1,
    "stica": 1,
    "llear": 1,
    "ningt": 1,
    "heory": 1,
    "jel": 1,
    "classification": 1,
    "methodstoeconomicand": 1,
    "financialtime": 1,
    "seriesforecasting": 2,
    "modelselec": 1,
    "tion": 8,
    "withtheavailability": 1,
    "sonsltd": 1,
    "jeconsurv": 2,
    "wileyonlinelibrary": 4,
    "com": 78,
    "journal": 6,
    "joes": 37,
    "masinietal": 36,
    "ofva": 1,
    "stda": 1,
    "tase": 1,
    "tsin": 1,
    "thee": 1,
    "raof": 1,
    "bigdata": 1,
    "tance": 1,
    "however": 15,
    "whatisml": 1,
    "last": 1,
    "few": 1,
    "years": 2,
    "there": 9,
    "myriad": 1,
    "definitions": 1,
    "literature": 4,
    "one": 4,
    "well": 4,
    "samuelwhodefinesmlas": 1,
    "with": 29,
    "powerful": 1,
    "statistical": 5,
    "learn": 2,
    "discover": 1,
    "hidden": 6,
    "patterns": 1,
    "rich": 3,
    "data": 12,
    "sets": 4,
    "that": 23,
    "sense": 2,
    "theory": 3,
    "gives": 1,
    "foundation": 1,
    "therefore": 11,
    "about": 1,
    "developments": 1,
    "not": 3,
    "general": 3,
    "going": 1,
    "focus": 2,
    "statisticalmodels": 1,
    "unsupervised": 1,
    "andr": 1,
    "einf": 1,
    "orce": 1,
    "ment": 2,
    "lear": 1,
    "ning": 1,
    "wherethetaskistolearn": 1,
    "afun": 1,
    "ctio": 1,
    "ntha": 1,
    "tmap": 1,
    "sani": 1,
    "nput": 1,
    "explanatoryvariables": 1,
    "toanoutput": 1,
    "dependentvariable": 1,
    "basedon": 1,
    "dataorganizedasinput": 1,
    "outputpairs": 1,
    "regressionmodels": 1,
    "forexample": 9,
    "belongtothisclass": 1,
    "onthe": 2,
    "otherhand": 1,
    "inre": 1,
    "info": 1,
    "rcem": 1,
    "entl": 1,
    "earn": 1,
    "ing": 8,
    "which": 9,
    "leadi": 1,
    "ttoma": 1,
    "ximum": 1,
    "rewar": 1,
    "players": 2,
    "alfago": 1,
    "forinstance": 6,
    "aswel": 1,
    "lasin": 1,
    "seque": 1,
    "ntial": 1,
    "treat": 1,
    "ments": 2,
    "likebanditproblems": 1,
    "presented": 3,
    "here": 2,
    "roughly": 1,
    "divided": 1,
    "two": 2,
    "groups": 2,
    "first": 4,
    "matedbyregularization": 1,
    "alsoknownasshrinkage": 1,
    "insta": 1,
    "tisti": 2,
    "csand": 1,
    "econo": 2,
    "metri": 2,
    "papers": 4,
    "by": 88,
    "willard": 1,
    "james": 3,
    "charles": 1,
    "stein": 4,
    "who": 1,
    "popularized": 1,
    "bias": 1,
    "variance": 1,
    "trade": 2,
    "off": 2,
    "sta": 1,
    "tistical": 1,
    "estimation": 12,
    "start": 1,
    "considering": 1,
    "ridge": 3,
    "regres": 2,
    "afterthat": 1,
    "wepre": 1,
    "sentt": 1,
    "helea": 1,
    "stabs": 1,
    "olute": 1,
    "shrinkageandselection": 1,
    "lasso": 21,
    "estimatoroftibshirani": 1,
    "anditsmanyextensions": 1,
    "wealso": 1,
    "arealsoreviewed": 1,
    "wecoverthistopicinsec": 1,
    "grenander": 2,
    "continue": 1,
    "analyzing": 1,
    "specific": 2,
    "cases": 1,
    "our": 1,
    "gen": 1,
    "eralsetup": 1,
    "morespecifically": 3,
    "nns": 2,
    "bothintheirshallow": 1,
    "rnns": 1,
    "andtree": 1,
    "base": 2,
    "dmod": 1,
    "elss": 1,
    "ucha": 2,
    "sran": 1,
    "dom": 1,
    "rfs": 1,
    "andboostedtrees": 1,
    "thesuc": 1,
    "cessispartlyduetothe": 1,
    "inouropinion": 1,
    "contrary": 1,
    "what": 1,
    "been": 1,
    "boasted": 1,
    "early": 3,
    "empirical": 2,
    "success": 1,
    "nn": 7,
    "metric": 1,
    "weals": 1,
    "oincl": 1,
    "udeas": 1,
    "urvey": 1,
    "onens": 1,
    "emble": 1,
    "basedmeth": 1,
    "odss": 1,
    "sbag": 1,
    "ging": 1,
    "brei": 2,
    "man": 3,
    "andth": 1,
    "ecomp": 1,
    "letes": 2,
    "ubset": 2,
    "regre": 3,
    "ssion": 3,
    "crs": 1,
    "elliottetal": 2,
    "furthermore": 4,
    "hybridmethods": 1,
    "whereideas": 1,
    "downloaded": 35,
    "from": 42,
    "https": 72,
    "onlinelibrary": 70,
    "wiley": 141,
    "doi": 36,
    "higher": 35,
    "education": 35,
    "commission": 35,
    "online": 70,
    "library": 70,
    "see": 39,
    "terms": 73,
    "conditions": 72,
    "rules": 36,
    "use": 37,
    "oa": 35,
    "articles": 35,
    "governed": 35,
    "applicable": 35,
    "creative": 35,
    "commons": 35,
    "license": 35,
    "wedis": 1,
    "cusst": 1,
    "estso": 1,
    "fsupe": 1,
    "riorp": 1,
    "redic": 4,
    "aquickwordonnotation": 1,
    "anuppercaseletterasin": 1,
    "lowercaseletter": 1,
    "denot": 1,
    "esade": 1,
    "termi": 1,
    "nisti": 1,
    "nonrandom": 1,
    "quantity": 1,
    "boldlettersasin": 1,
    "thesymbol": 1,
    "denotesthe": 1,
    "normofavector": 1,
    "foraset": 1,
    "weuse": 1,
    "todenoteitscardinality": 1,
    "givenasamplewith": 1,
    "reali": 1,
    "zatio": 1,
    "nsoft": 1,
    "heran": 1,
    "domve": 1,
    "ctor": 1,
    "thegoalistopredict": 1,
    "forhorizonsh": 1,
    "throughoutthepaper": 1,
    "assumption": 1,
    "generating": 1,
    "process": 1,
    "dgp": 1,
    "let": 7,
    "covariance": 1,
    "stationary": 1,
    "excluding": 1,
    "important": 2,
    "nonstationary": 1,
    "processes": 2,
    "usually": 5,
    "appear": 1,
    "seriesapplications": 1,
    "inparticular": 2,
    "unitr": 1,
    "ootan": 1,
    "dsome": 1,
    "types": 2,
    "onlon": 1,
    "memo": 1,
    "rypr": 1,
    "oces": 1,
    "sare": 1,
    "excl": 1,
    "uded": 1,
    "byassumption": 1,
    "usuallypredetermined": 1,
    "integers": 1,
    "definethe": 1,
    "dimensionalvectorofpre": 1,
    "dictors": 1,
    "where": 27,
    "following": 1,
    "directforecastingmodel": 1,
    "ris": 1,
    "an": 7,
    "unknown": 2,
    "measurable": 1,
    "function": 2,
    "themodel": 1,
    "orsim": 1,
    "plyth": 1,
    "ebest": 1,
    "linea": 1,
    "rproj": 1,
    "ectio": 2,
    "nof": 1,
    "hontothespacespannedby": 1,
    "regar": 1,
    "dless": 1,
    "ofthe": 3,
    "model": 27,
    "choic": 1,
    "ourtargetbecomes": 1,
    "forh": 1,
    "hisunknown": 1,
    "itsho": 1,
    "uldbe": 1,
    "estim": 2,
    "atedf": 1,
    "romda": 1,
    "ta": 3,
    "targetfunction": 1,
    "given": 2,
    "estimate": 2,
    "hfor": 3,
    "next": 1,
    "step": 3,
    "evaluate": 1,
    "method": 4,
    "estimat": 1,
    "ingi": 1,
    "tspr": 1,
    "edic": 1,
    "accu": 1,
    "racy": 1,
    "tity": 1,
    "theterm": 1,
    "predictionconsistency": 1,
    "referstoestimators": 1,
    "suchthat": 3,
    "asopposed": 1,
    "toitsconditional": 1,
    "count": 1,
    "erpar": 1,
    "twhic": 1,
    "hisgi": 1,
    "venby": 1,
    "thepr": 1,
    "obabi": 2,
    "lityl": 2,
    "awisc": 1,
    "ondi": 1,
    "tionalon": 1,
    "clearly": 1,
    "ifthelatterholdsfor": 1,
    "almost": 1,
    "every": 1,
    "thent": 1,
    "hefor": 1,
    "merho": 1,
    "ldsby": 1,
    "thela": 5,
    "ofiteratedexpectation": 1,
    "norminducedbyeitherthe": 1,
    "uncon": 1,
    "ditio": 1,
    "nalpr": 2,
    "aw": 1,
    "ortheconditionalone": 1,
    "byfar": 1,
    "themostusedarethe": 1,
    "conditional": 4,
    "meana": 1,
    "bsolu": 1,
    "telyp": 1,
    "tione": 1,
    "rror": 1,
    "when": 9,
    "means": 1,
    "quare": 1,
    "dpred": 1,
    "ictio": 1,
    "nerro": 1,
    "or": 7,
    "rootmean": 1,
    "squaredpredictionerror": 1,
    "simply": 1,
    "thesquare": 1,
    "root": 1,
    "those": 1,
    "measuresof": 1,
    "predi": 2,
    "ction": 6,
    "accur": 2,
    "acyba": 1,
    "sedon": 1,
    "inequality": 1,
    "underthechoice": 1,
    "ofalossfunction": 1,
    "thegoalistoselect": 1,
    "expec": 1,
    "tedpr": 1,
    "edict": 2,
    "ivelo": 1,
    "ssorr": 1,
    "isk": 1,
    "givenanestimate": 1,
    "thene": 1,
    "xtste": 1,
    "pisto": 1,
    "evalu": 2,
    "ateth": 1,
    "efore": 1,
    "squarederror": 1,
    "correspondingto": 1,
    "respectively": 8,
    "seegrangerandmachina": 1,
    "elliottandtimmermann": 1,
    "fora": 2,
    "ande": 1,
    "llio": 1,
    "ttan": 1,
    "dtim": 1,
    "merm": 1,
    "ann": 1,
    "amorerecentreview": 1,
    "apart": 1,
    "fromt": 1,
    "hisbr": 1,
    "iefin": 1,
    "trodu": 1,
    "thepa": 2,
    "peris": 1,
    "organ": 1,
    "izeda": 1,
    "sfoll": 1,
    "ows": 1,
    "section": 2,
    "linearregressionmodels": 1,
    "ensembleandhybrid": 1,
    "metho": 1,
    "dsare": 1,
    "prese": 1,
    "ntedi": 1,
    "nsect": 1,
    "ion": 6,
    "ity": 2,
    "application": 2,
    "conclude": 1,
    "some": 5,
    "vect": 1,
    "orof": 2,
    "unkn": 1,
    "ownp": 1,
    "aram": 2,
    "eters": 1,
    "notice": 1,
    "drop": 1,
    "subscript": 1,
    "clarity": 1,
    "theparameter": 1,
    "these": 2,
    "scont": 1,
    "empla": 1,
    "tease": 1,
    "rieso": 1,
    "fwell": 1,
    "known": 2,
    "speci": 1,
    "ficat": 1,
    "ionsi": 1,
    "ntime": 2,
    "seriesanalysis": 1,
    "suchaspredic": 1,
    "tiveregressions": 1,
    "autor": 1,
    "egres": 3,
    "sivem": 1,
    "odels": 3,
    "oford": 1,
    "er": 2,
    "variables": 12,
    "amongmanyothers": 1,
    "hamilton": 2,
    "becomes": 2,
    "whereundersquaredloss": 1,
    "honto": 1,
    "whichis": 1,
    "welldefinedwhenever": 1,
    "isnonsingular": 1,
    "inthatcase": 1,
    "hisorthogonalto": 1,
    "bycon": 1,
    "squares": 1,
    "ols": 4,
    "andsometimes": 1,
    "theol": 1,
    "sesti": 1,
    "mator": 2,
    "isnot": 1,
    "uniqu": 2,
    "eas": 1,
    "thesamplecounterpartof": 1,
    "isrankdeficient": 1,
    "infact": 1,
    "wecan": 1,
    "compl": 2,
    "etely": 1,
    "overf": 1,
    "itwhe": 1,
    "never": 1,
    "defined": 1,
    "it": 10,
    "case": 4,
    "large": 9,
    "possibly": 3,
    "larger": 1,
    "than": 3,
    "number": 6,
    "observations": 1,
    "problem": 1,
    "ball": 1,
    "around": 1,
    "origin": 1,
    "shown": 1,
    "although": 3,
    "biased": 1,
    "restricted": 1,
    "mse": 5,
    "hastie": 6,
    "etal": 6,
    "chap": 2,
    "inpenalizedregressions": 1,
    "theestimator": 2,
    "forth": 2,
    "eunkn": 1,
    "ownpa": 1,
    "ramet": 3,
    "ervec": 2,
    "tor": 2,
    "lagrangianform": 1,
    "depends": 2,
    "tuning": 1,
    "parameter": 3,
    "controls": 1,
    "between": 2,
    "good": 2,
    "if": 6,
    "since": 1,
    "wellasonthedata": 1,
    "naturally": 2,
    "depe": 1,
    "ndso": 1,
    "nthe": 2,
    "choi": 2,
    "ceof": 1,
    "different": 4,
    "ridgeregression": 2,
    "asawa": 2,
    "ytofi": 1,
    "ghthi": 1,
    "ghlyc": 1,
    "orrel": 1,
    "ated": 1,
    "theideawastointroducea": 1,
    "smallbiasbut": 1,
    "inturn": 1,
    "tikhonov": 5,
    "arsenin": 2,
    "parametervector": 2,
    "thatis": 1,
    "thepenaltyin": 2,
    "isgivenby": 3,
    "wherethe": 1,
    "butneverreach": 1,
    "exactly": 1,
    "zero": 1,
    "cannot": 1,
    "used": 1,
    "selecting": 2,
    "predictors": 4,
    "unless": 1,
    "truncation": 1,
    "schemeisemployed": 1,
    "andchenetal": 1,
    "asamethodtoregularize": 1,
    "ismuch": 1,
    "param": 1,
    "eterv": 1,
    "ector": 1,
    "et": 18,
    "al": 19,
    "smallest": 1,
    "convex": 1,
    "yn": 1,
    "mt": 1,
    "ty": 2,
    "sparse": 3,
    "solutions": 1,
    "wesaythesolutionis": 1,
    "sparseifonlyasubset": 1,
    "coefficientsarenonzero": 1,
    "inother": 1,
    "words": 1,
    "hence": 1,
    "lassoismostusefulwhen": 1,
    "theto": 1,
    "talnu": 1,
    "mbero": 2,
    "fregr": 3,
    "essor": 3,
    "despi": 1,
    "teatt": 1,
    "racti": 1,
    "vepro": 1,
    "perti": 1,
    "es": 3,
    "alargenumberofalterna": 1,
    "adaptivelasso": 1,
    "theadaptivelasso": 1,
    "adalasso": 4,
    "wasproposedbyzou": 1,
    "andai": 1,
    "medto": 1,
    "impro": 1,
    "vethe": 1,
    "italsohas": 1,
    "butenjoysthe": 1,
    "oracleproperty": 4,
    "meaningthatit": 1,
    "enterthemodel": 1,
    "wher": 1,
    "ethe": 1,
    "numb": 1,
    "erof": 1,
    "feat": 1,
    "ures": 1,
    "isthe": 5,
    "coeff": 1,
    "icien": 1,
    "tfrom": 1,
    "thefi": 1,
    "rst": 1,
    "stepestimation": 1,
    "anyc": 1,
    "onsi": 1,
    "sten": 1,
    "test": 3,
    "imat": 1,
    "usinglassoasthefirst": 1,
    "impl": 1,
    "emen": 2,
    "tati": 1,
    "onof": 1,
    "azer": 1,
    "oini": 1,
    "tial": 1,
    "esti": 2,
    "mate": 1,
    "elasticnet": 1,
    "theelasticnet": 1,
    "elnet": 1,
    "waspr": 1,
    "opose": 1,
    "dbyzo": 1,
    "uandh": 1,
    "astie": 1,
    "yofco": 1,
    "mbini": 1,
    "ngstr": 1,
    "ength": 1,
    "sof": 3,
    "lass": 2,
    "oand": 1,
    "ridg": 1,
    "ereg": 1,
    "ress": 4,
    "whilethe": 1,
    "parts": 1,
    "tabil": 1,
    "izest": 2,
    "hesol": 1,
    "ution": 1,
    "predictorsbecomehigh": 1,
    "asaconsequence": 1,
    "racyoverthelasso": 1,
    "zou": 7,
    "zhang": 6,
    "justl": 1,
    "ikein": 1,
    "ssore": 1,
    "gress": 2,
    "coord": 1,
    "inate": 1,
    "desce": 1,
    "ntalg": 1,
    "orith": 1,
    "ms": 1,
    "zouandzhang": 1,
    "prop": 1,
    "oset": 1,
    "head": 1,
    "apti": 1,
    "veel": 1,
    "net": 3,
    "theelnetand": 1,
    "ofbothmethods": 1,
    "wherethefirst": 1,
    "stepestimatorcomes": 1,
    "fromtheelnet": 1,
    "folde": 1,
    "dconc": 1,
    "avepe": 1,
    "naliz": 2,
    "ation": 9,
    "compu": 2,
    "tatio": 2,
    "opert": 1,
    "ies": 2,
    "fan": 4,
    "li": 7,
    "approach": 4,
    "covers": 1,
    "collection": 3,
    "penalty": 2,
    "functions": 6,
    "satisfying": 1,
    "set": 11,
    "properties": 2,
    "away": 1,
    "inthisway": 1,
    "each": 7,
    "note": 2,
    "thatunlikelasso": 1,
    "thepenaltymaydependon": 1,
    "inanonlinearway": 1,
    "wesetthepenaltyin": 1,
    "unlikeols": 1,
    "orlasso": 1,
    "nevertheless": 5,
    "fanetal": 1,
    "show": 9,
    "ed": 1,
    "otherpenalties": 1,
    "poss": 1,
    "ibly": 1,
    "impo": 1,
    "sing": 1,
    "spar": 3,
    "sity": 1,
    "inadata": 1,
    "richenvironment": 1,
    "ourpredictionproblem": 1,
    "mostusedpenalties": 1,
    "intime": 2,
    "regu": 1,
    "lari": 1,
    "zedl": 1,
    "inea": 2,
    "rmod": 2,
    "els": 4,
    "thegrouplasso": 1,
    "proposedbyyuanandlin": 1,
    "hepar": 1,
    "amete": 1,
    "rsing": 1,
    "roups": 1,
    "biningthe": 1,
    "factors": 1,
    "denotedby": 1,
    "groupsofregressorsas": 1,
    "values": 1,
    "denoteapartitionof": 1,
    "thecorrespond": 1,
    "regression": 14,
    "subvector": 1,
    "group": 3,
    "assign": 1,
    "isthecardinalityofaset": 1,
    "thegroup": 1,
    "yang": 3,
    "theadaptivegroup": 1,
    "algorithm": 8,
    "wang": 3,
    "leng": 2,
    "inthegrouplasso": 1,
    "ltyon": 1,
    "simonetal": 1,
    "parkandsakaori": 1,
    "mation": 2,
    "konzenandziegelmann": 1,
    "theyobservethat": 1,
    "compa": 3,
    "redto": 1,
    "ssoan": 2,
    "dadal": 1,
    "asso": 2,
    "premi": 1,
    "umwit": 1,
    "hsati": 1,
    "sfact": 1,
    "oryre": 1,
    "sults": 4,
    "bayesian": 1,
    "interpretation": 1,
    "seen": 1,
    "maximum": 1,
    "posteriori": 1,
    "estimator": 5,
    "gaussian": 5,
    "sionwithindependent": 1,
    "equivariant": 1,
    "gaussianpriors": 1,
    "laplaceprior": 1,
    "hans": 2,
    "park": 6,
    "casella": 2,
    "shrinkagemethods": 1,
    "andi": 1,
    "tisb": 1,
    "eyon": 1,
    "dthe": 1,
    "scop": 1,
    "eof": 1,
    "thissurvey": 2,
    "inthissection": 2,
    "previously": 1,
    "discussed": 1,
    "results": 6,
    "selectionconsistency": 1,
    "andoraclebounds": 1,
    "forbo": 1,
    "ththe": 1,
    "finit": 1,
    "edime": 1,
    "nsion": 1,
    "fixed": 6,
    "butpossiblylargerthan": 1,
    "andhighdimension": 1,
    "increaseswith": 1,
    "usuallyfaster": 1,
    "moreprecisely": 1,
    "suppo": 1,
    "sethe": 1,
    "reisa": 1,
    "popul": 1,
    "overrepeatedsamples": 1,
    "arenonnull": 1,
    "wesayamethodis": 1,
    "mode": 1,
    "lsel": 1,
    "ecti": 1,
    "onco": 1,
    "nsis": 1,
    "tent": 1,
    "norm": 1,
    "wesay": 1,
    "thatt": 1,
    "heest": 1,
    "imati": 3,
    "onmet": 1,
    "hodis": 1,
    "consistentifforevery": 1,
    "noritisimpliedby": 1,
    "consistency": 11,
    "asamatteroffact": 1,
    "oftho": 1,
    "semod": 1,
    "esofc": 1,
    "onver": 1,
    "gence": 1,
    "selection": 11,
    "performance": 4,
    "procedure": 3,
    "further": 1,
    "broke": 1,
    "down": 1,
    "how": 4,
    "many": 2,
    "relevant": 4,
    "included": 2,
    "screening": 1,
    "irrelevant": 1,
    "excluded": 1,
    "probability": 1,
    "oracl": 3,
    "erisk": 1,
    "bound": 2,
    "saref": 1,
    "inite": 2,
    "thath": 1,
    "oldwi": 1,
    "thhig": 1,
    "hprob": 1,
    "abili": 1,
    "theseboundsrequire": 1,
    "trans": 1,
    "lates": 1,
    "intoa": 2,
    "elsandarateconditionon": 1,
    "was": 3,
    "originally": 1,
    "developed": 1,
    "design": 4,
    "independent": 1,
    "identically": 1,
    "dis": 1,
    "tributed": 1,
    "iid": 1,
    "errors": 5,
    "knightandfu": 1,
    "authors": 4,
    "framework": 3,
    "clear": 2,
    "toour": 1,
    "knowledge": 1,
    "thefirst": 1,
    "work": 4,
    "expanding": 1,
    "theresultsto": 1,
    "adependentsettingwas": 1,
    "wangetal": 1,
    "authorsshowthatlasso": 1,
    "ismod": 1,
    "elsel": 1,
    "ncons": 1,
    "isten": 1,
    "whereasamodifiedlasso": 1,
    "similartotheadalasso": 1,
    "isbothmodel": 1,
    "nardiandrinaldo": 1,
    "showmodelselection": 1,
    "chanandchen": 1,
    "yoonetal": 1,
    "andscad": 1,
    "sangandsun": 1,
    "memor": 1,
    "yinno": 1,
    "vatio": 1,
    "nsusi": 1,
    "nggen": 1,
    "ands": 1,
    "cada": 1,
    "ticu": 1,
    "larc": 1,
    "ases": 1,
    "kock": 7,
    "allre": 1,
    "above": 3,
    "holdf": 1,
    "orthe": 1,
    "meaningthat": 1,
    "insparse": 2,
    "stat": 1,
    "iona": 4,
    "ryun": 1,
    "ivar": 1,
    "iate": 1,
    "seriessettings": 2,
    "ratefasterthan": 1,
    "medeirosandmendes": 3,
    "property": 2,
    "difference": 1,
    "martingale": 1,
    "strong": 1,
    "mixing": 1,
    "andnon": 1,
    "gaussianinnovations": 1,
    "itincludes": 1,
    "predictiveregressions": 1,
    "autoregressivemodels": 2,
    "autoregressive": 5,
    "exogenous": 1,
    "dynamic": 2,
    "lags": 1,
    "conditionally": 1,
    "heteroskedastic": 1,
    "xie": 2,
    "oracle": 5,
    "mixingerrors": 2,
    "wuandwu": 1,
    "deriveoraclebounds": 1,
    "weak": 1,
    "dependent": 4,
    "innovations": 2,
    "wu": 4,
    "whereashanandtsay": 1,
    "withinthe": 1,
    "samew": 1,
    "eakde": 1,
    "pende": 1,
    "ncefr": 1,
    "amewo": 1,
    "rk": 1,
    "xueandtaniguchi": 1,
    "showm": 1,
    "elect": 5,
    "ionco": 3,
    "nsist": 2,
    "ency": 2,
    "seriesregressionswith": 1,
    "long": 1,
    "memoryinnovations": 1,
    "fanandli": 1,
    "kimetal": 1,
    "showedthatthescadalso": 1,
    "uematsuandtanaka": 1,
    "regressors": 2,
    "ledereretal": 1,
    "problems": 2,
    "seriesproblems": 1,
    "babiietal": 2,
    "proposedthesparse": 1,
    "dimensionaltime": 2,
    "theauthorsderived": 1,
    "eineq": 2,
    "ualit": 3,
    "iesfo": 2,
    "rthes": 1,
    "parse": 1,
    "datam": 1,
    "ayhav": 1,
    "eheav": 1,
    "ytail": 2,
    "integratedtime": 1,
    "settings": 1,
    "lee": 4,
    "shi": 2,
    "dk": 1,
    "oe": 1,
    "smeeksandwijler": 2,
    "proposed": 6,
    "single": 2,
    "equation": 2,
    "error": 2,
    "correction": 1,
    "selector": 1,
    "specs": 1,
    "automated": 2,
    "inspa": 1,
    "rsemu": 1,
    "ltiva": 1,
    "riate": 1,
    "times": 1,
    "eries": 1,
    "hsuetal": 1,
    "showmodel": 1,
    "vector": 3,
    "var": 1,
    "white": 9,
    "noise": 1,
    "shocks": 1,
    "ren": 2,
    "usead": 1,
    "alass": 1,
    "oinas": 1,
    "imila": 1,
    "rsett": 1,
    "afterward": 1,
    "callotandkock": 1,
    "inhigh": 1,
    "dimensionalsettings": 1,
    "wherethedimensionofthe": 1,
    "kockandcallot": 1,
    "andbasuandmichailidis": 1,
    "extendingpreviousworks": 1,
    "melnykandbanerjee": 1,
    "exten": 2,
    "dedth": 2,
    "esere": 1,
    "foral": 1,
    "arge": 1,
    "penalties": 1,
    "zhu": 2,
    "derives": 1,
    "bounds": 2,
    "folded": 1,
    "concave": 1,
    "tiesforgaussian": 1,
    "modelsinhighdimensions": 1,
    "morerecently": 5,
    "rese": 1,
    "arch": 1,
    "ersh": 1,
    "aved": 1,
    "epar": 1,
    "ted": 1,
    "wongetal": 1,
    "deri": 1,
    "vedf": 1,
    "init": 1,
    "esam": 1,
    "pleg": 1,
    "uar": 1,
    "mixingprocesswithsub": 1,
    "weibull": 1,
    "marginaldistributions": 1,
    "deriveequation": 1,
    "wisee": 1,
    "rrorb": 1,
    "ounds": 1,
    "elass": 1,
    "oesti": 1,
    "matorofweaklysparse": 1,
    "inmix": 1,
    "ingal": 1,
    "edepe": 1,
    "ndenc": 1,
    "esett": 1,
    "ings": 1,
    "incl": 1,
    "udem": 1,
    "odel": 1,
    "swit": 1,
    "hcon": 1,
    "ficientsarelargeenough": 1,
    "thisc": 1,
    "ondit": 1,
    "ionis": 2,
    "asthe": 1,
    "minrestriction": 2,
    "hasno": 1,
    "tbeen": 1,
    "taken": 1,
    "ccoun": 1,
    "thet": 1,
    "ruel": 1,
    "imit": 1,
    "dist": 1,
    "ribu": 1,
    "very": 7,
    "being": 1,
    "even": 1,
    "bimodal": 1,
    "instance": 1,
    "leeb": 3,
    "ptscher": 3,
    "andbellonietal": 1,
    "foradetaileddiscussion": 1,
    "inference": 3,
    "after": 1,
    "actually": 1,
    "active": 1,
    "area": 1,
    "research": 3,
    "vast": 1,
    "num": 1,
    "ber": 1,
    "recently": 6,
    "appeared": 1,
    "van": 1,
    "de": 1,
    "geer": 1,
    "desparsified": 1,
    "order": 1,
    "construct": 2,
    "asymptotically": 1,
    "valid": 1,
    "confidence": 2,
    "interval": 1,
    "theaddition": 1,
    "extra": 1,
    "term": 2,
    "unbiased": 1,
    "longer": 1,
    "moreimportantly": 1,
    "thesensethatv": 1,
    "ate": 2,
    "regularity": 1,
    "surprisingly": 1,
    "condition": 1,
    "approximated": 1,
    "particular": 1,
    "propose": 2,
    "run": 2,
    "onto": 1,
    "theau": 2,
    "thors": 2,
    "named": 2,
    "thisp": 1,
    "roces": 1,
    "sas": 2,
    "nodewide": 1,
    "fordetails": 1,
    "belloni": 3,
    "put": 1,
    "forward": 1,
    "double": 2,
    "context": 1,
    "form": 1,
    "interest": 1,
    "lies": 1,
    "scalar": 1,
    "parame": 1,
    "ter": 1,
    "control": 1,
    "consists": 2,
    "regressorsinthehigh": 1,
    "dime": 2,
    "nsio": 2,
    "naux": 1,
    "ilia": 1,
    "ryre": 1,
    "gres": 2,
    "sions": 2,
    "nb": 1,
    "y": 1,
    "obtained": 1,
    "oncetheset": 1,
    "priori": 1,
    "estimated": 3,
    "nonzero": 1,
    "parameters": 2,
    "low": 4,
    "main": 1,
    "result": 1,
    "theorem": 2,
    "states": 4,
    "underwhichtheestimator": 1,
    "normal": 1,
    "theusualfashion": 1,
    "similartotayloretal": 1,
    "andlockhartetal": 2,
    "leeetal": 1,
    "putforwardgeneral": 1,
    "theauthorsargue": 1,
    "details": 1,
    "andtayloretal": 1,
    "isthatintheformer": 1,
    "whilevandegeeretal": 1,
    "bellonietal": 1,
    "seriesenvironment": 2,
    "hecqetal": 1,
    "isoneofthefirst": 1,
    "selec": 2,
    "tioni": 1,
    "nfere": 2,
    "ncein": 1,
    "atime": 1,
    "andadmeketal": 1,
    "totime": 1,
    "seriesframework": 1,
    "more": 4,
    "specifically": 1,
    "babii": 4,
    "underheteroskedastic": 1,
    "autocorrelated": 1,
    "heteroskedaticity": 1,
    "autocorrelation": 2,
    "consistent": 1,
    "hac": 1,
    "they": 1,
    "debi": 1,
    "ased": 1,
    "central": 1,
    "limit": 2,
    "coefficients": 1,
    "study": 2,
    "hacestimatorofthelong": 1,
    "runva": 1,
    "rianc": 1,
    "ebase": 1,
    "donth": 1,
    "espar": 1,
    "se": 1,
    "grouplassoresiduals": 1,
    "admeket": 1,
    "seriessettingundernear": 1,
    "epochdependence": 1,
    "assumptions": 1,
    "allowingfornon": 1,
    "fur": 1,
    "thermore": 1,
    "thefunction": 1,
    "happearingin": 1,
    "assum": 1,
    "ingaq": 1,
    "uadra": 2,
    "ticlo": 2,
    "ssfun": 1,
    "agenericfunctionspace": 1,
    "theop": 1,
    "timiz": 1,
    "probl": 1,
    "emsta": 1,
    "tedin": 1,
    "isinfea": 1,
    "sible": 1,
    "infinite": 2,
    "efficient": 2,
    "technique": 1,
    "search": 1,
    "over": 3,
    "course": 1,
    "asforinstance": 1,
    "impos": 1,
    "ingli": 1,
    "neari": 1,
    "tyors": 1,
    "pecif": 1,
    "ic": 2,
    "tersvirta": 9,
    "suarez": 2,
    "fariasetal": 2,
    "mcaleer": 5,
    "review": 1,
    "suchmodels": 1,
    "alternatively": 1,
    "wecanreplace": 1,
    "bysimplerandfinite": 1,
    "theideaistoconsidera": 1,
    "sequenceoffinite": 1,
    "dimensionalspaces": 1,
    "sievespaces": 1,
    "thatconvergesto": 1,
    "somenorm": 1,
    "thea": 1,
    "ppro": 1,
    "xima": 1,
    "ting": 3,
    "func": 2,
    "iswrittenas": 1,
    "thbasisfunctionfor": 1,
    "ofparameters": 1,
    "thenu": 1,
    "fbasi": 1,
    "sfunc": 1,
    "tions": 7,
    "willdepend": 1,
    "sample": 5,
    "size": 2,
    "dimension": 1,
    "space": 5,
    "arg": 1,
    "min": 2,
    "lying": 1,
    "fundamental": 1,
    "concept": 1,
    "dense": 2,
    "beingametricspace": 1,
    "isdensein": 1,
    "ifforany": 1,
    "thereisa": 1,
    "isca": 1,
    "lled": 1,
    "them": 1,
    "etho": 1,
    "dof": 1,
    "sieves": 2,
    "fortime": 1,
    "seriesdata": 1,
    "seechen": 1,
    "example": 6,
    "approximating": 1,
    "know": 1,
    "proper": 1,
    "subset": 3,
    "polynomials": 1,
    "continuous": 3,
    "polynomi": 1,
    "als": 1,
    "smaller": 2,
    "simpler": 1,
    "natural": 1,
    "bymaking": 1,
    "thesetofpolyno": 1,
    "mials": 1,
    "degree": 1,
    "equal": 1,
    "including": 2,
    "constant": 1,
    "inthe": 3,
    "thiss": 1,
    "equen": 3,
    "ceoff": 1,
    "dimen": 5,
    "siona": 5,
    "lspac": 1,
    "eofpo": 1,
    "lynom": 1,
    "ials": 1,
    "whic": 1,
    "honi": 1,
    "tstu": 1,
    "rnis": 1,
    "dens": 1,
    "ein": 1,
    "linearsieves": 1,
    "andmethodslikeols": 1,
    "inthiscase": 2,
    "thedimension": 1,
    "thevectorofparameters": 1,
    "canbeestimatedby": 1,
    "designmatrixand": 1,
    "nonlinearsieves": 1,
    "nonlinearleast": 1,
    "squar": 1,
    "esmet": 1,
    "hodss": 1,
    "hould": 1,
    "beuse": 1,
    "inthispaper": 2,
    "nnsandregressiontrees": 1,
    "figure": 12,
    "colou": 3,
    "rfigu": 3,
    "recan": 3,
    "bevie": 3,
    "wedat": 3,
    "traditional": 1,
    "classified": 1,
    "into": 1,
    "westa": 1,
    "rtdes": 1,
    "cribi": 1,
    "ngthe": 1,
    "shall": 1,
    "ownns": 1,
    "isdefinedas": 1,
    "intheabovemodel": 1,
    "catio": 1,
    "nsofe": 1,
    "conom": 2,
    "icfor": 1,
    "ecast": 2,
    "thebasisfunctions": 1,
    "areca": 1,
    "lleda": 1,
    "ctiva": 1,
    "tionf": 2,
    "uncti": 1,
    "ons": 2,
    "called": 3,
    "weights": 1,
    "sum": 1,
    "neurons": 3,
    "specification": 3,
    "thegr": 1,
    "eenci": 1,
    "rcles": 1,
    "figur": 1,
    "represent": 2,
    "input": 4,
    "layer": 5,
    "covariates": 3,
    "thefigure": 1,
    "arefo": 1,
    "urinp": 1,
    "utvar": 1,
    "iable": 1,
    "layers": 2,
    "five": 1,
    "elements": 1,
    "ofout": 1,
    "putsf": 1,
    "romth": 1,
    "ehidd": 1,
    "enlay": 1,
    "intheearlydays": 1,
    "waschosen": 1,
    "afunction": 1,
    "isasquashing": 1,
    "sigmoid": 1,
    "functionifitisnon": 1,
    "decreasing": 1,
    "lim": 1,
    "andlim": 1,
    "historically": 1,
    "logistic": 5,
    "exp": 6,
    "hyperbolictangent": 1,
    "funahashi": 2,
    "estab": 1,
    "lishe": 1,
    "sthat": 2,
    "nnmod": 1,
    "elsas": 1,
    "toany": 1,
    "desir": 1,
    "eddeg": 1,
    "reeof": 1,
    "acy": 1,
    "providedthat": 1,
    "issufficientlylarge": 1,
    "cybenko": 3,
    "andhornik": 1,
    "surab": 1,
    "lefun": 1,
    "andho": 1,
    "rnike": 1,
    "tal": 1,
    "barron": 2,
    "stinchcombe": 2,
    "sandberg": 2,
    "derived": 2,
    "same": 2,
    "andhorniketal": 1,
    "moid": 1,
    "thel": 1,
    "ater": 1,
    "focu": 1,
    "sedo": 1,
    "nrad": 1,
    "ial": 1,
    "basisfunctions": 1,
    "rbf": 1,
    "definedas": 1,
    "radialbasis": 1,
    "yarotsky": 2,
    "relu": 1,
    "rectifiedlinearunit": 1,
    "max": 1,
    "areal": 2,
    "souni": 1,
    "versa": 1,
    "lappr": 1,
    "oxima": 1,
    "tors": 1,
    "canbe": 1,
    "writt": 1,
    "eninm": 1,
    "atrix": 1,
    "notat": 1,
    "bydefining": 1,
    "andcan": 1,
    "argmin": 2,
    "isunfeasible": 1,
    "whereusually": 1,
    "traditionally": 1,
    "istouse": 1,
    "bayes": 1,
    "ianme": 1,
    "thods": 2,
    "asinm": 1,
    "ackay": 1,
    "mackay": 3,
    "andforeseeandhagan": 1,
    "amore": 1,
    "dropout": 1,
    "srivastavaetal": 1,
    "along": 1,
    "witht": 1,
    "heirc": 1,
    "onnec": 1,
    "fromthennduring": 1,
    "annnwith": 1,
    "possible": 2,
    "thinned": 1,
    "byjus": 1,
    "tremo": 1,
    "vings": 1,
    "omene": 1,
    "urons": 1,
    "dropoutsamplesfromthis": 1,
    "diffe": 2,
    "rentt": 1,
    "hinne": 1,
    "dnnan": 1,
    "dtrai": 1,
    "samplednn": 1,
    "topre": 1,
    "dictt": 1,
    "hetar": 1,
    "getva": 1,
    "riabl": 1,
    "wemodifyequation": 1,
    "insteadof": 1,
    "foreachtrainingexample": 1,
    "thev": 1,
    "alue": 1,
    "soft": 1,
    "heen": 1,
    "trie": 1,
    "thefinalestimatesfor": 1,
    "aremultipliedby": 1,
    "wheremorehiddenlayers": 1,
    "inthefigure": 1,
    "werepresentadeepnnwith": 1,
    "thenumberofhidden": 1,
    "neuro": 1,
    "nscan": 1,
    "varya": 1,
    "cross": 1,
    "deepn": 1,
    "eural": 1,
    "netwo": 1,
    "rkarc": 1,
    "hitec": 1,
    "ture": 1,
    "aspo": 2,
    "inte": 2,
    "dout": 2,
    "inmh": 1,
    "aska": 1,
    "shallownns": 1,
    "units": 1,
    "define": 2,
    "then": 4,
    "theoutput": 1,
    "oflayer": 1,
    "isgivenrecursivelyby": 1,
    "urre": 1,
    "ntne": 2,
    "ural": 2,
    "netw": 2,
    "orks": 2,
    "broadlyspeaking": 1,
    "rnnscanuse": 1,
    "theirinternalstate": 1,
    "memory": 3,
    "topro": 1,
    "cesss": 1,
    "cesof": 1,
    "frame": 2,
    "workc": 1,
    "onsid": 1,
    "eredi": 1,
    "nthis": 1,
    "agene": 1,
    "ricrn": 1,
    "ncoul": 1,
    "dbewr": 1,
    "itten": 1,
    "architectureofthelong": 1,
    "short": 2,
    "termmemorycell": 1,
    "lstm": 4,
    "isthepredictionof": 1,
    "hgive": 1,
    "nobse": 1,
    "rvati": 1,
    "onson": 1,
    "lyupt": 1,
    "otime": 1,
    "arefunctions": 1,
    "tobedefined": 1,
    "iswhatwecallthe": 1,
    "state": 3,
    "fromatime": 1,
    "seriesperspective": 1,
    "rnnscan": 1,
    "besee": 1,
    "nasak": 1,
    "indof": 1,
    "nonli": 1,
    "nears": 1,
    "tate": 1,
    "spacemodel": 1,
    "previousones": 1,
    "asintime": 1,
    "seriesmodels": 3,
    "fromthevanishing": 1,
    "expl": 1,
    "odin": 1,
    "ggra": 1,
    "dien": 2,
    "tpro": 1,
    "blem": 1,
    "setthecostfunctiontobe": 1,
    "itise": 1,
    "asyto": 1,
    "showt": 1,
    "hatth": 1,
    "egrad": 1,
    "ient": 1,
    "beverysmallordiverge": 1,
    "fortunately": 1,
    "andschmidhuber": 1,
    "avari": 1,
    "antof": 1,
    "rnnwh": 1,
    "ichis": 1,
    "calle": 1,
    "dlong": 1,
    "termmemory": 2,
    "anlst": 1,
    "mnetw": 1,
    "orkca": 1,
    "nbeco": 1,
    "mpose": 1,
    "several": 2,
    "red": 1,
    "circles": 1,
    "indicate": 1,
    "activation": 1,
    "while": 2,
    "blue": 1,
    "cir": 1,
    "thesymbols": 1,
    "mathematically": 1,
    "initiatewith": 1,
    "giventheinput": 1,
    "tanh": 1,
    "arepa": 1,
    "ersto": 1,
    "beest": 1,
    "imate": 1,
    "informationflowinan": 1,
    "ltsmcell": 1,
    "colo": 1,
    "urfi": 1,
    "gure": 1,
    "canb": 1,
    "evie": 1,
    "wed": 1,
    "atwileyonlinelibrary": 1,
    "element": 1,
    "cell": 2,
    "forget": 1,
    "ouput": 1,
    "gates": 1,
    "introduces": 1,
    "bit": 1,
    "so": 1,
    "remember": 1,
    "past": 2,
    "learns": 1,
    "keep": 1,
    "only": 4,
    "information": 2,
    "makepredictions": 1,
    "andf": 1,
    "orge": 1,
    "tnon": 1,
    "rele": 1,
    "vant": 1,
    "awayfromthecellstate": 1,
    "blockattime": 1,
    "thedi": 1,
    "mensi": 1,
    "onoft": 1,
    "hehid": 1,
    "denst": 1,
    "isass": 1,
    "ociat": 1,
    "edwit": 1,
    "hthen": 1,
    "umber": 1,
    "hiddenneurons": 1,
    "repr": 1,
    "esen": 1,
    "tsth": 1,
    "eout": 1,
    "puto": 1,
    "fthe": 1,
    "forgetgate": 1,
    "withthenewinfor": 1,
    "notethat": 1,
    "theinputand": 1,
    "funct": 1,
    "tofil": 1,
    "terth": 1,
    "informationfrom": 1,
    "previous": 2,
    "signal": 1,
    "will": 1,
    "combined": 2,
    "output": 1,
    "gate": 1,
    "strat": 1,
    "eshow": 1,
    "thein": 1,
    "forma": 1,
    "flowsinanlstmcell": 1,
    "exampleofasimpletree": 1,
    "local": 2,
    "predictions": 1,
    "using": 7,
    "recursive": 1,
    "partitioning": 1,
    "may": 1,
    "represented": 1,
    "graph": 1,
    "left": 1,
    "side": 1,
    "equivalent": 2,
    "supposethat": 1,
    "want": 1,
    "predict": 2,
    "scores": 1,
    "basketball": 1,
    "height": 1,
    "weight": 1,
    "romt": 1,
    "hesh": 1,
    "orte": 1,
    "rpla": 1,
    "yers": 1,
    "togrowatree": 1,
    "anoptimalobservation": 1,
    "inthesameexample": 1,
    "expression": 1,
    "approximation": 2,
    "linearregressionon": 1,
    "dummyvariables": 1,
    "isapr": 1,
    "oduct": 1,
    "ofind": 1,
    "icato": 1,
    "rfunc": 1,
    "umbe": 1,
    "roft": 1,
    "ermi": 2,
    "naln": 2,
    "odes": 2,
    "regions": 1,
    "leaves": 1,
    "parentnodes": 1,
    "rentr": 1,
    "egion": 1,
    "sared": 1,
    "enote": 1,
    "das": 1,
    "theparent": 2,
    "nodeatposition": 1,
    "hastwosplit": 1,
    "child": 1,
    "nodesatpositions": 1,
    "eachparentnodehas": 1,
    "athreshold": 1,
    "split": 1,
    "variableassociated": 1,
    "asthesets": 1,
    "ofpa": 1,
    "rent": 2,
    "andt": 1,
    "intheexample": 1,
    "exam": 1,
    "pleo": 1,
    "ftre": 1,
    "ewit": 1,
    "hlab": 1,
    "nodesare": 1,
    "andtheterminalnodesare": 1,
    "does": 1,
    "noti": 1,
    "nclu": 1,
    "depa": 1,
    "node": 1,
    "includethe": 2,
    "childofparentnode": 2,
    "indexes": 1,
    "parent": 1,
    "nodes": 1,
    "path": 1,
    "leaf": 1,
    "rf": 3,
    "specified": 1,
    "bootstrap": 1,
    "original": 2,
    "useablockbootstrap": 1,
    "supposethereare": 1,
    "bootstrapsamples": 1,
    "foreachsample": 1,
    "treewith": 1,
    "thefinalforecast": 1,
    "initialize": 1,
    "make": 2,
    "growa": 1,
    "small": 4,
    "treemodeltofit": 1,
    "update": 1,
    "randomvariables": 1,
    "scornetetal": 1,
    "totheunknownfunction": 1,
    "wagerandathey": 1,
    "provedconsistencyand": 1,
    "stin": 2,
    "greg": 1,
    "iont": 1,
    "rees": 1,
    "another": 2,
    "greedy": 1,
    "approximate": 2,
    "uses": 1,
    "learners": 1,
    "foras": 1,
    "tiala": 1,
    "pprox": 2,
    "themodelweconsiderhere": 1,
    "calledgradientboosting": 1,
    "wasintro": 1,
    "ducedbyfriedman": 1,
    "forregressionproblems": 1,
    "duffyandhelmbold": 1,
    "derivedboundsonthe": 1,
    "zhangandyu": 2,
    "proveconvergence": 1,
    "bhlmann": 5,
    "thecaseof": 1,
    "demonstrated": 1,
    "stopping": 2,
    "related": 1,
    "sizes": 1,
    "suggested": 1,
    "friedman": 4,
    "jiang": 2,
    "lugosiandvayatis": 1,
    "bartlettandtraskin": 1,
    "andbhlmann": 1,
    "boost": 2,
    "ingis": 1,
    "anite": 1,
    "rativ": 1,
    "ealgo": 1,
    "rithm": 1,
    "theid": 1,
    "eaofb": 1,
    "ooste": 1,
    "dtree": 1,
    "sisto": 1,
    "ateachiteration": 1,
    "sequentially": 1,
    "thispaper": 1,
    "itisrecommended": 1,
    "tous": 1,
    "eash": 1,
    "rink": 1,
    "agep": 1,
    "eter": 2,
    "isclose": 1,
    "faster": 1,
    "convergence": 2,
    "rate": 1,
    "better": 1,
    "fit": 1,
    "likely": 1,
    "sampleresults": 1,
    "inaddition": 1,
    "thederivativeishighly": 1,
    "affectedbyoverfitting": 1,
    "evenifwelookatin": 1,
    "sampleestimates": 1,
    "medeirosandveiga": 1,
    "andsuarez": 1,
    "andinterpretparticu": 1,
    "asforexample": 1,
    "generalformsofsmooth": 1,
    "transition": 2,
    "restricts": 1,
    "specificsettings": 1,
    "analternative": 1,
    "asdescribedearlier": 1,
    "thisi": 1,
    "sthec": 1,
    "aseof": 1,
    "splin": 1,
    "esand": 1,
    "feed": 1,
    "forwardnns": 1,
    "inthissetup": 1,
    "chenandshen": 2,
    "andchen": 4,
    "under": 1,
    "regul": 2,
    "arity": 1,
    "condi": 1,
    "theconsistencyand": 1,
    "theirsetup": 1,
    "isdefinedasfollows": 1,
    "componentsofthemodel": 1,
    "isfixed": 1,
    "chernozhukovetal": 1,
    "theasymptoticresults": 1,
    "inchenandshen": 1,
    "inscornetetal": 1,
    "andw": 2,
    "ageretal": 1,
    "forthecaseofiiddata": 1,
    "davisand": 1,
    "nielsen": 3,
    "stochastic": 1,
    "prove": 1,
    "class": 1,
    "worth": 1,
    "mentioning": 1,
    "interesting": 1,
    "borup": 4,
    "baggingfortime": 2,
    "arrangethesetoftuples": 1,
    "intheformofamatrix": 1,
    "ofdimension": 1,
    "block": 1,
    "boots": 1,
    "traps": 1,
    "ample": 2,
    "softh": 1,
    "eform": 1,
    "bydrawing": 1,
    "blocksof": 1,
    "rowsof": 1,
    "withreplacement": 1,
    "computethe": 1,
    "thbootstrapforecastas": 1,
    "otherwise": 1,
    "isadi": 1,
    "agona": 1,
    "lsele": 2,
    "matri": 1,
    "xwith": 1,
    "thdi": 1,
    "agon": 1,
    "alel": 1,
    "tgiv": 1,
    "enby": 1,
    "serie": 4,
    "smode": 3,
    "lsand": 2,
    "manyr": 1,
    "sors": 1,
    "aria": 1,
    "tere": 1,
    "sion": 1,
    "honeachcovariatein": 1,
    "compute": 1,
    "andke": 1,
    "eponl": 1,
    "ytheo": 1,
    "nes": 1,
    "callt": 1,
    "hisne": 1,
    "wseto": 1,
    "sameasbeforebutwith": 1,
    "replacedby": 1,
    "aspr": 1,
    "opos": 1,
    "edby": 1,
    "toreducethe": 1,
    "varia": 2,
    "nceof": 1,
    "unsta": 1,
    "blepr": 1,
    "ors": 1,
    "spopu": 1,
    "lariz": 1,
    "edint": 1,
    "hetim": 1,
    "slite": 1,
    "ratur": 1,
    "ebyin": 1,
    "ouean": 1,
    "dkil": 1,
    "ian": 1,
    "zeroregres": 1,
    "tothesamplesize": 1,
    "theba": 1,
    "gging": 1,
    "algor": 1,
    "ithmi": 1,
    "inalgorithm": 1,
    "requires": 1,
    "modified": 2,
    "garcia": 3,
    "themotivation": 1,
    "optimal": 1,
    "hby": 1,
    "testing": 1,
    "combinations": 1,
    "inmostcases": 1,
    "unfeasible": 1,
    "foragivenset": 1,
    "ofpot": 1,
    "entia": 1,
    "lpred": 1,
    "ictor": 1,
    "bles": 1,
    "possiblepredictors": 1,
    "euniv": 1,
    "ariat": 1,
    "emode": 1,
    "variatemodelsfor": 1,
    "tofmo": 1,
    "delsf": 1,
    "orafi": 1,
    "xedva": 1,
    "lueof": 1,
    "asisknownasthe": 1,
    "completesubset": 1,
    "increases": 1,
    "rapidly": 1,
    "moreover": 1,
    "inthesecases": 1,
    "itwassuggested": 1,
    "should": 3,
    "still": 1,
    "andmedeirosetal": 2,
    "dimensionalmodels": 3,
    "theideaistostart": 1,
    "fitting": 1,
    "hon": 1,
    "candidate": 1,
    "save": 1,
    "statistics": 6,
    "variable": 2,
    "andweselectthe": 1,
    "variablesthataremore": 1,
    "relevantintheranking": 1,
    "extended": 1,
    "todependentbyyousuf": 1,
    "largeset": 1,
    "propo": 2,
    "sedth": 1,
    "ecomb": 1,
    "inati": 1,
    "onofl": 1,
    "basedestimationand": 1,
    "nnmodels": 1,
    "thenonlinearterms": 1,
    "orone": 1,
    "ofits": 1,
    "gener": 1,
    "aliza": 1,
    "traplettietal": 1,
    "motivation": 1,
    "component": 1,
    "capture": 2,
    "dependence": 2,
    "making": 1,
    "interpretable": 1,
    "spirit": 1,
    "semi": 3,
    "inspired": 1,
    "ideas": 1,
    "combining": 1,
    "adalassoandols": 1,
    "inthefirstone": 1,
    "calledrf": 1,
    "idea": 1,
    "selected": 1,
    "forest": 3,
    "second": 1,
    "works": 2,
    "opposite": 1,
    "direction": 1,
    "select": 1,
    "dieboldandshin": 1,
    "proposethe": 1,
    "partially": 2,
    "egalitarian": 2,
    "lassotocombinesur": 1,
    "veyforecasts": 1,
    "thesu": 1,
    "rvivo": 1,
    "rstow": 1,
    "ardeq": 1,
    "age": 1,
    "combination": 1,
    "survived": 1,
    "forecasts": 2,
    "considers": 1,
    "byth": 1,
    "eaut": 1,
    "hors": 1,
    "optimally": 1,
    "regularizedregression": 1,
    "combi": 1,
    "natio": 2,
    "nsand": 2,
    "subse": 1,
    "avera": 1,
    "gecom": 1,
    "binat": 1,
    "ionsa": 1,
    "rever": 1,
    "closelyconnected": 1,
    "dieboldetal": 1,
    "eidea": 1,
    "sindi": 1,
    "ebold": 1,
    "inordertocon": 1,
    "haveb": 1,
    "eenin": 1,
    "creas": 1,
    "ingat": 1,
    "afast": 1,
    "pace": 1,
    "consequently": 1,
    "comparedifferentmodels": 1,
    "pape": 1,
    "rbyd": 1,
    "iebo": 1,
    "ldan": 1,
    "dmar": 1,
    "iano": 1,
    "inthedieboldandmariano": 1,
    "seeal": 1,
    "sothe": 1,
    "recen": 1,
    "tdisc": 1,
    "ussio": 1,
    "nin": 1,
    "diebold": 6,
    "testi": 1,
    "itsst": 1,
    "atist": 2,
    "icdiv": 1,
    "erges": 1,
    "giacominiandwhite": 1,
    "mccracken": 2,
    "thedieboldand": 1,
    "mariano": 3,
    "itisv": 1,
    "eryim": 1,
    "porta": 1,
    "nttha": 1,
    "tthef": 1,
    "ore": 1,
    "anuncondi": 1,
    "uspa": 1,
    "testwasproposedbywhite": 1,
    "thenullhypothesis": 1,
    "hansen": 7,
    "showedthatwhite": 1,
    "ature": 1,
    "mcs": 2,
    "ofthedataset": 1,
    "whereas": 1,
    "importantly": 1,
    "themcsproceduredoesnot": 1,
    "cepa": 1,
    "inpr": 1,
    "acti": 1,
    "cala": 1,
    "ppli": 1,
    "cati": 1,
    "itisimpor": 1,
    "conduct": 1,
    "predictive": 1,
    "abilitytests": 1,
    "insummary": 1,
    "financialforecasting": 1,
    "thereis": 1,
    "macroeconomic": 4,
    "certainly": 1,
    "successful": 1,
    "applications": 2,
    "inflationand": 2,
    "medeirosand": 1,
    "vasconcelos": 4,
    "showthathigh": 1,
    "lline": 1,
    "armod": 1,
    "elspr": 1,
    "oduce": 1,
    "onaverage": 1,
    "smallerfore": 1,
    "casting": 2,
    "econometric": 2,
    "shrinkage": 2,
    "csr": 1,
    "perform": 1,
    "real": 3,
    "brazilian": 1,
    "inflation": 2,
    "environ": 1,
    "consideranapplication": 1,
    "toalargemacroeconomicu": 1,
    "petitive": 1,
    "medeirosetal": 2,
    "includingfactormod": 1,
    "ardia": 2,
    "introduce": 1,
    "text": 1,
    "sentiment": 1,
    "optimizes": 1,
    "purposes": 1,
    "apply": 1,
    "economic": 2,
    "growth": 3,
    "united": 3,
    "sandsofsentimentvalues": 1,
    "tarassow": 2,
    "monthly": 2,
    "uematsu": 2,
    "tanaka": 2,
    "conca": 1,
    "vepen": 1,
    "alize": 1,
    "dregr": 1,
    "essio": 1,
    "ns": 1,
    "theauthorsforecast": 1,
    "quarterly": 1,
    "gross": 1,
    "domestic": 1,
    "product": 1,
    "mixeddatasampling": 1,
    "midas": 1,
    "workw": 1,
    "ithpe": 1,
    "seealsobabiietal": 1,
    "findthatcom": 1,
    "audrinoandknaus": 1,
    "usedlasso": 1,
    "volatilities": 1,
    "callotetal": 1,
    "varianceinvestor": 1,
    "chincoetal": 1,
    "minute": 1,
    "ahea": 1,
    "dret": 1,
    "urnf": 1,
    "orec": 2,
    "asts": 2,
    "provi": 1,
    "deevi": 1,
    "dence": 1,
    "respect": 1,
    "were": 1,
    "atbest": 1,
    "forexam": 1,
    "ple": 1,
    "references": 2,
    "therein": 1,
    "majority": 1,
    "tersvirtaetal": 1,
    "andwhite": 1,
    "balkinandord": 1,
    "tkacz": 2,
    "heravietal": 1,
    "despite": 1,
    "skepticism": 1,
    "systematically": 1,
    "accurate": 1,
    "benchmarks": 1,
    "horizons": 1,
    "dominated": 1,
    "other": 2,
    "due": 1,
    "its": 2,
    "but": 1,
    "potential": 1,
    "nonlinearities": 1,
    "key": 1,
    "succe": 1,
    "ssful": 1,
    "examp": 1,
    "leisg": 1,
    "uetal": 1,
    "theauthors": 1,
    "largesetofpredictors": 1,
    "thebe": 1,
    "stper": 1,
    "formi": 1,
    "ngmod": 1,
    "elsar": 1,
    "etree": 1,
    "basedandneuralnetworks": 1,
    "coulombe": 2,
    "ensemble": 1,
    "forecast": 1,
    "employment": 1,
    "period": 2,
    "googl": 1,
    "esear": 1,
    "chact": 1,
    "ivity": 1,
    "tivepower": 1,
    "borupetal": 1,
    "computenow": 1,
    "volumedataandmachine": 1,
    "learningmethods": 1,
    "bovespa": 1,
    "weus": 1,
    "easr": 1,
    "egre": 1,
    "ssor": 1,
    "sinf": 1,
    "orma": 1,
    "romot": 1,
    "herma": 1,
    "jorin": 1,
    "dexes": 1,
    "namely": 2,
    "thes": 3,
    "us": 1,
    "unitedkingdom": 1,
    "dax": 1,
    "germany": 1,
    "hangseng": 1,
    "hongkong": 1,
    "andnikkei": 1,
    "japan": 1,
    "minfrequency": 1,
    "thedatawereobtained": 1,
    "fromtheoxford": 1,
    "foreachstockindex": 1,
    "wedef": 1,
    "ineth": 1,
    "ereal": 1,
    "izedv": 1,
    "arian": 1,
    "ceas": 1,
    "logre": 1,
    "turns": 1,
    "datth": 1,
    "frequency": 1,
    "numbe": 1,
    "rofav": 1,
    "ailab": 1,
    "leret": 1,
    "urns": 1,
    "atday": 1,
    "benchmark": 2,
    "heterogeneous": 1,
    "har": 4,
    "corsi": 2,
    "log": 1,
    "asalternatives": 1,
    "sideredhere": 1,
    "weconsidertwo": 1,
    "thedatastartinfebru": 1,
    "atot": 1,
    "alof": 1,
    "obse": 1,
    "rvat": 1,
    "ions": 1,
    "ampl": 1,
    "einc": 1,
    "lude": 1,
    "stwo": 1,
    "peri": 1,
    "odso": 1,
    "fver": 1,
    "yhig": 1,
    "hvol": 1,
    "atil": 1,
    "thef": 1,
    "inan": 1,
    "cial": 1,
    "cris": 1,
    "isof": 1,
    "smooth": 1,
    "version": 1,
    "hille": 1,
    "brandandmedeiros": 1,
    "longmemory": 1,
    "hillebrand": 3,
    "table": 3,
    "forecastingresults": 1,
    "fullsample": 1,
    "qlike": 4,
    "harx": 1,
    "randomforest": 1,
    "neuralnetwork": 3,
    "reports": 1,
    "mean": 1,
    "squared": 1,
    "ratio": 3,
    "generalizations": 1,
    "extensions": 1,
    "sedby": 1,
    "audri": 1,
    "noand": 1,
    "knaus": 2,
    "werep": 1,
    "ortth": 1,
    "eresu": 1,
    "ltsin": 1,
    "level": 1,
    "whichinthe": 1,
    "endis": 1,
    "thequ": 1,
    "antit": 1,
    "yofin": 1,
    "teres": 1,
    "ric": 1,
    "aresh": 1,
    "ownin": 1,
    "theta": 1,
    "blere": 1,
    "ports": 1,
    "forea": 1,
    "chmod": 1,
    "el": 1,
    "themseandtheqlike": 1,
    "performsthehar": 1,
    "marianotestofequalfore": 1,
    "castingperformance": 1,
    "report": 1,
    "full": 1,
    "out": 1,
    "financial": 1,
    "crisis": 1,
    "way": 1,
    "effects": 1,
    "covid": 1,
    "pan": 1,
    "aswe": 1,
    "cans": 1,
    "eefr": 1,
    "omth": 1,
    "etab": 1,
    "les": 1,
    "mark": 1,
    "withadalasso": 1,
    "duringthecovid": 1,
    "rfsdonotperformwell": 1,
    "ontheotherhand": 1,
    "nnmodelswith": 1,
    "lusio": 1,
    "thero": 1,
    "adahe": 1,
    "ad": 1,
    "andhigh": 1,
    "lstat": 1,
    "istic": 1,
    "stoti": 1,
    "me": 1,
    "linga": 1,
    "ndfor": 1,
    "wepresentedbothlinear": 1,
    "andn": 1,
    "onli": 1,
    "near": 1,
    "alte": 1,
    "rnat": 1,
    "ives": 1,
    "anditsgeneralizations": 1,
    "andensemblemethods": 1,
    "baggingandcsr": 1,
    "dependentdata": 1,
    "wefocusedonnnsandtree": 1,
    "basedmethods": 1,
    "theoret": 1,
    "lseto": 1,
    "forshallownns": 1,
    "chenetal": 1,
    "provide": 1,
    "theoretical": 1,
    "behavior": 1,
    "amei": 1,
    "stru": 1,
    "efor": 1,
    "asymptotic": 1,
    "normality": 1,
    "thed": 1,
    "ataa": 1,
    "rede": 1,
    "pend": 1,
    "ent": 1,
    "suchastextdata": 1,
    "toeconomicforecasting": 1,
    "ateml": 1,
    "sforn": 1,
    "owcas": 1,
    "support": 1,
    "autoenconders": 1,
    "factor": 1,
    "andmanymore": 1,
    "orfinancialforecasting": 1,
    "acknowledgments": 1,
