{
    "special": 4,
    "issue": 1,
    "forecasting": 17,
    "ricardop": 1,
    "mede": 6,
    "iros": 6,
    "ardo": 1,
    "learning": 8,
    "prin": 2,
    "ceto": 2,
    "nuni": 2,
    "vers": 2,
    "ity": 4,
    "usa": 1,
    "getulio": 2,
    "varg": 2,
    "asfo": 2,
    "unda": 2,
    "tion": 25,
    "brazil": 4,
    "artm": 1,
    "ento": 1,
    "feco": 8,
    "nomi": 4,
    "cs": 12,
    "pontifical": 1,
    "correspondence": 1,
    "marceloc": 2,
    "medeiros": 28,
    "pont": 1,
    "ific": 5,
    "alca": 1,
    "thol": 1,
    "ic": 2,
    "univ": 3,
    "ersi": 2,
    "tyof": 2,
    "riod": 1,
    "ejan": 1,
    "eiro": 1,
    "ruamarqu\u00eas": 1,
    "des\u00e3ovicente": 1,
    "g\u00e1vea": 1,
    "riodejaneiro": 1,
    "rj": 1,
    "email": 1,
    "mcm": 1,
    "econ": 14,
    "puc": 1,
    "rio": 1,
    "br": 1,
    "fund": 1,
    "ingi": 3,
    "nfor": 1,
    "mati": 2,
    "cnpqandcapes": 1,
    "cons": 4,
    "elho": 1,
    "naci": 1,
    "onal": 3,
    "de": 2,
    "this": 12,
    "paper": 6,
    "survey": 3,
    "most": 8,
    "recent": 2,
    "advances": 1,
    "supervised": 3,
    "machine": 5,
    "ml": 7,
    "high": 18,
    "dimensional": 15,
    "models": 26,
    "time": 16,
    "series": 12,
    "among": 2,
    "linear": 7,
    "methods": 8,
    "pay": 2,
    "attention": 2,
    "penal": 2,
    "thenonlinear": 1,
    "considered": 4,
    "include": 2,
    "shallow": 2,
    "deep": 5,
    "neural": 9,
    "networks": 5,
    "their": 5,
    "feedforward": 2,
    "recurrent": 1,
    "versions": 2,
    "tree": 5,
    "based": 2,
    "such": 6,
    "random": 7,
    "forests": 5,
    "boosted": 1,
    "trees": 4,
    "also": 8,
    "consider": 7,
    "fromd": 1,
    "iffer": 1,
    "ental": 1,
    "terna": 1,
    "tives": 1,
    "ability": 2,
    "briefly": 1,
    "reviewed": 1,
    "finally": 10,
    "discuss": 2,
    "appli": 1,
    "illu": 1,
    "stra": 2,
    "with": 34,
    "freq": 1,
    "uenc": 1,
    "yfin": 1,
    "anci": 1,
    "alda": 1,
    "ta": 2,
    "keywords": 1,
    "bagging": 2,
    "boosting": 4,
    "nonlinear": 8,
    "penalized": 6,
    "regressions": 8,
    "ran": 1,
    "domforests": 1,
    "regressiontrees": 1,
    "regularization": 2,
    "siev": 1,
    "eapp": 1,
    "roxi": 1,
    "stati": 2,
    "stica": 1,
    "llear": 1,
    "ningt": 1,
    "heory": 1,
    "jel": 1,
    "classification": 1,
    "meth": 1,
    "odst": 1,
    "oeco": 2,
    "cand": 1,
    "financialtime": 1,
    "seri": 10,
    "esfo": 2,
    "reca": 6,
    "stin": 7,
    "modelselec": 1,
    "thea": 7,
    "vail": 1,
    "abil": 3,
    "sonsltd": 1,
    "jeconsurv": 2,
    "wile": 4,
    "yonl": 4,
    "inel": 4,
    "ibra": 4,
    "ry": 4,
    "com": 78,
    "journal": 6,
    "joes": 37,
    "masinietal": 36,
    "ofva": 1,
    "stda": 1,
    "tase": 1,
    "tsin": 1,
    "thee": 1,
    "raof": 1,
    "bigdata": 1,
    "tance": 1,
    "however": 15,
    "whatisml": 1,
    "last": 1,
    "few": 1,
    "years": 2,
    "there": 8,
    "myriad": 1,
    "definitions": 1,
    "literature": 4,
    "one": 5,
    "well": 5,
    "samu": 1,
    "elwh": 1,
    "odef": 1,
    "ines": 2,
    "mlas": 1,
    "powerful": 1,
    "statistical": 5,
    "learn": 2,
    "discover": 1,
    "hidden": 6,
    "patterns": 1,
    "rich": 3,
    "data": 13,
    "sets": 4,
    "that": 22,
    "sense": 2,
    "theory": 3,
    "gives": 1,
    "foundation": 1,
    "therefore": 11,
    "about": 1,
    "developments": 1,
    "not": 3,
    "general": 3,
    "going": 1,
    "focus": 2,
    "stat": 15,
    "isti": 14,
    "calm": 2,
    "odel": 9,
    "unsupervised": 1,
    "andr": 1,
    "einf": 2,
    "orce": 1,
    "ment": 3,
    "lear": 2,
    "ning": 1,
    "wher": 7,
    "ethe": 3,
    "task": 1,
    "isto": 1,
    "afun": 1,
    "ctio": 7,
    "ntha": 1,
    "tmap": 1,
    "sani": 1,
    "nput": 2,
    "expl": 2,
    "anat": 1,
    "oryv": 1,
    "aria": 4,
    "bles": 1,
    "toanoutput": 1,
    "depe": 2,
    "nden": 1,
    "tvar": 1,
    "iabl": 1,
    "basedon": 1,
    "orga": 1,
    "nize": 1,
    "dasi": 1,
    "outputpairs": 1,
    "regr": 5,
    "essi": 3,
    "onmo": 1,
    "dels": 5,
    "forexample": 9,
    "belo": 1,
    "ngto": 1,
    "clas": 1,
    "onthe": 1,
    "otherhand": 1,
    "inre": 2,
    "info": 2,
    "rcem": 1,
    "entl": 1,
    "earn": 1,
    "ing": 5,
    "players": 2,
    "alfago": 1,
    "forinstance": 6,
    "like": 1,
    "band": 1,
    "itpr": 1,
    "oble": 1,
    "ms": 1,
    "presented": 3,
    "here": 2,
    "roughly": 1,
    "divided": 1,
    "two": 2,
    "groups": 2,
    "first": 4,
    "mate": 3,
    "dbyr": 1,
    "egul": 2,
    "ariz": 2,
    "atio": 12,
    "know": 2,
    "nass": 1,
    "hrin": 1,
    "kage": 1,
    "papers": 4,
    "by": 89,
    "willard": 1,
    "james": 3,
    "charles": 1,
    "stein": 4,
    "who": 1,
    "popularized": 1,
    "bias": 1,
    "variance": 1,
    "trade": 2,
    "off": 2,
    "sta": 1,
    "tistical": 1,
    "estimation": 12,
    "start": 1,
    "considering": 1,
    "ridge": 3,
    "regres": 2,
    "afterthat": 1,
    "wepre": 1,
    "sentt": 1,
    "helea": 1,
    "stabs": 1,
    "olute": 1,
    "shri": 2,
    "nkag": 2,
    "eand": 1,
    "sele": 3,
    "lasso": 20,
    "esti": 6,
    "mato": 4,
    "roft": 2,
    "ibsh": 1,
    "iran": 1,
    "andi": 4,
    "tsma": 1,
    "nyex": 1,
    "tens": 1,
    "ions": 5,
    "wealso": 1,
    "arealsoreviewed": 1,
    "weco": 2,
    "vert": 2,
    "hist": 1,
    "opic": 1,
    "inse": 1,
    "grenander": 2,
    "continue": 1,
    "analyzing": 1,
    "specific": 2,
    "cases": 1,
    "our": 1,
    "gen": 1,
    "eralsetup": 1,
    "more": 8,
    "spec": 4,
    "ally": 3,
    "nns": 2,
    "both": 1,
    "inth": 5,
    "eirs": 1,
    "hall": 1,
    "ow": 1,
    "rnns": 1,
    "andtree": 1,
    "base": 5,
    "dmod": 1,
    "elss": 1,
    "ucha": 2,
    "sran": 1,
    "dom": 1,
    "rfs": 1,
    "andboostedtrees": 1,
    "thesuc": 1,
    "cess": 1,
    "ispa": 1,
    "rtly": 1,
    "duet": 1,
    "othe": 3,
    "inouropinion": 1,
    "contrary": 1,
    "what": 1,
    "been": 1,
    "boasted": 1,
    "early": 3,
    "empirical": 2,
    "success": 1,
    "nn": 7,
    "metric": 1,
    "basedmeth": 1,
    "odss": 1,
    "sbag": 1,
    "ging": 1,
    "brei": 2,
    "man": 3,
    "crs": 1,
    "elliottetal": 2,
    "furthermore": 4,
    "hybridmethods": 1,
    "whereideas": 1,
    "downloaded": 35,
    "from": 44,
    "https": 72,
    "onlinelibrary": 70,
    "wiley": 141,
    "doi": 36,
    "higher": 35,
    "education": 35,
    "commission": 35,
    "online": 70,
    "library": 70,
    "see": 39,
    "terms": 73,
    "conditions": 72,
    "rules": 36,
    "use": 37,
    "oa": 35,
    "articles": 35,
    "governed": 35,
    "applicable": 35,
    "creative": 35,
    "commons": 35,
    "license": 35,
    "eral": 1,
    "fram": 1,
    "ewor": 1,
    "aqui": 1,
    "ckwo": 1,
    "rdon": 1,
    "nota": 1,
    "anup": 1,
    "perc": 1,
    "asel": 1,
    "ette": 3,
    "rasi": 1,
    "lowercaseletter": 1,
    "nonrandom": 1,
    "quantity": 1,
    "boldlettersasin": 1,
    "thesymbol": 1,
    "denotesthe": 1,
    "normofavector": 1,
    "foraset": 1,
    "weuse": 1,
    "tode": 2,
    "note": 3,
    "itsc": 1,
    "ardi": 1,
    "nali": 2,
    "ty": 4,
    "give": 1,
    "nasa": 1,
    "mple": 4,
    "theg": 2,
    "oali": 2,
    "stop": 1,
    "redi": 6,
    "ct": 1,
    "forhorizonsh": 1,
    "thro": 1,
    "ugho": 1,
    "utth": 1,
    "epap": 2,
    "er": 3,
    "assumption": 1,
    "generating": 1,
    "process": 1,
    "dgp": 1,
    "let": 7,
    "covariance": 1,
    "stationary": 1,
    "excluding": 1,
    "important": 2,
    "nonstationary": 1,
    "processes": 2,
    "usually": 5,
    "appear": 1,
    "esap": 1,
    "plic": 2,
    "ns": 4,
    "inparticular": 2,
    "memo": 2,
    "rypr": 1,
    "oces": 2,
    "sare": 1,
    "excl": 1,
    "uded": 1,
    "byassumption": 1,
    "usua": 1,
    "llyp": 1,
    "rede": 2,
    "term": 4,
    "ined": 1,
    "integers": 1,
    "definethe": 1,
    "dime": 14,
    "nsio": 14,
    "nalv": 1,
    "ecto": 2,
    "rofp": 2,
    "re": 6,
    "dictors": 1,
    "where": 25,
    "following": 1,
    "dire": 1,
    "ctfo": 1,
    "gmod": 1,
    "el": 1,
    "ris": 1,
    "an": 8,
    "unknown": 2,
    "measurable": 1,
    "function": 2,
    "themodel": 1,
    "orsim": 1,
    "hont": 1,
    "spac": 3,
    "espa": 1,
    "nned": 1,
    "ourt": 1,
    "arge": 5,
    "tbec": 1,
    "omes": 1,
    "forh": 1,
    "hisunknown": 1,
    "targetfunction": 1,
    "given": 2,
    "estimate": 2,
    "hfor": 3,
    "next": 1,
    "step": 4,
    "evaluate": 1,
    "method": 4,
    "estimat": 1,
    "tspr": 1,
    "edic": 2,
    "accu": 1,
    "racy": 2,
    "tity": 1,
    "theterm": 1,
    "pred": 4,
    "icti": 2,
    "onco": 2,
    "nsis": 4,
    "tenc": 2,
    "refe": 1,
    "rsto": 1,
    "rs": 4,
    "suchthat": 3,
    "asopposed": 1,
    "toit": 1,
    "scon": 1,
    "diti": 2,
    "count": 1,
    "erpar": 1,
    "twhic": 1,
    "hisgi": 1,
    "venby": 1,
    "tionalon": 1,
    "clearly": 1,
    "ifth": 1,
    "elat": 2,
    "terh": 1,
    "olds": 1,
    "almost": 1,
    "every": 1,
    "ofit": 1,
    "erat": 2,
    "edex": 1,
    "pect": 1,
    "norm": 2,
    "indu": 1,
    "cedb": 1,
    "yeit": 1,
    "hert": 1,
    "he": 4,
    "orth": 1,
    "byfar": 1,
    "them": 7,
    "ostu": 2,
    "seda": 1,
    "reth": 1,
    "conditional": 4,
    "when": 9,
    "or": 11,
    "rootmean": 1,
    "squa": 1,
    "redp": 1,
    "nerr": 1,
    "which": 7,
    "simply": 1,
    "thesquare": 1,
    "root": 1,
    "those": 1,
    "measuresof": 1,
    "inequality": 1,
    "underthechoice": 1,
    "ofalossfunction": 1,
    "stos": 2,
    "elec": 1,
    "givenanestimate": 1,
    "squarederror": 1,
    "correspondingto": 1,
    "respectively": 8,
    "seeg": 1,
    "rang": 1,
    "eran": 2,
    "dmac": 2,
    "hina": 1,
    "elli": 2,
    "otta": 1,
    "ndti": 1,
    "mmer": 1,
    "mann": 1,
    "fora": 3,
    "ande": 5,
    "llio": 1,
    "ttan": 1,
    "dtim": 1,
    "merm": 1,
    "ann": 2,
    "amor": 1,
    "erec": 1,
    "entr": 1,
    "evie": 5,
    "mary": 1,
    "ofth": 3,
    "section": 2,
    "iews": 1,
    "pena": 3,
    "lize": 1,
    "line": 4,
    "arre": 2,
    "gres": 8,
    "sion": 8,
    "mode": 7,
    "ls": 5,
    "ense": 1,
    "mble": 1,
    "andh": 3,
    "ybri": 1,
    "application": 2,
    "conclude": 1,
    "some": 5,
    "aliz": 1,
    "edli": 1,
    "near": 3,
    "vect": 1,
    "orof": 2,
    "unkn": 1,
    "ownp": 1,
    "aram": 4,
    "eters": 1,
    "notice": 1,
    "drop": 2,
    "subscript": 1,
    "clarity": 1,
    "model": 23,
    "theparameter": 1,
    "these": 1,
    "known": 2,
    "speci": 1,
    "ficat": 1,
    "ionsi": 1,
    "ntime": 2,
    "seriesanalysis": 1,
    "suchaspredic": 1,
    "tiveregressions": 1,
    "variables": 12,
    "amongmanyothers": 1,
    "hamilton": 2,
    "becomes": 2,
    "eund": 1,
    "ersq": 1,
    "uare": 1,
    "dlos": 1,
    "honto": 1,
    "whichis": 1,
    "defi": 1,
    "nedw": 1,
    "hene": 1,
    "ver": 1,
    "isnonsingular": 1,
    "inthatcase": 1,
    "hisorthogonalto": 1,
    "bycon": 1,
    "squares": 1,
    "ols": 5,
    "andsometimes": 1,
    "thes": 6,
    "ampl": 3,
    "ecou": 1,
    "nter": 2,
    "part": 2,
    "isrankdeficient": 1,
    "infact": 1,
    "defined": 1,
    "it": 10,
    "case": 4,
    "large": 9,
    "possibly": 3,
    "larger": 1,
    "than": 3,
    "number": 6,
    "observations": 1,
    "problem": 1,
    "ball": 1,
    "around": 1,
    "origin": 1,
    "shown": 1,
    "although": 3,
    "biased": 1,
    "restricted": 1,
    "mse": 5,
    "hastie": 6,
    "etal": 8,
    "chap": 2,
    "inpe": 1,
    "zedr": 2,
    "egre": 5,
    "ssio": 4,
    "theestimator": 2,
    "lagrangianform": 1,
    "depends": 2,
    "tuning": 1,
    "parameter": 3,
    "controls": 1,
    "between": 2,
    "good": 2,
    "if": 6,
    "since": 1,
    "wellasonthedata": 1,
    "naturally": 2,
    "ndso": 1,
    "nthe": 2,
    "choi": 2,
    "ceof": 1,
    "different": 4,
    "ridgeregression": 2,
    "thei": 4,
    "deaw": 1,
    "asto": 1,
    "intr": 1,
    "oduc": 1,
    "ea": 1,
    "smallbiasbut": 1,
    "inturn": 1,
    "tikhonov": 5,
    "arsenin": 2,
    "parametervector": 2,
    "thatis": 1,
    "thepenaltyin": 2,
    "isgivenby": 3,
    "wherethe": 1,
    "butneverreach": 1,
    "exactly": 1,
    "zero": 1,
    "cannot": 1,
    "used": 2,
    "selecting": 2,
    "predictors": 4,
    "unless": 1,
    "truncation": 1,
    "sche": 1,
    "meis": 1,
    "empl": 1,
    "oyed": 1,
    "andchenetal": 1,
    "asam": 2,
    "etho": 5,
    "dtor": 1,
    "ismuch": 1,
    "ofthe": 1,
    "param": 1,
    "eterv": 1,
    "ector": 1,
    "et": 19,
    "al": 20,
    "smallest": 1,
    "convex": 1,
    "yn": 1,
    "mt": 1,
    "sparse": 3,
    "solutions": 1,
    "wesa": 1,
    "ythe": 1,
    "solu": 1,
    "spar": 5,
    "seif": 1,
    "only": 5,
    "asub": 1,
    "set": 12,
    "coef": 1,
    "fici": 2,
    "ents": 2,
    "aren": 3,
    "onze": 1,
    "ro": 1,
    "inother": 1,
    "words": 1,
    "hence": 1,
    "lass": 9,
    "oism": 1,
    "sefu": 1,
    "lwhe": 1,
    "alar": 1,
    "genu": 1,
    "mber": 1,
    "ofal": 1,
    "tern": 1,
    "adaptivelasso": 1,
    "dapt": 2,
    "ivel": 1,
    "asso": 6,
    "adalasso": 4,
    "wasp": 2,
    "ropo": 2,
    "sedb": 2,
    "yzou": 1,
    "andai": 1,
    "medto": 1,
    "impro": 1,
    "vethe": 1,
    "italsohas": 1,
    "butenjoysthe": 1,
    "oracleproperty": 4,
    "meaningthatit": 1,
    "enterthemodel": 1,
    "numb": 1,
    "erof": 1,
    "feat": 1,
    "ures": 1,
    "stepestimation": 1,
    "anyc": 1,
    "onsi": 3,
    "sten": 2,
    "test": 4,
    "imat": 4,
    "usin": 1,
    "glas": 1,
    "soas": 1,
    "thef": 5,
    "irst": 1,
    "impl": 1,
    "emen": 2,
    "tati": 2,
    "onof": 2,
    "azer": 1,
    "oini": 1,
    "tial": 1,
    "elasticnet": 1,
    "theelasticnet": 1,
    "elnet": 1,
    "waspr": 1,
    "opose": 1,
    "dbyzo": 1,
    "uandh": 1,
    "astie": 1,
    "oand": 2,
    "ridg": 1,
    "ereg": 1,
    "ress": 5,
    "ion": 2,
    "whilethe": 1,
    "parts": 1,
    "tabil": 1,
    "izest": 1,
    "hesol": 1,
    "ution": 1,
    "icto": 2,
    "rsbe": 1,
    "come": 1,
    "asaconsequence": 1,
    "over": 5,
    "thel": 2,
    "zou": 7,
    "zhang": 6,
    "zouandzhang": 1,
    "prop": 4,
    "oset": 1,
    "head": 1,
    "apti": 1,
    "veel": 1,
    "net": 3,
    "theelnetand": 1,
    "ofbothmethods": 1,
    "wherethefirst": 1,
    "rcom": 1,
    "es": 5,
    "fromtheelnet": 1,
    "folde": 1,
    "dconc": 1,
    "avepe": 1,
    "naliz": 2,
    "ation": 4,
    "fan": 4,
    "li": 6,
    "approach": 4,
    "covers": 1,
    "collection": 3,
    "penalty": 2,
    "functions": 6,
    "satisfying": 1,
    "properties": 2,
    "away": 2,
    "inthisway": 1,
    "each": 8,
    "thatunlikelasso": 1,
    "thep": 2,
    "enal": 1,
    "tyma": 1,
    "ydep": 1,
    "endo": 1,
    "inanonlinearway": 1,
    "wese": 1,
    "tthe": 1,
    "ltyi": 1,
    "unlikeols": 1,
    "orlasso": 1,
    "nevertheless": 5,
    "fanetal": 1,
    "show": 11,
    "ed": 2,
    "otherpenalties": 1,
    "poss": 2,
    "ibly": 1,
    "impo": 1,
    "sing": 1,
    "sity": 3,
    "inadata": 1,
    "richenvironment": 1,
    "ourp": 1,
    "npro": 3,
    "blem": 4,
    "ltie": 1,
    "intime": 2,
    "regu": 4,
    "lari": 4,
    "zedl": 1,
    "inea": 3,
    "rmod": 2,
    "els": 5,
    "thegrouplasso": 1,
    "osed": 2,
    "byyu": 1,
    "anan": 2,
    "dlin": 2,
    "biningthe": 1,
    "factors": 1,
    "denotedby": 1,
    "grou": 2,
    "psof": 1,
    "esso": 2,
    "rsas": 1,
    "values": 1,
    "deno": 1,
    "teap": 1,
    "arti": 1,
    "thecorrespond": 1,
    "regression": 14,
    "subvector": 1,
    "group": 3,
    "assign": 1,
    "isth": 3,
    "ecar": 1,
    "dina": 1,
    "lity": 1,
    "ofas": 1,
    "thegroup": 1,
    "yang": 3,
    "iveg": 1,
    "roup": 1,
    "algorithm": 8,
    "wang": 3,
    "leng": 2,
    "inthegrouplasso": 1,
    "simonetal": 1,
    "parkandsakaori": 1,
    "mation": 2,
    "konz": 1,
    "enan": 1,
    "dzie": 1,
    "gelm": 1,
    "theyobservethat": 1,
    "bayesian": 1,
    "interpretation": 1,
    "seen": 1,
    "maximum": 1,
    "posteriori": 1,
    "estimator": 5,
    "gaussian": 5,
    "inde": 2,
    "pend": 3,
    "ent": 2,
    "equivariant": 1,
    "gaussianpriors": 1,
    "laplaceprior": 1,
    "hans": 2,
    "park": 6,
    "casella": 2,
    "emet": 1,
    "hods": 1,
    "tisb": 1,
    "eyon": 1,
    "dthe": 2,
    "scop": 1,
    "eof": 1,
    "thissurvey": 2,
    "oret": 1,
    "ical": 2,
    "erti": 1,
    "inthissection": 2,
    "previously": 1,
    "discussed": 1,
    "results": 6,
    "ncon": 1,
    "sist": 1,
    "ency": 1,
    "andoraclebounds": 1,
    "forbo": 1,
    "ththe": 1,
    "finit": 1,
    "edime": 1,
    "nsion": 1,
    "fixed": 6,
    "butp": 1,
    "ossi": 1,
    "blyl": 1,
    "rtha": 1,
    "ighd": 1,
    "imen": 1,
    "increaseswith": 1,
    "usuallyfaster": 1,
    "moreprecisely": 1,
    "suppo": 1,
    "sethe": 1,
    "reisa": 1,
    "popul": 1,
    "tmin": 1,
    "imiz": 1,
    "eseq": 1,
    "uati": 1,
    "repe": 1,
    "ated": 1,
    "samp": 1,
    "les": 2,
    "arenonnull": 1,
    "wesayamethodis": 1,
    "lsel": 2,
    "ecti": 2,
    "tent": 2,
    "iste": 1,
    "ntif": 1,
    "fore": 8,
    "very": 8,
    "nori": 1,
    "tisi": 1,
    "mpli": 1,
    "edby": 3,
    "consistency": 11,
    "asamatteroffact": 1,
    "oftho": 1,
    "semod": 1,
    "esofc": 1,
    "onver": 1,
    "gence": 1,
    "selection": 11,
    "performance": 4,
    "procedure": 3,
    "further": 1,
    "broke": 1,
    "down": 1,
    "how": 4,
    "many": 2,
    "relevant": 4,
    "included": 2,
    "screening": 1,
    "irrelevant": 1,
    "excluded": 1,
    "probability": 1,
    "oracl": 2,
    "erisk": 1,
    "bound": 2,
    "saref": 1,
    "inite": 1,
    "ebou": 1,
    "ndsr": 1,
    "equi": 1,
    "trans": 1,
    "lates": 1,
    "intoa": 1,
    "elsa": 1,
    "ndar": 1,
    "atec": 1,
    "ondi": 1,
    "was": 3,
    "originally": 1,
    "developed": 1,
    "design": 4,
    "independent": 1,
    "identically": 1,
    "dis": 1,
    "tributed": 1,
    "iid": 1,
    "errors": 5,
    "knightandfu": 1,
    "mator": 1,
    "authors": 4,
    "framework": 3,
    "clear": 2,
    "toour": 1,
    "knowledge": 1,
    "thefirst": 1,
    "work": 4,
    "expanding": 1,
    "theresultsto": 1,
    "adep": 1,
    "ende": 4,
    "ntse": 1,
    "ttin": 3,
    "gwas": 1,
    "wangetal": 1,
    "auth": 1,
    "orss": 1,
    "howt": 2,
    "hatl": 1,
    "easa": 1,
    "modi": 1,
    "fied": 1,
    "simi": 2,
    "lart": 2,
    "adal": 1,
    "isbothmodel": 1,
    "nardiandrinaldo": 1,
    "chanandchen": 1,
    "yoonetal": 1,
    "andscad": 1,
    "sangandsun": 1,
    "memor": 1,
    "yinno": 1,
    "vatio": 1,
    "nsusi": 1,
    "nggen": 1,
    "ands": 1,
    "cada": 1,
    "ticu": 1,
    "larc": 1,
    "ases": 1,
    "kock": 7,
    "allre": 1,
    "sults": 2,
    "above": 3,
    "holdf": 1,
    "orthe": 1,
    "meaningthat": 1,
    "insparse": 2,
    "iona": 8,
    "ryun": 1,
    "ivar": 1,
    "iate": 2,
    "seriessettings": 2,
    "ratefasterthan": 1,
    "andm": 5,
    "property": 2,
    "difference": 1,
    "martingale": 1,
    "strong": 1,
    "mixing": 1,
    "andnon": 1,
    "gaus": 1,
    "sian": 4,
    "inno": 1,
    "vati": 2,
    "ons": 2,
    "itincludes": 1,
    "vere": 1,
    "auto": 2,
    "vemo": 2,
    "autoregressive": 5,
    "exogenous": 1,
    "dynamic": 2,
    "lags": 1,
    "conditionally": 1,
    "heteroskedastic": 1,
    "xie": 2,
    "oracle": 5,
    "mixingerrors": 2,
    "wuandwu": 1,
    "deri": 3,
    "veor": 1,
    "acle": 1,
    "boun": 1,
    "ds": 3,
    "weak": 1,
    "dependent": 4,
    "innovations": 2,
    "wu": 4,
    "eash": 2,
    "dtsa": 1,
    "withinthe": 1,
    "xueandtaniguchi": 1,
    "esre": 1,
    "swit": 3,
    "long": 1,
    "ryin": 1,
    "nova": 1,
    "fanandli": 1,
    "kimetal": 1,
    "edth": 1,
    "atth": 1,
    "esca": 1,
    "dals": 1,
    "uema": 1,
    "tsua": 1,
    "ndta": 1,
    "naka": 1,
    "regressors": 2,
    "ledereretal": 1,
    "problems": 2,
    "seriesproblems": 1,
    "babiietal": 2,
    "pars": 1,
    "dimensionaltime": 2,
    "utho": 2,
    "rsde": 1,
    "rive": 1,
    "integratedtime": 1,
    "settings": 1,
    "lee": 4,
    "shi": 2,
    "dk": 1,
    "oe": 1,
    "smeeksandwijler": 2,
    "proposed": 6,
    "single": 2,
    "equation": 2,
    "error": 2,
    "correction": 1,
    "selector": 1,
    "specs": 1,
    "automated": 2,
    "hsuetal": 1,
    "showmodel": 1,
    "vector": 3,
    "var": 1,
    "white": 9,
    "noise": 1,
    "shocks": 1,
    "ren": 2,
    "afterward": 1,
    "callotandkock": 1,
    "inhigh": 1,
    "nals": 2,
    "etti": 1,
    "ngs": 1,
    "noft": 1,
    "kockandcallot": 1,
    "andb": 1,
    "asua": 1,
    "ndmi": 1,
    "chai": 1,
    "lidi": 1,
    "exte": 1,
    "ndin": 1,
    "gpre": 1,
    "viou": 1,
    "swor": 1,
    "ks": 2,
    "meln": 1,
    "ykan": 1,
    "dban": 1,
    "erje": 1,
    "penalties": 1,
    "zhu": 2,
    "derives": 1,
    "bounds": 2,
    "folded": 1,
    "concave": 1,
    "tiesforgaussian": 1,
    "lsin": 1,
    "morerecently": 5,
    "rese": 1,
    "arch": 2,
    "ersh": 1,
    "aved": 1,
    "epar": 1,
    "ted": 1,
    "wongetal": 1,
    "vedf": 1,
    "init": 1,
    "esam": 2,
    "pleg": 1,
    "uar": 1,
    "mixi": 1,
    "ngpr": 1,
    "hsub": 1,
    "weibull": 1,
    "marg": 1,
    "inal": 3,
    "dist": 2,
    "ribu": 2,
    "deriveequation": 1,
    "rofw": 1,
    "eakl": 1,
    "yspa": 1,
    "rse": 1,
    "incl": 2,
    "udem": 1,
    "hcon": 1,
    "arel": 1,
    "enou": 1,
    "gh": 1,
    "thisc": 1,
    "ondit": 1,
    "ionis": 1,
    "asthe": 1,
    "minrestriction": 2,
    "thet": 1,
    "ruel": 1,
    "imit": 1,
    "being": 1,
    "even": 2,
    "bimodal": 1,
    "instance": 1,
    "leeb": 3,
    "p\u00f6tscher": 3,
    "andbellonietal": 1,
    "deta": 1,
    "iled": 1,
    "disc": 1,
    "ussi": 1,
    "inference": 3,
    "after": 1,
    "actually": 1,
    "active": 1,
    "area": 1,
    "research": 3,
    "vast": 1,
    "num": 1,
    "ber": 1,
    "recently": 6,
    "appeared": 1,
    "van": 1,
    "geer": 2,
    "desparsified": 1,
    "order": 1,
    "construct": 2,
    "asymptotically": 1,
    "valid": 1,
    "confidence": 2,
    "interval": 1,
    "theaddition": 1,
    "extra": 1,
    "unbiased": 1,
    "longer": 1,
    "moreimportantly": 1,
    "thesensethatv": 1,
    "ate": 1,
    "regularity": 1,
    "surprisingly": 1,
    "condition": 1,
    "approximated": 1,
    "particular": 1,
    "propose": 2,
    "run": 2,
    "onto": 2,
    "nodewide": 1,
    "fordetails": 1,
    "belloni": 3,
    "put": 1,
    "forward": 1,
    "double": 2,
    "context": 1,
    "form": 2,
    "interest": 1,
    "lies": 1,
    "scalar": 1,
    "parame": 1,
    "ter": 1,
    "control": 1,
    "consists": 2,
    "rsin": 1,
    "theh": 2,
    "igh": 1,
    "naux": 1,
    "ilia": 1,
    "ryre": 1,
    "sions": 2,
    "nb": 1,
    "y\u02c6": 1,
    "obtained": 1,
    "oncetheset": 1,
    "priori": 1,
    "estimated": 3,
    "nonzero": 1,
    "parameters": 2,
    "low": 4,
    "main": 1,
    "result": 1,
    "theorem": 2,
    "states": 4,
    "unde": 2,
    "rwhi": 1,
    "chth": 1,
    "eest": 2,
    "normal": 1,
    "nbec": 1,
    "onst": 1,
    "ruct": 1,
    "edin": 1,
    "theusualfashion": 1,
    "otay": 1,
    "lore": 1,
    "tal": 1,
    "andlockhartetal": 2,
    "leeetal": 1,
    "putf": 1,
    "orwa": 1,
    "rdge": 1,
    "nera": 2,
    "theauthorsargue": 1,
    "details": 1,
    "andtayloretal": 1,
    "atin": 2,
    "orme": 1,
    "whil": 1,
    "evan": 1,
    "dege": 1,
    "eret": 1,
    "bellonietal": 1,
    "esen": 4,
    "viro": 2,
    "nmen": 2,
    "hecqetal": 1,
    "isoneofthefirst": 1,
    "selec": 1,
    "tioni": 1,
    "nfere": 2,
    "ncein": 1,
    "atime": 1,
    "andad\u00e1meketal": 1,
    "totime": 1,
    "seriesframework": 1,
    "specifically": 1,
    "babii": 4,
    "rhet": 1,
    "eros": 1,
    "keda": 1,
    "stic": 3,
    "autocorrelated": 1,
    "hete": 2,
    "rosk": 1,
    "edat": 1,
    "icit": 1,
    "autocorrelation": 2,
    "consistent": 1,
    "hac": 1,
    "they": 1,
    "debi": 1,
    "ased": 1,
    "central": 1,
    "limit": 1,
    "coefficients": 1,
    "study": 2,
    "hace": 1,
    "stim": 1,
    "ator": 1,
    "elon": 2,
    "plas": 1,
    "sore": 1,
    "sidu": 1,
    "als": 2,
    "ad\u00e1meket": 1,
    "esse": 2,
    "gund": 1,
    "erne": 1,
    "ar": 1,
    "epochdependence": 1,
    "assumptions": 1,
    "allowingfornon": 1,
    "fur": 1,
    "thermore": 1,
    "armo": 2,
    "thefunction": 1,
    "happearingin": 1,
    "agen": 1,
    "eric": 1,
    "func": 7,
    "isinfea": 1,
    "sible": 1,
    "infinite": 2,
    "efficient": 2,
    "technique": 1,
    "search": 1,
    "course": 1,
    "asforinstance": 1,
    "ter\u00e4svirta": 9,
    "suarez": 2,
    "fari\u00f1asetal": 2,
    "mcaleer": 5,
    "review": 1,
    "suchmodels": 1,
    "alternatively": 1,
    "wecanreplace": 1,
    "bysi": 1,
    "rand": 1,
    "fini": 1,
    "te": 3,
    "deai": 2,
    "stoc": 1,
    "dera": 1,
    "sequ": 1,
    "ence": 2,
    "offi": 1,
    "nite": 1,
    "pace": 1,
    "sievespaces": 1,
    "thatconvergesto": 1,
    "somenorm": 1,
    "ppro": 1,
    "xima": 1,
    "ting": 8,
    "iswrittenas": 1,
    "isthe": 2,
    "thba": 1,
    "sisf": 1,
    "unct": 1,
    "ionf": 2,
    "ofparameters": 1,
    "thenu": 1,
    "mbero": 1,
    "fbasi": 1,
    "sfunc": 1,
    "tions": 5,
    "willdepend": 1,
    "sample": 5,
    "size": 2,
    "dimension": 1,
    "space": 5,
    "arg": 1,
    "min": 2,
    "lying": 1,
    "fundamental": 1,
    "concept": 1,
    "dense": 2,
    "bein": 1,
    "game": 2,
    "tric": 7,
    "isdensein": 1,
    "ifforany": 1,
    "thereisa": 1,
    "isca": 1,
    "lled": 1,
    "dof": 1,
    "sieves": 2,
    "fortime": 1,
    "seriesdata": 1,
    "seechen": 1,
    "example": 6,
    "approximating": 1,
    "proper": 1,
    "subset": 3,
    "polynomials": 1,
    "continuous": 3,
    "polynomi": 1,
    "smaller": 2,
    "simpler": 1,
    "natural": 1,
    "bymaking": 1,
    "thesetofpolyno": 1,
    "mials": 1,
    "degree": 1,
    "equal": 1,
    "including": 2,
    "constant": 1,
    "whic": 1,
    "honi": 1,
    "tstu": 1,
    "rnis": 1,
    "dens": 1,
    "ein": 1,
    "linearsieves": 1,
    "dsli": 1,
    "keol": 1,
    "inthiscase": 2,
    "thedimension": 1,
    "thev": 4,
    "eter": 3,
    "canb": 2,
    "designmatrixand": 1,
    "nonlinearsieves": 1,
    "nonlinearleast": 1,
    "inthispaper": 2,
    "nnsa": 1,
    "ndre": 1,
    "figure": 12,
    "colou": 3,
    "rfigu": 3,
    "recan": 3,
    "bevie": 3,
    "wedat": 3,
    "traditional": 1,
    "classified": 1,
    "into": 1,
    "isdefinedas": 1,
    "intheabovemodel": 1,
    "theb": 2,
    "asis": 1,
    "called": 3,
    "weights": 1,
    "sum": 1,
    "neurons": 3,
    "specification": 3,
    "represent": 2,
    "input": 3,
    "layer": 4,
    "covariates": 3,
    "thefigure": 1,
    "layers": 2,
    "five": 1,
    "elements": 1,
    "intheearlydays": 1,
    "waschosen": 1,
    "afunction": 1,
    "isasquashing": 1,
    "sigmoid": 1,
    "ifit": 1,
    "isno": 1,
    "decreasing": 1,
    "lim": 1,
    "andlim": 1,
    "historically": 1,
    "logistic": 5,
    "exp": 6,
    "hype": 1,
    "rbol": 1,
    "icta": 1,
    "ngen": 1,
    "funahashi": 2,
    "providedthat": 1,
    "issu": 1,
    "ffic": 1,
    "ient": 1,
    "lyla": 1,
    "rge": 1,
    "cybenko": 3,
    "andhornik": 1,
    "barron": 2,
    "stinchcombe": 2,
    "sandberg": 2,
    "derived": 2,
    "same": 3,
    "andhorniketal": 1,
    "moid": 1,
    "ater": 2,
    "focu": 1,
    "sedo": 1,
    "nrad": 1,
    "ial": 1,
    "basisfunctions": 1,
    "rbf": 1,
    "definedas": 1,
    "radialbasis": 1,
    "yarotsky": 2,
    "relu": 1,
    "rect": 1,
    "ifie": 1,
    "earu": 1,
    "nit": 1,
    "max": 1,
    "bydefining": 1,
    "andcan": 1,
    "argmin": 2,
    "isunfeasible": 1,
    "whereusually": 1,
    "traditionally": 1,
    "istouse": 1,
    "bayes": 1,
    "ianme": 1,
    "thods": 1,
    "asinm": 1,
    "ackay": 1,
    "mackay": 3,
    "andf": 2,
    "ores": 1,
    "eean": 1,
    "dhag": 1,
    "amore": 1,
    "dropout": 1,
    "srivastavaetal": 1,
    "along": 1,
    "witht": 1,
    "heirc": 1,
    "onnec": 1,
    "fromthennduring": 1,
    "annnwith": 1,
    "possible": 2,
    "thinned": 1,
    "byjus": 1,
    "tremo": 1,
    "vings": 1,
    "omene": 1,
    "urons": 1,
    "outs": 1,
    "esfr": 1,
    "omth": 2,
    "samplednn": 1,
    "wemo": 1,
    "dify": 1,
    "equa": 1,
    "insteadof": 1,
    "acht": 1,
    "rain": 1,
    "inge": 1,
    "xamp": 1,
    "le": 1,
    "alue": 1,
    "soft": 1,
    "heen": 1,
    "trie": 1,
    "sof": 2,
    "sfor": 2,
    "aremultipliedby": 1,
    "emor": 1,
    "ehid": 1,
    "denl": 1,
    "ayer": 1,
    "inthefigure": 1,
    "were": 2,
    "pres": 3,
    "enta": 1,
    "nnwi": 1,
    "th": 1,
    "then": 7,
    "umbe": 2,
    "rofh": 1,
    "idde": 1,
    "aspo": 2,
    "inte": 7,
    "dout": 2,
    "inmh": 1,
    "aska": 1,
    "shallownns": 1,
    "units": 1,
    "define": 2,
    "theoutput": 1,
    "oflayer": 1,
    "isgi": 1,
    "venr": 1,
    "ecur": 1,
    "sive": 2,
    "lyby": 1,
    "urre": 1,
    "ntne": 2,
    "ural": 4,
    "netw": 5,
    "orks": 5,
    "broadlyspeaking": 1,
    "rnnscanuse": 1,
    "rint": 1,
    "erna": 1,
    "lsta": 6,
    "memory": 3,
    "itec": 1,
    "ture": 1,
    "short": 2,
    "termmemorycell": 1,
    "lstm": 4,
    "where\u02c6": 1,
    "epre": 1,
    "dict": 1,
    "iono": 2,
    "arefunctions": 1,
    "tobedefined": 1,
    "iswhatwecallthe": 1,
    "state": 3,
    "fromatime": 1,
    "espe": 1,
    "rspe": 1,
    "ctiv": 1,
    "rnnscan": 1,
    "spacemodel": 1,
    "previousones": 1,
    "asintime": 1,
    "seriesmodels": 3,
    "anis": 1,
    "hing": 1,
    "odin": 1,
    "ggra": 1,
    "dien": 2,
    "tpro": 1,
    "sett": 2,
    "heco": 1,
    "stfu": 1,
    "ncti": 1,
    "beve": 1,
    "rysm": 1,
    "allo": 1,
    "rdiv": 1,
    "erge": 1,
    "fortunately": 1,
    "andschmidhuber": 1,
    "termmemory": 2,
    "several": 2,
    "red": 1,
    "circles": 1,
    "indicate": 1,
    "activation": 1,
    "while": 2,
    "blue": 1,
    "cir": 1,
    "thesymbols": 1,
    "mathematically": 1,
    "initiatewith": 1,
    "giventheinput": 1,
    "tanh": 1,
    "rmat": 1,
    "lowi": 1,
    "ltsmcell": 1,
    "colo": 1,
    "urfi": 1,
    "gure": 1,
    "wed": 1,
    "atwi": 1,
    "leyo": 1,
    "nlin": 1,
    "elib": 1,
    "rary": 1,
    "element": 1,
    "cell": 2,
    "forget": 1,
    "ouput": 1,
    "gates": 1,
    "introduces": 1,
    "bit": 1,
    "so": 1,
    "remember": 1,
    "past": 2,
    "learns": 1,
    "keep": 1,
    "information": 2,
    "makepredictions": 1,
    "orge": 1,
    "tnon": 1,
    "rele": 2,
    "vant": 2,
    "thec": 2,
    "ells": 1,
    "tate": 1,
    "blockattime": 1,
    "hiddenneurons": 1,
    "repr": 1,
    "tsth": 1,
    "eout": 1,
    "puto": 1,
    "fthe": 2,
    "forgetgate": 1,
    "withthenewinfor": 1,
    "notethat": 1,
    "theinputand": 1,
    "informationfrom": 1,
    "previous": 2,
    "signal": 1,
    "will": 1,
    "combined": 2,
    "output": 1,
    "gate": 1,
    "flow": 1,
    "sina": 1,
    "nlst": 1,
    "mcel": 1,
    "exam": 2,
    "pleo": 2,
    "fasi": 1,
    "iont": 2,
    "rees": 2,
    "local": 2,
    "predictions": 1,
    "using": 7,
    "recursive": 1,
    "partitioning": 1,
    "may": 1,
    "represented": 1,
    "graph": 1,
    "left": 1,
    "side": 1,
    "equivalent": 2,
    "supposethat": 1,
    "want": 1,
    "predict": 2,
    "scores": 1,
    "basketball": 1,
    "height": 1,
    "weight": 1,
    "romt": 1,
    "hesh": 1,
    "orte": 1,
    "rpla": 1,
    "yers": 1,
    "togrowatree": 1,
    "anop": 1,
    "tima": 1,
    "lobs": 1,
    "erva": 1,
    "eexa": 1,
    "theo": 2,
    "bser": 1,
    "onis": 1,
    "expression": 1,
    "approximation": 2,
    "dummyvariables": 1,
    "ermi": 2,
    "naln": 2,
    "odes": 2,
    "regions": 1,
    "leaves": 1,
    "parentnodes": 1,
    "ther": 1,
    "ootn": 1,
    "odea": 1,
    "tpos": 1,
    "itio": 1,
    "theparent": 2,
    "nodeatposition": 1,
    "hastwosplit": 1,
    "child": 1,
    "node": 2,
    "satp": 1,
    "osit": 1,
    "pare": 1,
    "ntno": 1,
    "deha": 1,
    "athreshold": 1,
    "split": 1,
    "vari": 5,
    "able": 2,
    "ciat": 1,
    "asthesets": 1,
    "ofpa": 1,
    "rent": 3,
    "andt": 3,
    "intheexample": 1,
    "ftre": 1,
    "ewit": 1,
    "hlab": 1,
    "nodesare": 1,
    "rmin": 1,
    "alno": 1,
    "desa": 1,
    "hepa": 3,
    "thto": 3,
    "leaf": 4,
    "does": 1,
    "noti": 1,
    "nclu": 1,
    "depa": 1,
    "includethe": 2,
    "chil": 2,
    "dofp": 2,
    "tnod": 2,
    "indexes": 1,
    "parent": 1,
    "nodes": 1,
    "path": 1,
    "rf": 3,
    "specified": 1,
    "bootstrap": 1,
    "original": 2,
    "usea": 1,
    "bloc": 1,
    "kboo": 1,
    "tstr": 1,
    "ap": 1,
    "supposethereare": 1,
    "boot": 1,
    "psam": 1,
    "ples": 1,
    "foreachsample": 1,
    "treewith": 1,
    "cast": 5,
    "initialize": 1,
    "make": 2,
    "growa": 1,
    "small": 4,
    "treemodeltofit": 1,
    "update": 1,
    "randomvariables": 1,
    "scornetetal": 1,
    "toth": 1,
    "eunk": 1,
    "nown": 1,
    "wagerandathey": 1,
    "prov": 2,
    "edco": 1,
    "yand": 2,
    "greg": 1,
    "another": 2,
    "greedy": 1,
    "approximate": 2,
    "uses": 1,
    "learners": 1,
    "nsid": 1,
    "erhe": 1,
    "call": 1,
    "edgr": 1,
    "adie": 1,
    "ntbo": 1,
    "osti": 1,
    "ng": 4,
    "wasintro": 1,
    "ducedbyfriedman": 1,
    "forr": 1,
    "duff": 1,
    "helm": 1,
    "bold": 2,
    "vedb": 1,
    "ound": 1,
    "sont": 1,
    "zhangandyu": 2,
    "verg": 1,
    "b\u00fchlmann": 5,
    "thecaseof": 1,
    "demonstrated": 1,
    "types": 1,
    "stopping": 2,
    "related": 1,
    "sizes": 1,
    "suggested": 1,
    "friedman": 4,
    "jiang": 2,
    "lugo": 1,
    "dvay": 1,
    "atis": 2,
    "bart": 1,
    "lett": 1,
    "rask": 1,
    "andb\u00fchlmann": 1,
    "theid": 1,
    "eaofb": 1,
    "ooste": 1,
    "dtree": 1,
    "sisto": 1,
    "ateachiteration": 1,
    "sequentially": 1,
    "thispaper": 1,
    "itisrecommended": 1,
    "tous": 1,
    "rink": 1,
    "agep": 1,
    "isclose": 1,
    "faster": 1,
    "convergence": 2,
    "rate": 1,
    "better": 1,
    "fit": 1,
    "likely": 1,
    "sampleresults": 1,
    "inaddition": 1,
    "thed": 4,
    "eriv": 2,
    "ativ": 2,
    "eish": 1,
    "ighl": 1,
    "affe": 1,
    "cted": 2,
    "byov": 1,
    "erfi": 1,
    "ifwe": 1,
    "look": 2,
    "sampleestimates": 1,
    "alea": 1,
    "rnin": 1,
    "grat": 1,
    "ebet": 1,
    "ween": 1,
    "andv": 1,
    "eiga": 1,
    "andsuarez": 1,
    "pret": 1,
    "icu": 1,
    "asforexample": 1,
    "gene": 1,
    "ralf": 1,
    "orms": 1,
    "ofsm": 1,
    "ooth": 1,
    "transition": 2,
    "restricts": 1,
    "ings": 1,
    "analternative": 1,
    "asde": 1,
    "scri": 1,
    "bede": 1,
    "arli": 1,
    "forwardnns": 1,
    "inthissetup": 1,
    "chenandshen": 2,
    "andchen": 4,
    "under": 1,
    "regul": 1,
    "arity": 1,
    "condi": 1,
    "cyan": 1,
    "theirsetup": 1,
    "isde": 1,
    "fine": 1,
    "dasf": 1,
    "ollo": 1,
    "ws": 4,
    "comp": 5,
    "onen": 1,
    "tsof": 1,
    "isfixed": 1,
    "cher": 1,
    "nozh": 1,
    "ukov": 1,
    "symp": 1,
    "toti": 1,
    "cres": 1,
    "ults": 1,
    "inchenandshen": 1,
    "inscornetetal": 1,
    "andw": 2,
    "ageretal": 1,
    "fort": 1,
    "heca": 1,
    "seof": 1,
    "iidd": 1,
    "ata": 1,
    "davisand": 1,
    "nielsen": 3,
    "stochastic": 1,
    "prove": 1,
    "class": 1,
    "worth": 1,
    "mentioning": 1,
    "interesting": 1,
    "borup": 4,
    "baggingfortime": 2,
    "arra": 1,
    "nget": 1,
    "hese": 1,
    "toft": 1,
    "uple": 1,
    "efor": 3,
    "mofa": 1,
    "matr": 1,
    "ix": 1,
    "ofdimension": 1,
    "block": 1,
    "boots": 1,
    "traps": 1,
    "ample": 1,
    "softh": 1,
    "eform": 1,
    "bydrawing": 1,
    "blocksof": 1,
    "rowsof": 1,
    "withreplacement": 1,
    "computethe": 1,
    "thbo": 1,
    "otst": 1,
    "rapf": 1,
    "orec": 4,
    "asta": 1,
    "otherwise": 1,
    "thdi": 1,
    "agon": 1,
    "alel": 1,
    "tgiv": 1,
    "enby": 1,
    "tere": 1,
    "hone": 1,
    "achc": 1,
    "ovar": 1,
    "compute": 1,
    "asbe": 1,
    "butw": 1,
    "ith": 1,
    "replacedby": 1,
    "aspr": 1,
    "opos": 1,
    "toreducethe": 1,
    "ian": 1,
    "zeroregres": 1,
    "tothesamplesize": 1,
    "theba": 1,
    "gging": 1,
    "algor": 1,
    "ithmi": 1,
    "inalgorithm": 1,
    "requires": 1,
    "modified": 2,
    "garcia": 3,
    "letes": 1,
    "ubset": 1,
    "regre": 1,
    "ssion": 1,
    "themotivation": 1,
    "optimal": 1,
    "hby": 1,
    "testing": 1,
    "combinations": 1,
    "inmostcases": 1,
    "unfeasible": 1,
    "foragivenset": 1,
    "ible": 1,
    "uniqu": 1,
    "euniv": 1,
    "ariat": 1,
    "emode": 1,
    "lsand": 1,
    "atem": 1,
    "asisknownasthe": 1,
    "completesubset": 1,
    "increases": 1,
    "rapidly": 1,
    "moreover": 1,
    "inthesecases": 1,
    "itwassuggested": 1,
    "should": 3,
    "still": 1,
    "andmedeirosetal": 2,
    "nalm": 3,
    "tart": 2,
    "fitting": 1,
    "hon": 1,
    "candidate": 1,
    "save": 1,
    "statistics": 6,
    "variable": 2,
    "andweselectthe": 1,
    "stha": 1,
    "tare": 1,
    "king": 1,
    "extended": 1,
    "entb": 1,
    "yyou": 1,
    "suf": 1,
    "largeset": 1,
    "dest": 1,
    "nd": 1,
    "nnmodels": 1,
    "onli": 3,
    "orone": 1,
    "ofits": 1,
    "gener": 1,
    "aliza": 1,
    "traplettietal": 1,
    "motivation": 1,
    "component": 1,
    "capture": 2,
    "dependence": 2,
    "making": 1,
    "interpretable": 1,
    "spirit": 1,
    "semi": 4,
    "inspired": 1,
    "ideas": 1,
    "combining": 1,
    "adalassoandols": 1,
    "inthefirstone": 1,
    "calledrf": 1,
    "idea": 1,
    "selected": 1,
    "forest": 3,
    "second": 1,
    "named": 1,
    "works": 2,
    "opposite": 1,
    "direction": 1,
    "select": 1,
    "dieboldandshin": 1,
    "proposethe": 1,
    "partially": 2,
    "egalitarian": 2,
    "otoc": 1,
    "ombi": 1,
    "nesu": 1,
    "veyforecasts": 1,
    "age": 1,
    "combination": 1,
    "survived": 1,
    "forecasts": 2,
    "considers": 1,
    "byth": 1,
    "eaut": 1,
    "hors": 1,
    "optimally": 1,
    "clos": 1,
    "elyc": 1,
    "onne": 2,
    "dieboldetal": 1,
    "inordertocon": 1,
    "ecas": 7,
    "tcom": 1,
    "pari": 1,
    "son": 1,
    "consequently": 1,
    "ared": 2,
    "iffe": 1,
    "pape": 1,
    "rbyd": 1,
    "iebo": 1,
    "ldan": 1,
    "dmar": 1,
    "iano": 1,
    "edie": 1,
    "diebold": 6,
    "giac": 1,
    "omin": 1,
    "iand": 1,
    "whit": 1,
    "mccracken": 2,
    "thedieboldand": 1,
    "mariano": 3,
    "anuncondi": 1,
    "uspa": 1,
    "ywhi": 1,
    "ullh": 1,
    "ypot": 1,
    "hesi": 1,
    "hansen": 7,
    "showedthatwhite": 1,
    "ature": 1,
    "mcs": 2,
    "ofthedataset": 1,
    "whereas": 1,
    "importantly": 1,
    "cspr": 1,
    "oced": 1,
    "ured": 1,
    "oesn": 1,
    "ot": 1,
    "cepa": 1,
    "inpr": 1,
    "acti": 1,
    "cala": 1,
    "ppli": 1,
    "cati": 1,
    "itisimpor": 1,
    "conduct": 1,
    "predictive": 1,
    "abilitytests": 1,
    "insummary": 1,
    "fina": 2,
    "ncia": 2,
    "lfor": 1,
    "thereis": 1,
    "macroeconomic": 4,
    "certainly": 1,
    "successful": 1,
    "applications": 2,
    "inflationand": 2,
    "medeirosand": 1,
    "vasconcelos": 4,
    "showthathigh": 1,
    "onaverage": 1,
    "smallerfore": 1,
    "casting": 2,
    "econometric": 2,
    "shrinkage": 2,
    "csr": 1,
    "perform": 1,
    "real": 2,
    "brazilian": 1,
    "inflation": 2,
    "environ": 1,
    "ments": 1,
    "ider": 1,
    "anap": 1,
    "toal": 1,
    "macr": 1,
    "cu": 1,
    "petitive": 1,
    "medeirosetal": 2,
    "udin": 1,
    "gfac": 1,
    "torm": 1,
    "od": 1,
    "ardia": 2,
    "introduce": 1,
    "text": 1,
    "sentiment": 1,
    "optimizes": 1,
    "purposes": 1,
    "apply": 1,
    "economic": 2,
    "growth": 3,
    "united": 3,
    "sand": 1,
    "sofs": 1,
    "enti": 1,
    "valu": 1,
    "tarassow": 2,
    "monthly": 2,
    "uematsu": 2,
    "tanaka": 2,
    "rsfo": 1,
    "st": 1,
    "quarterly": 1,
    "gross": 1,
    "domestic": 1,
    "product": 1,
    "mixe": 1,
    "ddat": 1,
    "plin": 1,
    "midas": 1,
    "frame": 1,
    "workw": 1,
    "ithpe": 1,
    "seea": 1,
    "lsob": 1,
    "abii": 1,
    "findthatcom": 1,
    "audrinoandknaus": 1,
    "usedlasso": 1,
    "volatilities": 1,
    "callotetal": 1,
    "ance": 3,
    "inve": 1,
    "stor": 1,
    "chincoetal": 1,
    "uset": 1,
    "hela": 1,
    "ssot": 1,
    "omak": 1,
    "minute": 1,
    "ahea": 1,
    "dret": 1,
    "urnf": 1,
    "asts": 2,
    "arme": 1,
    "thod": 1,
    "respect": 1,
    "atbest": 1,
    "forexam": 1,
    "ple": 1,
    "references": 2,
    "therein": 1,
    "majority": 1,
    "ter\u00e4svirtaetal": 1,
    "andwhite": 1,
    "balkinandord": 1,
    "tkacz": 2,
    "heravietal": 1,
    "despite": 1,
    "skepticism": 1,
    "systematically": 1,
    "accurate": 1,
    "benchmarks": 1,
    "horizons": 1,
    "dominated": 1,
    "other": 1,
    "due": 1,
    "its": 2,
    "but": 1,
    "potential": 1,
    "nonlinearities": 1,
    "key": 1,
    "theauthors": 1,
    "larg": 1,
    "eset": 1,
    "ofpr": 1,
    "tors": 1,
    "dand": 2,
    "neur": 6,
    "alne": 2,
    "twor": 1,
    "coulombe": 2,
    "nomic": 1,
    "ensemble": 1,
    "forecast": 1,
    "employment": 1,
    "period": 2,
    "googl": 1,
    "esear": 1,
    "chact": 1,
    "ivity": 1,
    "tivepower": 1,
    "borupetal": 1,
    "computenow": 1,
    "volu": 1,
    "meda": 1,
    "taan": 1,
    "hine": 2,
    "learningmethods": 1,
    "iric": 1,
    "alil": 1,
    "lust": 1,
    "rati": 1,
    "bovespa": 1,
    "weus": 1,
    "easr": 1,
    "ssor": 1,
    "sinf": 1,
    "orma": 1,
    "tionf": 1,
    "romot": 1,
    "herma": 1,
    "jorin": 1,
    "dexes": 1,
    "namely": 2,
    "us": 1,
    "unitedkingdom": 1,
    "dax": 1,
    "germany": 1,
    "hangseng": 1,
    "hongkong": 1,
    "andnikkei": 1,
    "japan": 1,
    "minfrequency": 1,
    "ataw": 1,
    "ereo": 1,
    "btai": 1,
    "ned": 1,
    "fromtheoxford": 1,
    "achs": 1,
    "tock": 1,
    "frequency": 1,
    "atday": 1,
    "benchmark": 2,
    "heterogeneous": 1,
    "har": 4,
    "corsi": 2,
    "log": 1,
    "asalternatives": 1,
    "sideredhere": 1,
    "weconsidertwo": 1,
    "atas": 1,
    "infe": 3,
    "bru": 1,
    "ndsi": 1,
    "nmay": 1,
    "atot": 1,
    "alof": 1,
    "obse": 1,
    "rvat": 1,
    "einc": 1,
    "lude": 1,
    "stwo": 1,
    "peri": 1,
    "odso": 1,
    "fver": 1,
    "yhig": 1,
    "hvol": 1,
    "atil": 1,
    "inan": 1,
    "cial": 1,
    "cris": 2,
    "isof": 1,
    "smooth": 1,
    "version": 1,
    "hille": 1,
    "bran": 1,
    "longmemory": 1,
    "hillebrand": 3,
    "table": 3,
    "ingr": 1,
    "esul": 1,
    "ts": 1,
    "fullsample": 1,
    "qlike": 4,
    "harx": 1,
    "randomforest": 1,
    "neuralnetwork": 3,
    "reports": 1,
    "mean": 1,
    "squared": 1,
    "ratio": 1,
    "generalizations": 1,
    "extensions": 1,
    "propo": 1,
    "sedby": 1,
    "audri": 1,
    "noand": 1,
    "knaus": 2,
    "whichinthe": 1,
    "ric": 1,
    "aresh": 1,
    "ownin": 1,
    "sean": 1,
    "qlik": 1,
    "performsthehar": 1,
    "mari": 1,
    "anot": 1,
    "esto": 1,
    "fequ": 1,
    "alfo": 1,
    "ingp": 2,
    "erfo": 1,
    "rman": 1,
    "ce": 1,
    "report": 1,
    "full": 1,
    "out": 1,
    "financial": 1,
    "crisis": 1,
    "way": 1,
    "effects": 1,
    "covid": 1,
    "pan": 1,
    "aswe": 1,
    "cans": 1,
    "eefr": 1,
    "etab": 1,
    "mark": 1,
    "withadalasso": 1,
    "duringthecovid": 1,
    "rfsd": 1,
    "onot": 1,
    "perf": 1,
    "ormw": 1,
    "ell": 1,
    "ontheotherhand": 1,
    "nnmodelswith": 1,
    "andhigh": 1,
    "wepr": 1,
    "tedb": 1,
    "othl": 1,
    "andn": 1,
    "alte": 1,
    "rnat": 4,
    "ives": 1,
    "tsge": 1,
    "liza": 1,
    "nsem": 1,
    "baggingandcsr": 1,
    "dependentdata": 1,
    "wefo": 1,
    "cuse": 1,
    "donn": 1,
    "nsan": 1,
    "dtre": 1,
    "basedmethods": 1,
    "theoret": 1,
    "forshallownns": 1,
    "chenetal": 1,
    "provide": 1,
    "theoretical": 1,
    "behavior": 1,
    "amei": 1,
    "stru": 1,
    "asymptotic": 1,
    "normality": 1,
    "ataa": 1,
    "suchastextdata": 1,
    "toec": 1,
    "onom": 3,
    "icfo": 1,
    "support": 1,
    "autoenconders": 1,
    "factor": 1,
    "andmanymore": 1,
    "orfi": 1,
    "nanc": 1,
    "ialf": 1,
    "asti": 1,
    "acknowledgments": 1,
    "thesecond": 1,
    "wear": 1,
    "eals": 1,
    "ogra": 1,
    "tefu": 1,
    "lto": 1,
    "francisx": 1,
    "danielborup": 1,
    "orcid": 2,
    "org": 2,
    "endnotes": 1,
    "surv": 1,
    "eywi": 1,
    "llno": 1,
    "sentence": 1,
    "programming": 1,
    "computers": 1,
    "experience": 1,
    "eventually": 1,
    "eliminate": 1,
    "seesamuel": 1,
    "nceo": 1,
    "orac": 1,
    "lepr": 1,
    "oper": 1,
    "signconsistency": 2,
    "appe": 1,
    "inzh": 1,
    "aoan": 1,
    "dyu": 1,
    "opul": 1,
    "none": 1,
    "inste": 1,
    "adofe": 1,
    "xactl": 1,
    "yzero": 1,
    "nsta": 1,
    "blep": 1,
    "ctor": 2,
    "hasl": 1,
    "intuitively": 1,
    "tivemodel": 1,
    "genreetal": 1,
    "realized": 1,
    "oxford": 3,
    "ox": 1,
    "ac": 1,
    "uk": 2,
    "assets": 1,
    "ad\u00e1mek": 1,
    "smeekes": 2,
    "wilms": 1,
    "oinf": 1,
    "eren": 1,
    "cefo": 1,
    "rhig": 1,
    "nalt": 1,
    "imes": 2,
    "erie": 2,
    "technicalreport": 13,
    "arxiv": 10,
    "bluteau": 1,
    "boudt": 1,
    "sefo": 1,
    "gusi": 1,
    "thousandsofnews": 1,
    "dsen": 1,
    "ntva": 1,
    "lues": 1,
    "audrino": 1,
    "oing": 1,
    "del": 1,
    "dynamics": 1,
    "omet": 7,
    "ricr": 3,
    "ghysels": 3,
    "striaukas": 3,
    "renc": 2,
    "balkin": 1,
    "ord": 1,
    "automatic": 1,
    "network": 4,
    "modeling": 1,
    "univariate": 1,
    "international": 1,
    "jour": 17,
    "nalo": 16,
    "ffor": 4,
    "ieee": 4,
    "tran": 2,
    "sact": 2,
    "onin": 1,
    "ory": 1,
    "bartlett": 1,
    "traskin": 1,
    "adab": 1,
    "oost": 1,
    "isco": 1,
    "basu": 1,
    "michailidis": 1,
    "annals": 3,
    "ofstatistics": 2,
    "chernozhukov": 3,
    "nalc": 1,
    "ontr": 1,
    "revi": 3,
    "ewof": 2,
    "omic": 4,
    "stud": 1,
    "ies": 1,
    "christensen": 1,
    "m\u00fchlbach": 1,
    "rapach": 1,
    "sch\u00fctte": 1,
    "now": 1,
    "nald": 1,
    "aily": 1,
    "netsearch": 1,
    "volumedata": 1,
    "ssrn": 1,
    "breiman": 2,
    "bagg": 1,
    "machinelearning": 4,
    "randomforests": 1,
    "matching": 1,
    "pursuit": 1,
    "type": 1,
    "basis": 2,
    "sear": 1,
    "chre": 1,
    "port": 1,
    "narf": 1,
    "\u00fcrst": 1,
    "tik": 1,
    "eth": 2,
    "vol": 5,
    "seminar": 1,
    "f\u00fcrstatistik": 1,
    "boostingforhigh": 1,
    "nall": 1,
    "anna": 10,
    "lsof": 10,
    "callot": 3,
    "adaptive": 2,
    "inn": 1,
    "haldrup": 2,
    "meitz": 2,
    "saikkonen": 2,
    "eds": 3,
    "essaysin": 1,
    "oxfo": 2,
    "rdun": 2,
    "iver": 2,
    "foliochoice": 1,
    "chan": 1,
    "chen": 5,
    "stics": 1,
    "andit": 1,
    "sinte": 1,
    "rface": 1,
    "nonp": 1,
    "etri": 2,
    "cmod": 1,
    "inj": 1,
    "heckman": 1,
    "leamer": 1,
    "hand": 1,
    "book": 1,
    "ofec": 2,
    "pp": 8,
    "elsevier": 2,
    "donoho": 1,
    "saunders": 1,
    "siamreview": 1,
    "racine": 1,
    "swanson": 4,
    "para": 1,
    "metr": 1,
    "icar": 1,
    "xneu": 1,
    "ral": 1,
    "nfla": 1,
    "shen": 1,
    "econometrica": 5,
    "chetverikov": 2,
    "demirer": 2,
    "duflo": 2,
    "newey": 2,
    "dou": 2,
    "ble": 2,
    "debiased": 1,
    "amer": 1,
    "ican": 1,
    "ew": 1,
    "robins": 1,
    "rics": 3,
    "nal": 2,
    "chinco": 1,
    "clark": 1,
    "joseph": 1,
    "ye": 1,
    "sesi": 1,
    "gnal": 1,
    "sint": 1,
    "hecr": 1,
    "oss": 1,
    "sect": 1,
    "fret": 1,
    "urns": 1,
    "ffin": 1,
    "leroux": 1,
    "stevanovic": 1,
    "surprenant": 1,
    "cfor": 1,
    "penn": 1,
    "sylv": 1,
    "ania": 1,
    "math": 1,
    "emat": 1,
    "icso": 1,
    "fcon": 1,
    "trol": 1,
    "signals": 1,
    "systems": 1,
    "davis": 1,
    "reti": 1,
    "cald": 1,
    "evel": 1,
    "opme": 1,
    "nts": 1,
    "electronic": 1,
    "fsta": 1,
    "tist": 6,
    "twen": 1,
    "tyye": 1,
    "arsl": 1,
    "ofdiebold": 1,
    "marianotests": 1,
    "shin": 2,
    "itsd": 1,
    "zedm": 1,
    "ixtu": 1,
    "reso": 1,
    "duffy": 1,
    "helmbold": 1,
    "elliott": 4,
    "gargano": 2,
    "timmermann": 5,
    "compl": 1,
    "etesu": 1,
    "bsetr": 1,
    "egres": 1,
    "nome": 7,
    "complete": 1,
    "annu": 1,
    "alre": 1,
    "view": 1,
    "ics": 5,
    "journalof": 2,
    "lv": 1,
    "roya": 2,
    "cals": 1,
    "ocie": 1,
    "seriesb": 5,
    "xue": 2,
    "annalsofstatis": 1,
    "tics": 3,
    "foresee": 1,
    "hagan": 1,
    "gauss": 1,
    "newyork": 3,
    "agra": 1,
    "tboo": 1,
    "gmac": 1,
    "realization": 1,
    "mappings": 1,
    "thecaseofbrazil": 1,
    "genre": 1,
    "kenny": 1,
    "meyler": 1,
    "comb": 1,
    "inin": 1,
    "gexp": 1,
    "ertf": 1,
    "cana": 1,
    "nyth": 1,
    "ingb": 1,
    "eatt": 1,
    "simpleaverage": 1,
    "giacomini": 1,
