{
    "special": 4,
    "issue": 1,
    "forecasting": 17,
    "ricardop": 1,
    "masini": 3,
    "marceloc": 3,
    "medeiroseduardof": 1,
    "mendes": 6,
    "learning": 8,
    "princetonuniversity": 1,
    "usa": 1,
    "getulio": 2,
    "vargasfoundation": 2,
    "brazil": 4,
    "departmentofeconomics": 1,
    "pontifical": 1,
    "correspondence": 1,
    "medeiros": 28,
    "pontificalcatholic": 1,
    "ruamarqus": 1,
    "desovicente": 1,
    "gvea": 1,
    "riodejaneiro": 1,
    "rj": 1,
    "email": 1,
    "mcm": 1,
    "econ": 1,
    "puc": 1,
    "rio": 1,
    "br": 1,
    "fundinginformation": 1,
    "cnpqandcapes": 1,
    "conselhonacionalde": 1,
    "this": 10,
    "paper": 6,
    "survey": 3,
    "most": 7,
    "recent": 2,
    "advances": 1,
    "supervised": 3,
    "machine": 5,
    "ml": 7,
    "high": 13,
    "dimensional": 15,
    "models": 26,
    "time": 13,
    "series": 12,
    "among": 2,
    "linear": 7,
    "methods": 8,
    "pay": 2,
    "attention": 2,
    "penal": 2,
    "thenonlinear": 1,
    "considered": 4,
    "include": 2,
    "shallow": 2,
    "deep": 3,
    "neural": 9,
    "networks": 5,
    "their": 5,
    "feedforward": 2,
    "recurrent": 1,
    "versions": 2,
    "tree": 3,
    "based": 2,
    "such": 6,
    "random": 7,
    "forests": 5,
    "boosted": 1,
    "trees": 4,
    "also": 5,
    "consider": 7,
    "ability": 2,
    "briefly": 1,
    "reviewed": 1,
    "finally": 10,
    "discuss": 2,
    "appli": 1,
    "illustrationwithhigh": 1,
    "frequencyfinancialdata": 1,
    "keywords": 1,
    "bagging": 3,
    "boosting": 4,
    "nonlinear": 8,
    "penalized": 6,
    "regressions": 8,
    "ran": 1,
    "domforests": 1,
    "regressiontrees": 2,
    "regularization": 2,
    "sieveapproximation": 1,
    "jel": 1,
    "classification": 1,
    "c": 6,
    "introduction": 1,
    "methodstoeconomicand": 1,
    "financialtime": 1,
    "seriesforecasting": 2,
    "modelselec": 1,
    "tion": 3,
    "withtheavailability": 1,
    "johnwiley": 1,
    "sonsltd": 1,
    "jeconsurv": 2,
    "wileyonlinelibrary": 4,
    "com": 78,
    "journal": 6,
    "joes": 37,
    "masinietal": 36,
    "bigdata": 1,
    "tance": 1,
    "however": 15,
    "whatisml": 1,
    "last": 1,
    "few": 1,
    "years": 2,
    "there": 7,
    "myriad": 1,
    "definitions": 1,
    "literature": 4,
    "one": 4,
    "well": 4,
    "samuelwhodefinesmlas": 1,
    "we": 1,
    "with": 28,
    "powerful": 1,
    "statistical": 5,
    "learn": 2,
    "discover": 1,
    "hidden": 6,
    "patterns": 1,
    "rich": 3,
    "data": 11,
    "sets": 4,
    "that": 21,
    "sense": 2,
    "theory": 3,
    "gives": 1,
    "foundation": 1,
    "therefore": 11,
    "about": 1,
    "developments": 1,
    "not": 3,
    "general": 3,
    "going": 1,
    "focus": 2,
    "statisticalmodels": 1,
    "unsupervised": 1,
    "wherethetaskistolearn": 1,
    "explanatoryvariables": 1,
    "toanoutput": 1,
    "dependentvariable": 1,
    "basedon": 1,
    "dataorganizedasinput": 1,
    "outputpairs": 1,
    "regressionmodels": 1,
    "forexample": 9,
    "belongtothisclass": 1,
    "onthe": 1,
    "otherhand": 1,
    "players": 2,
    "alfago": 1,
    "forinstance": 6,
    "likebanditproblems": 1,
    "presented": 3,
    "here": 2,
    "roughly": 1,
    "divided": 1,
    "two": 2,
    "groups": 2,
    "first": 4,
    "matedbyregularization": 1,
    "alsoknownasshrinkage": 1,
    "papers": 4,
    "by": 88,
    "willard": 1,
    "james": 3,
    "charles": 1,
    "stein": 4,
    "who": 1,
    "popularized": 1,
    "bias": 1,
    "variance": 1,
    "trade": 2,
    "off": 2,
    "sta": 1,
    "tistical": 1,
    "estimation": 12,
    "start": 1,
    "considering": 1,
    "ridge": 3,
    "regres": 2,
    "afterthat": 1,
    "shrinkageandselection": 1,
    "lasso": 18,
    "estimatoroftibshirani": 1,
    "anditsmanyextensions": 1,
    "wealso": 1,
    "arealsoreviewed": 1,
    "wecoverthistopicinsec": 1,
    "grenander": 2,
    "continue": 1,
    "analyzing": 1,
    "specific": 2,
    "cases": 1,
    "our": 1,
    "gen": 1,
    "eralsetup": 1,
    "morespecifically": 3,
    "nns": 1,
    "bothintheirshallow": 1,
    "rnns": 1,
    "andtree": 1,
    "rfs": 1,
    "andboostedtrees": 1,
    "thesuc": 1,
    "cessispartlyduetothe": 1,
    "inouropinion": 1,
    "contrary": 1,
    "what": 1,
    "been": 1,
    "boasted": 1,
    "early": 3,
    "empirical": 2,
    "success": 1,
    "nn": 7,
    "metric": 1,
    "basedmeth": 1,
    "crs": 1,
    "elliottetal": 2,
    "furthermore": 4,
    "hybridmethods": 2,
    "whereideas": 1,
    "downloaded": 35,
    "from": 41,
    "https": 73,
    "onlinelibrary": 70,
    "wiley": 141,
    "doi": 36,
    "higher": 35,
    "education": 35,
    "commission": 35,
    "online": 70,
    "library": 70,
    "see": 39,
    "terms": 73,
    "conditions": 72,
    "rules": 36,
    "use": 37,
    "oa": 35,
    "articles": 35,
    "governed": 35,
    "applicable": 35,
    "creative": 35,
    "commons": 35,
    "license": 35,
    "generalframework": 1,
    "aquickwordonnotation": 1,
    "anuppercaseletterasin": 1,
    "lowercaseletter": 1,
    "nonrandom": 1,
    "quantity": 1,
    "boldlettersasin": 1,
    "thesymbol": 1,
    "denotesthe": 1,
    "normofavector": 1,
    "foraset": 1,
    "weuse": 1,
    "todenoteitscardinality": 1,
    "givenasamplewith": 1,
    "thegoalistopredict": 1,
    "forhorizonsh": 1,
    "throughoutthepaper": 1,
    "assumption": 1,
    "generating": 1,
    "process": 1,
    "dgp": 1,
    "let": 7,
    "be": 1,
    "covariance": 1,
    "stationary": 1,
    "excluding": 1,
    "important": 2,
    "nonstationary": 1,
    "processes": 2,
    "usually": 5,
    "appear": 1,
    "seriesapplications": 1,
    "inparticular": 2,
    "byassumption": 1,
    "usuallypredetermined": 1,
    "integers": 1,
    "and": 13,
    "definethe": 1,
    "dimensionalvectorofpre": 1,
    "dictors": 1,
    "where": 26,
    "following": 1,
    "directforecastingmodel": 1,
    "ris": 1,
    "an": 7,
    "unknown": 2,
    "measurable": 1,
    "function": 2,
    "themodel": 1,
    "orsim": 1,
    "hontothespacespannedby": 1,
    "ourtargetbecomes": 1,
    "forh": 1,
    "hisunknown": 1,
    "targetfunction": 1,
    "given": 2,
    "estimate": 2,
    "hfor": 3,
    "next": 1,
    "step": 2,
    "evaluate": 1,
    "method": 4,
    "estimat": 1,
    "tity": 1,
    "theterm": 1,
    "predictionconsistency": 1,
    "referstoestimators": 1,
    "suchthat": 3,
    "as": 2,
    "asopposed": 1,
    "toitsconditional": 1,
    "tionalon": 1,
    "clearly": 1,
    "ifthelatterholdsfor": 1,
    "almost": 1,
    "every": 1,
    "ofiteratedexpectation": 1,
    "norminducedbyeitherthe": 1,
    "ortheconditionalone": 1,
    "byfar": 1,
    "themostusedarethe": 1,
    "conditional": 4,
    "when": 8,
    "or": 7,
    "rootmean": 1,
    "squaredpredictionerror": 1,
    "which": 6,
    "simply": 1,
    "thesquare": 1,
    "root": 1,
    "those": 1,
    "measuresof": 1,
    "inequality": 1,
    "underthechoice": 1,
    "ofalossfunction": 1,
    "thegoalistoselect": 1,
    "givenanestimate": 1,
    "squarederror": 1,
    "correspondingto": 1,
    "riskfunctions": 1,
    "respectively": 8,
    "seegrangerandmachina": 1,
    "elliottandtimmermann": 1,
    "fora": 1,
    "amorerecentreview": 1,
    "summaryofthepaper": 1,
    "section": 2,
    "reviewspenalized": 1,
    "linearregressionmodels": 1,
    "ensembleandhybrid": 1,
    "ity": 1,
    "application": 2,
    "conclude": 1,
    "some": 5,
    "penalizedlinearmodels": 1,
    "eters": 1,
    "notice": 1,
    "drop": 1,
    "subscript": 1,
    "clarity": 1,
    "model": 23,
    "theparameter": 1,
    "these": 1,
    "seriesanalysis": 1,
    "suchaspredic": 1,
    "tiveregressions": 1,
    "variables": 12,
    "amongmanyothers": 1,
    "hamilton": 2,
    "becomes": 2,
    "whereundersquaredloss": 1,
    "honto": 1,
    "whichis": 1,
    "welldefinedwhenever": 1,
    "isnonsingular": 1,
    "inthatcase": 1,
    "hisorthogonalto": 1,
    "bycon": 1,
    "squares": 1,
    "ols": 4,
    "andsometimes": 1,
    "thesamplecounterpartof": 1,
    "isrankdeficient": 1,
    "infact": 1,
    "defined": 1,
    "it": 10,
    "case": 4,
    "large": 9,
    "possibly": 3,
    "larger": 1,
    "than": 3,
    "number": 6,
    "observations": 1,
    "problem": 1,
    "ball": 1,
    "around": 1,
    "origin": 1,
    "shown": 1,
    "although": 3,
    "biased": 1,
    "restricted": 1,
    "mse": 5,
    "hastie": 6,
    "etal": 4,
    "chap": 2,
    "andchap": 1,
    "inpenalizedregressions": 1,
    "theestimator": 2,
    "minimizesthe": 1,
    "lagrangianform": 1,
    "isapenaltyfunc": 1,
    "depends": 2,
    "tuning": 1,
    "parameter": 3,
    "controls": 1,
    "between": 2,
    "good": 2,
    "if": 11,
    "since": 1,
    "wellasonthedata": 1,
    "naturally": 2,
    "different": 4,
    "ridgeregression": 2,
    "theideawastointroducea": 1,
    "smallbiasbut": 1,
    "inturn": 1,
    "tikhonov": 5,
    "arsenin": 2,
    "normofthe": 1,
    "parametervector": 2,
    "thatis": 1,
    "thepenaltyin": 2,
    "isgivenby": 3,
    "wherethe": 1,
    "butneverreach": 1,
    "ing": 2,
    "exactly": 1,
    "zero": 1,
    "cannot": 1,
    "used": 1,
    "selecting": 2,
    "predictors": 4,
    "unless": 1,
    "truncation": 1,
    "schemeisemployed": 1,
    "andchenetal": 1,
    "asamethodtoregularize": 1,
    "ismuch": 1,
    "et": 18,
    "al": 19,
    "penalty": 4,
    "smallest": 1,
    "convex": 1,
    "yn": 1,
    "mt": 1,
    "ty": 1,
    "sparse": 3,
    "solutions": 1,
    "wesaythesolutionis": 1,
    "sparseifonlyasubset": 1,
    "coefficientsarenonzero": 1,
    "inother": 1,
    "words": 1,
    "hence": 1,
    "lassoismostusefulwhen": 1,
    "alargenumberofalterna": 1,
    "adaptivelasso": 1,
    "theadaptivelasso": 1,
    "adalasso": 4,
    "wasproposedbyzou": 1,
    "italsohas": 1,
    "butenjoysthe": 1,
    "oracleproperty": 4,
    "meaningthatit": 1,
    "enterthemodel": 1,
    "stepestimation": 1,
    "usinglassoasthefirst": 1,
    "elasticnet": 1,
    "theelasticnet": 1,
    "elnet": 1,
    "whilethe": 1,
    "predictorsbecomehigh": 1,
    "asaconsequence": 1,
    "racyoverthelasso": 1,
    "zou": 7,
    "zhang": 6,
    "penalties": 2,
    "zouandzhang": 1,
    "theelnetand": 1,
    "ofbothmethods": 1,
    "wherethefirst": 1,
    "stepestimatorcomes": 1,
    "fromtheelnet": 1,
    "fan": 4,
    "li": 6,
    "approach": 4,
    "covers": 1,
    "collection": 3,
    "functions": 6,
    "satisfying": 1,
    "set": 11,
    "properties": 2,
    "away": 1,
    "inthisway": 1,
    "each": 7,
    "note": 2,
    "thatunlikelasso": 1,
    "thepenaltymaydependon": 1,
    "inanonlinearway": 1,
    "wesetthepenaltyin": 1,
    "unlikeols": 1,
    "orlasso": 1,
    "nevertheless": 5,
    "fanetal": 1,
    "show": 9,
    "ed": 1,
    "otherpenalties": 1,
    "inadata": 1,
    "richenvironment": 1,
    "ourpredictionproblem": 1,
    "mostusedpenalties": 1,
    "intime": 2,
    "thegrouplasso": 1,
    "proposedbyyuanandlin": 1,
    "biningthe": 1,
    "norms": 1,
    "factors": 1,
    "denotedby": 1,
    "groupsofregressorsas": 1,
    "values": 1,
    "denoteapartitionof": 1,
    "thecorrespond": 1,
    "regression": 14,
    "subvector": 1,
    "group": 2,
    "assign": 1,
    "v": 1,
    "isthecardinalityofaset": 1,
    "thegroup": 1,
    "yang": 3,
    "theadaptivegroup": 1,
    "algorithm": 8,
    "wang": 3,
    "leng": 2,
    "inthegrouplasso": 1,
    "simonetal": 1,
    "parkandsakaori": 1,
    "mation": 2,
    "konzenandziegelmann": 1,
    "theyobservethat": 1,
    "bayesian": 1,
    "interpretation": 1,
    "seen": 1,
    "maximum": 1,
    "posteriori": 1,
    "estimator": 5,
    "gaussian": 5,
    "sionwithindependent": 1,
    "equivariant": 1,
    "gaussianpriors": 1,
    "laplaceprior": 1,
    "hans": 2,
    "park": 6,
    "casella": 2,
    "shrinkagemethods": 1,
    "thissurvey": 2,
    "theoreticalproperties": 1,
    "inthissection": 2,
    "previously": 1,
    "discussed": 1,
    "results": 6,
    "selectionconsistency": 1,
    "andoraclebounds": 1,
    "fixed": 6,
    "butpossiblylargerthan": 1,
    "andhighdimension": 1,
    "increaseswith": 1,
    "usuallyfaster": 1,
    "moreprecisely": 1,
    "thatminimizesequation": 1,
    "overrepeatedsamples": 1,
    "arenonnull": 1,
    "wesayamethodis": 1,
    "inprobability": 1,
    "norm": 1,
    "consistentifforevery": 1,
    "noritisimpliedby": 1,
    "consistency": 11,
    "asamatteroffact": 1,
    "selection": 11,
    "performance": 4,
    "procedure": 3,
    "further": 1,
    "broke": 1,
    "down": 1,
    "how": 4,
    "many": 2,
    "relevant": 4,
    "are": 2,
    "included": 2,
    "screening": 1,
    "irrelevant": 1,
    "excluded": 1,
    "probability": 1,
    "regressors": 3,
    "theseboundsrequire": 1,
    "elsandarateconditionon": 1,
    "was": 3,
    "originally": 1,
    "developed": 1,
    "design": 4,
    "independent": 1,
    "identically": 1,
    "dis": 1,
    "tributed": 1,
    "iid": 1,
    "errors": 5,
    "knightandfu": 1,
    "mator": 1,
    "authors": 4,
    "framework": 3,
    "clear": 2,
    "toour": 1,
    "knowledge": 1,
    "thefirst": 1,
    "work": 4,
    "expanding": 1,
    "theresultsto": 1,
    "adependentsettingwas": 1,
    "wangetal": 1,
    "authorsshowthatlasso": 1,
    "whereasamodifiedlasso": 1,
    "similartotheadalasso": 1,
    "isbothmodel": 1,
    "nardiandrinaldo": 1,
    "showmodelselection": 1,
    "chanandchen": 1,
    "yoonetal": 1,
    "andscad": 1,
    "sangandsun": 1,
    "kock": 7,
    "meaningthat": 1,
    "insparse": 2,
    "seriessettings": 2,
    "atsome": 1,
    "ratefasterthan": 1,
    "medeirosandmendes": 3,
    "property": 2,
    "difference": 1,
    "martingale": 1,
    "strong": 1,
    "mixing": 1,
    "andnon": 1,
    "gaussianinnovations": 1,
    "itincludes": 1,
    "predictiveregressions": 1,
    "autoregressivemodels": 2,
    "autoregressive": 5,
    "exogenous": 1,
    "dynamic": 2,
    "lags": 1,
    "conditionally": 1,
    "heteroskedastic": 1,
    "xie": 2,
    "oracle": 5,
    "mixingerrors": 2,
    "wuandwu": 1,
    "deriveoraclebounds": 1,
    "weak": 1,
    "dependent": 4,
    "innovations": 2,
    "wu": 4,
    "whereashanandtsay": 1,
    "withinthe": 1,
    "xueandtaniguchi": 1,
    "seriesregressionswith": 1,
    "long": 1,
    "memoryinnovations": 1,
    "fanandli": 1,
    "kimetal": 1,
    "showedthatthescadalso": 1,
    "uematsuandtanaka": 1,
    "ledereretal": 1,
    "problems": 2,
    "seriesproblems": 1,
    "babiietal": 2,
    "proposedthesparse": 1,
    "dimensionaltime": 2,
    "theauthorsderived": 1,
    "integratedtime": 1,
    "settings": 1,
    "lee": 4,
    "shi": 2,
    "dk": 1,
    "oe": 1,
    "ta": 1,
    "smeeksandwijler": 2,
    "proposed": 6,
    "single": 2,
    "equation": 2,
    "error": 2,
    "correction": 1,
    "selector": 1,
    "specs": 1,
    "automated": 2,
    "hsuetal": 1,
    "showmodel": 1,
    "vector": 3,
    "var": 1,
    "white": 9,
    "noise": 1,
    "shocks": 1,
    "ren": 2,
    "afterward": 1,
    "callotandkock": 1,
    "inhigh": 1,
    "dimensionalsettings": 1,
    "wherethedimensionofthe": 1,
    "kockandcallot": 1,
    "andbasuandmichailidis": 1,
    "extendingpreviousworks": 1,
    "melnykandbanerjee": 1,
    "zhu": 2,
    "derives": 1,
    "bounds": 2,
    "folded": 1,
    "concave": 1,
    "tiesforgaussian": 1,
    "modelsinhighdimensions": 1,
    "morerecently": 6,
    "wongetal": 1,
    "mixingprocesswithsub": 1,
    "weibull": 1,
    "marginaldistributions": 1,
    "deriveequation": 1,
    "matorofweaklysparse": 1,
    "inference": 5,
    "ficientsarelargeenough": 1,
    "minrestriction": 2,
    "very": 7,
    "being": 1,
    "even": 1,
    "bimodal": 1,
    "instance": 1,
    "leeb": 3,
    "ptscher": 3,
    "andbellonietal": 1,
    "foradetaileddiscussion": 1,
    "after": 1,
    "actually": 1,
    "active": 1,
    "area": 1,
    "research": 3,
    "vast": 1,
    "num": 1,
    "ber": 1,
    "recently": 6,
    "appeared": 1,
    "van": 1,
    "de": 1,
    "geer": 1,
    "desparsified": 1,
    "order": 1,
    "construct": 2,
    "asymptotically": 1,
    "valid": 1,
    "confidence": 2,
    "interval": 1,
    "theaddition": 1,
    "extra": 1,
    "term": 2,
    "unbiased": 1,
    "longer": 1,
    "esti": 1,
    "moreimportantly": 1,
    "thesensethatv": 1,
    "ate": 1,
    "regularity": 1,
    "surprisingly": 1,
    "condition": 1,
    "can": 1,
    "approximated": 1,
    "particular": 1,
    "propose": 2,
    "run": 2,
    "onto": 1,
    "for": 1,
    "nodewide": 1,
    "refertosection": 1,
    "invandegeeretal": 1,
    "fordetails": 1,
    "belloni": 3,
    "put": 1,
    "forward": 1,
    "double": 2,
    "context": 1,
    "form": 1,
    "interest": 1,
    "lies": 1,
    "scalar": 1,
    "parame": 1,
    "ter": 1,
    "control": 1,
    "consists": 2,
    "regressorsinthehigh": 1,
    "sions": 1,
    "nb": 1,
    "y": 1,
    "obtained": 1,
    "oncetheset": 1,
    "isidentified": 1,
    "priori": 1,
    "estimated": 3,
    "nonzero": 1,
    "parameters": 2,
    "low": 4,
    "main": 1,
    "result": 1,
    "theorem": 2,
    "states": 4,
    "underwhichtheestimator": 1,
    "normal": 1,
    "canbeconstructedin": 1,
    "theusualfashion": 1,
    "similartotayloretal": 1,
    "andlockhartetal": 2,
    "leeetal": 1,
    "putforwardgeneral": 1,
    "theauthorsargue": 1,
    "details": 1,
    "andtayloretal": 1,
    "isthatintheformer": 1,
    "whilevandegeeretal": 1,
    "bellonietal": 1,
    "seriesenvironment": 2,
    "hecqetal": 1,
    "isoneofthefirst": 1,
    "a": 7,
    "andadmeketal": 1,
    "totime": 1,
    "seriesframework": 1,
    "more": 4,
    "specifically": 1,
    "babii": 4,
    "underheteroskedastic": 1,
    "autocorrelated": 1,
    "heteroskedaticity": 1,
    "autocorrelation": 2,
    "consistent": 1,
    "hac": 1,
    "they": 1,
    "debi": 1,
    "ased": 1,
    "central": 1,
    "limit": 1,
    "coefficients": 1,
    "study": 2,
    "hacestimatorofthelong": 1,
    "grouplassoresiduals": 1,
    "admeket": 1,
    "seriessettingundernear": 1,
    "epochdependence": 1,
    "assumptions": 1,
    "allowingfornon": 1,
    "fur": 1,
    "thermore": 1,
    "nonlinearmodels": 1,
    "thefunction": 1,
    "happearingin": 1,
    "agenericfunctionspace": 1,
    "isinfea": 1,
    "sible": 1,
    "infinite": 2,
    "efficient": 2,
    "technique": 1,
    "search": 1,
    "over": 2,
    "course": 1,
    "asforinstance": 1,
    "tersvirta": 9,
    "suarez": 2,
    "fariasetal": 2,
    "mcaleer": 5,
    "review": 1,
    "suchmodels": 1,
    "alternatively": 1,
    "wecanreplace": 1,
    "bysimplerandfinite": 1,
    "theideaistoconsidera": 1,
    "sequenceoffinite": 1,
    "dimensionalspaces": 1,
    "sievespaces": 1,
    "thatconvergesto": 1,
    "somenorm": 1,
    "iswrittenas": 1,
    "isthe": 2,
    "thbasisfunctionfor": 1,
    "ofparameters": 1,
    "willdepend": 1,
    "sample": 5,
    "size": 2,
    "dimension": 1,
    "space": 5,
    "arg": 1,
    "min": 2,
    "lying": 1,
    "fundamental": 1,
    "concept": 1,
    "dense": 2,
    "beingametricspace": 1,
    "isdensein": 1,
    "ifforany": 1,
    "thereisa": 1,
    "sieves": 2,
    "fortime": 1,
    "seriesdata": 1,
    "seechen": 1,
    "example": 6,
    "approximating": 1,
    "know": 1,
    "proper": 1,
    "subset": 3,
    "polynomials": 1,
    "continuous": 3,
    "polynomi": 1,
    "als": 1,
    "smaller": 2,
    "simpler": 1,
    "natural": 1,
    "bymaking": 1,
    "thesetofpolyno": 1,
    "mials": 1,
    "degree": 1,
    "equal": 1,
    "including": 2,
    "constant": 1,
    "linearsieves": 1,
    "andmethodslikeols": 1,
    "inthiscase": 2,
    "thedimension": 1,
    "thevectorofparameters": 1,
    "canbeestimatedby": 1,
    "designmatrixand": 1,
    "nonlinearsieves": 1,
    "nonlinearleast": 1,
    "inthispaper": 2,
    "nnsandregressiontrees": 1,
    "figure": 12,
    "neuralnetworks": 4,
    "shallownn": 1,
    "traditional": 1,
    "classified": 1,
    "into": 1,
    "isdefinedas": 1,
    "intheabovemodel": 1,
    "thebasisfunctions": 1,
    "called": 3,
    "weights": 1,
    "sum": 1,
    "neurons": 3,
    "specification": 3,
    "represent": 2,
    "input": 3,
    "layer": 4,
    "covariates": 3,
    "thefigure": 1,
    "layers": 2,
    "five": 1,
    "elements": 1,
    "intheearlydays": 1,
    "waschosen": 1,
    "definition": 1,
    "afunction": 1,
    "isasquashing": 1,
    "sigmoid": 1,
    "functionifitisnon": 1,
    "decreasing": 1,
    "lim": 1,
    "andlim": 1,
    "historically": 1,
    "logistic": 5,
    "exp": 6,
    "hyperbolictangent": 1,
    "funahashi": 2,
    "providedthat": 1,
    "issufficientlylarge": 1,
    "cybenko": 3,
    "andhornik": 1,
    "barron": 2,
    "stinchcombe": 2,
    "sandberg": 2,
    "derived": 2,
    "same": 2,
    "andhorniketal": 1,
    "moid": 1,
    "basisfunctions": 1,
    "rbf": 1,
    "definedas": 1,
    "radialbasis": 1,
    "yarotsky": 2,
    "relu": 1,
    "rectifiedlinearunit": 1,
    "max": 1,
    "bydefining": 1,
    "andcan": 1,
    "argmin": 2,
    "isunfeasible": 1,
    "whereusually": 1,
    "traditionally": 1,
    "istouse": 1,
    "mackay": 3,
    "b": 6,
    "andforeseeandhagan": 1,
    "amore": 1,
    "dropout": 1,
    "srivastavaetal": 1,
    "fromthennduring": 1,
    "annnwith": 1,
    "possible": 2,
    "thinned": 1,
    "dropoutsamplesfromthis": 1,
    "samplednn": 1,
    "wemodifyequation": 1,
    "ofbeingequalto": 1,
    "insteadof": 1,
    "foreachtrainingexample": 1,
    "thefinalestimatesfor": 1,
    "aremultipliedby": 1,
    "deepnns": 1,
    "wheremorehiddenlayers": 1,
    "inthefigure": 1,
    "werepresentadeepnnwith": 1,
    "thenumberofhidden": 1,
    "shallownns": 1,
    "units": 1,
    "define": 2,
    "then": 3,
    "theoutput": 1,
    "oflayer": 1,
    "isgivenrecursivelyby": 1,
    "broadlyspeaking": 1,
    "rnnscanuse": 1,
    "theirinternalstate": 1,
    "memory": 3,
    "architectureofthelong": 1,
    "short": 2,
    "termmemorycell": 1,
    "lstm": 4,
    "isthepredictionof": 1,
    "arefunctions": 1,
    "tobedefined": 1,
    "iswhatwecallthe": 1,
    "state": 3,
    "fromatime": 1,
    "seriesperspective": 1,
    "rnnscan": 1,
    "spacemodel": 1,
    "previousones": 1,
    "asintime": 1,
    "seriesmodels": 3,
    "fromthevanishing": 1,
    "setthecostfunctiontobe": 1,
    "beverysmallordiverge": 1,
    "fortunately": 1,
    "andschmidhuber": 1,
    "termmemory": 2,
    "net": 2,
    "several": 2,
    "red": 1,
    "circles": 1,
    "indicate": 1,
    "activation": 1,
    "while": 2,
    "blue": 1,
    "cir": 1,
    "thesymbols": 1,
    "mathematically": 1,
    "initiatewith": 1,
    "giventheinput": 1,
    "tanh": 1,
    "informationflowinan": 1,
    "ltsmcell": 1,
    "atwileyonlinelibrary": 1,
    "element": 1,
    "cell": 2,
    "forget": 1,
    "ouput": 1,
    "gates": 1,
    "introduces": 1,
    "bit": 1,
    "so": 1,
    "remember": 1,
    "past": 2,
    "learns": 1,
    "keep": 1,
    "only": 4,
    "information": 2,
    "makepredictions": 1,
    "awayfromthecellstate": 1,
    "blockattime": 1,
    "hiddenneurons": 1,
    "forgetgate": 1,
    "withthenewinfor": 1,
    "notethat": 1,
    "theinputand": 1,
    "informationfrom": 1,
    "previous": 2,
    "signal": 1,
    "will": 1,
    "combined": 2,
    "output": 1,
    "gate": 1,
    "flowsinanlstmcell": 1,
    "exampleofasimpletree": 1,
    "local": 2,
    "predictions": 1,
    "using": 6,
    "recursive": 1,
    "partitioning": 1,
    "may": 1,
    "represented": 1,
    "graph": 1,
    "left": 1,
    "side": 1,
    "equivalent": 2,
    "supposethat": 1,
    "want": 1,
    "predict": 2,
    "scores": 1,
    "basketball": 1,
    "height": 1,
    "weight": 1,
    "togrowatree": 1,
    "anoptimalobservation": 1,
    "inthesameexample": 1,
    "theobservationis": 1,
    "m": 1,
    "otherwise": 4,
    "above": 2,
    "expression": 1,
    "approximation": 2,
    "linearregressionon": 1,
    "dummyvariables": 1,
    "regions": 1,
    "leaves": 1,
    "parentnodes": 1,
    "therootnodeatposition": 1,
    "theparent": 2,
    "nodeatposition": 1,
    "hastwosplit": 1,
    "child": 1,
    "nodesatpositions": 1,
    "eachparentnodehas": 1,
    "athreshold": 1,
    "split": 1,
    "variableassociated": 1,
    "asthesets": 1,
    "givesanexample": 1,
    "intheexample": 1,
    "nodesare": 1,
    "andtheterminalnodesare": 1,
    "ifthepathtoleaf": 3,
    "includethe": 2,
    "childofparentnode": 2,
    "indexes": 1,
    "parent": 1,
    "nodes": 1,
    "path": 1,
    "leaf": 1,
    "randomforests": 2,
    "rf": 3,
    "specified": 1,
    "bootstrap": 1,
    "original": 2,
    "useablockbootstrap": 1,
    "supposethereare": 1,
    "bootstrapsamples": 1,
    "foreachsample": 1,
    "treewith": 1,
    "thefinalforecast": 1,
    "initialize": 1,
    "make": 2,
    "growa": 1,
    "small": 3,
    "treemodeltofit": 1,
    "update": 1,
    "randomvariables": 1,
    "scornetetal": 1,
    "totheunknownfunction": 1,
    "wagerandathey": 1,
    "provedconsistencyand": 1,
    "another": 2,
    "greedy": 1,
    "approximate": 2,
    "uses": 1,
    "base": 1,
    "learners": 1,
    "themodelweconsiderhere": 1,
    "calledgradientboosting": 1,
    "wasintro": 1,
    "ducedbyfriedman": 1,
    "forregressionproblems": 1,
    "duffyandhelmbold": 1,
    "derivedboundsonthe": 1,
    "zhangandyu": 2,
    "proveconvergence": 1,
    "bhlmann": 5,
    "thecaseof": 1,
    "demonstrated": 1,
    "types": 1,
    "stopping": 2,
    "related": 1,
    "sizes": 1,
    "suggested": 1,
    "friedman": 4,
    "jiang": 2,
    "lugosiandvayatis": 1,
    "bartlettandtraskin": 1,
    "andbhlmann": 1,
    "ateachiteration": 1,
    "sequentially": 1,
    "thispaper": 1,
    "itisrecommended": 1,
    "isclose": 1,
    "faster": 1,
    "convergence": 2,
    "rate": 1,
    "better": 1,
    "fit": 1,
    "likely": 1,
    "sampleresults": 1,
    "inaddition": 1,
    "thederivativeishighly": 1,
    "affectedbyoverfitting": 1,
    "evenifwelookatin": 1,
    "sampleestimates": 1,
    "alearningratebetween": 1,
    "medeirosandveiga": 1,
    "andsuarez": 1,
    "andinterpretparticu": 1,
    "asforexample": 1,
    "generalformsofsmooth": 1,
    "transition": 2,
    "restricts": 1,
    "specificsettings": 1,
    "analternative": 1,
    "asdescribedearlier": 1,
    "forwardnns": 1,
    "inthissetup": 1,
    "chenandshen": 2,
    "andchen": 4,
    "theconsistencyand": 1,
    "theirsetup": 1,
    "isdefinedasfollows": 1,
    "componentsofthemodel": 1,
    "isfixed": 1,
    "chernozhukovetal": 1,
    "theasymptoticresults": 1,
    "inchenandshen": 1,
    "inscornetetal": 1,
    "andw": 1,
    "ageretal": 1,
    "forthecaseofiiddata": 1,
    "davisand": 1,
    "nielsen": 3,
    "stochastic": 1,
    "prove": 1,
    "class": 1,
    "worth": 1,
    "mentioning": 1,
    "interesting": 1,
    "borup": 4,
    "baggingfortime": 2,
    "arrangethesetoftuples": 1,
    "intheformofamatrix": 1,
    "ofdimension": 1,
    "block": 1,
    "bydrawing": 1,
    "blocksof": 1,
    "rowsof": 1,
    "withreplacement": 1,
    "computethe": 1,
    "thbootstrapforecastas": 1,
    "honeachcovariatein": 1,
    "compute": 1,
    "sameasbeforebutwith": 1,
    "replacedby": 1,
    "othermethods": 1,
    "toreducethe": 1,
    "ian": 1,
    "zeroregres": 1,
    "tothesamplesize": 1,
    "inalgorithm": 1,
    "requires": 1,
    "modified": 2,
    "garcia": 3,
    "themotivation": 1,
    "optimal": 1,
    "hby": 1,
    "testing": 1,
    "combinations": 1,
    "inmostcases": 1,
    "unfeasible": 1,
    "foragivenset": 1,
    "possiblepredictors": 1,
    "variatemodelsfor": 1,
    "asisknownasthe": 1,
    "completesubset": 1,
    "increases": 1,
    "rapidly": 1,
    "moreover": 1,
    "inthesecases": 1,
    "itwassuggested": 1,
    "should": 3,
    "still": 1,
    "andmedeirosetal": 2,
    "dimensionalmodels": 3,
    "theideaistostart": 1,
    "fitting": 1,
    "hon": 1,
    "candidate": 1,
    "save": 1,
    "statistics": 6,
    "variable": 2,
    "andweselectthe": 1,
    "variablesthataremore": 1,
    "relevantintheranking": 1,
    "extended": 1,
    "todependentbyyousuf": 1,
    "largeset": 1,
    "basedestimationand": 1,
    "nnmodels": 1,
    "thenonlinearterms": 1,
    "traplettietal": 1,
    "motivation": 1,
    "component": 1,
    "capture": 2,
    "dependence": 2,
    "making": 1,
    "interpretable": 1,
    "spirit": 1,
    "semi": 2,
    "inspired": 1,
    "ideas": 1,
    "combining": 1,
    "adalassoandols": 1,
    "inthefirstone": 1,
    "calledrf": 1,
    "idea": 1,
    "selected": 1,
    "forest": 3,
    "second": 1,
    "named": 1,
    "works": 2,
    "opposite": 1,
    "direction": 1,
    "select": 1,
    "dieboldandshin": 1,
    "proposethe": 1,
    "partially": 2,
    "egalitarian": 2,
    "lassotocombinesur": 1,
    "veyforecasts": 1,
    "age": 1,
    "combination": 1,
    "survived": 1,
    "forecasts": 2,
    "considers": 1,
    "optimally": 1,
    "regularizedregression": 1,
    "closelyconnected": 1,
    "dieboldetal": 1,
    "inordertocon": 1,
    "forecastcomparison": 1,
    "consequently": 1,
    "comparedifferentmodels": 1,
    "inthedieboldandmariano": 1,
    "test": 2,
    "diebold": 6,
    "giacominiandwhite": 1,
    "mccracken": 2,
    "thedieboldand": 1,
    "mariano": 3,
    "anuncondi": 1,
    "uspa": 1,
    "testwasproposedbywhite": 1,
    "thenullhypothesis": 1,
    "hansen": 7,
    "showedthatwhite": 1,
    "ature": 1,
    "mcs": 2,
    "ofthedataset": 1,
    "whereas": 1,
    "importantly": 1,
    "themcsproceduredoesnot": 1,
    "cepa": 1,
    "itisimpor": 1,
    "conduct": 1,
    "predictive": 1,
    "abilitytests": 1,
    "insummary": 1,
    "financialforecasting": 1,
    "linearmethods": 1,
    "thereis": 1,
    "macroeconomic": 4,
    "certainly": 1,
    "successful": 1,
    "applications": 2,
    "inflationand": 2,
    "medeirosand": 1,
    "vasconcelos": 4,
    "showthathigh": 1,
    "onaverage": 1,
    "smallerfore": 1,
    "casting": 2,
    "econometric": 2,
    "shrinkage": 2,
    "csr": 1,
    "perform": 1,
    "real": 2,
    "brazilian": 1,
    "inflation": 2,
    "environ": 1,
    "ments": 1,
    "consideranapplication": 1,
    "toalargemacroeconomicu": 1,
    "petitive": 1,
    "medeirosetal": 2,
    "includingfactormod": 1,
    "els": 1,
    "ardia": 2,
    "introduce": 1,
    "text": 1,
    "sentiment": 1,
    "optimizes": 1,
    "purposes": 1,
    "apply": 1,
    "economic": 2,
    "growth": 3,
    "united": 3,
    "sandsofsentimentvalues": 1,
    "tarassow": 2,
    "monthly": 2,
    "uematsu": 2,
    "tanaka": 2,
    "theauthorsforecast": 1,
    "quarterly": 1,
    "gross": 1,
    "domestic": 1,
    "product": 1,
    "mixeddatasampling": 1,
    "midas": 1,
    "seealsobabiietal": 1,
    "findthatcom": 1,
    "audrinoandknaus": 1,
    "usedlasso": 1,
    "volatilities": 1,
    "callotetal": 1,
    "varianceinvestor": 1,
    "chincoetal": 1,
    "usethelassotomake": 1,
    "minute": 1,
    "nonlinearmethods": 1,
    "respect": 1,
    "were": 1,
    "atbest": 1,
    "forexam": 1,
    "ple": 1,
    "references": 2,
    "therein": 1,
    "majority": 1,
    "tersvirtaetal": 1,
    "andwhite": 1,
    "balkinandord": 1,
    "tkacz": 2,
    "heravietal": 1,
    "despite": 1,
    "skepticism": 1,
    "systematically": 1,
    "accurate": 1,
    "benchmarks": 1,
    "horizons": 1,
    "dominated": 1,
    "other": 1,
    "due": 1,
    "its": 2,
    "but": 1,
    "potential": 1,
    "nonlinearities": 1,
    "key": 1,
    "theauthors": 1,
    "largesetofpredictors": 1,
    "basedandneuralnetworks": 1,
    "coulombe": 2,
    "nomic": 1,
    "ensemble": 1,
    "forecast": 1,
    "employment": 1,
    "period": 2,
    "tivepower": 1,
    "borupetal": 1,
    "computenow": 1,
    "volumedataandmachine": 1,
    "learningmethods": 1,
    "empiricalillustration": 1,
    "bovespa": 1,
    "namely": 2,
    "thes": 1,
    "p": 1,
    "us": 1,
    "theftse": 1,
    "unitedkingdom": 1,
    "dax": 1,
    "germany": 1,
    "hangseng": 1,
    "hongkong": 1,
    "andnikkei": 1,
    "japan": 1,
    "minfrequency": 1,
    "thedatawereobtained": 1,
    "fromtheoxford": 1,
    "foreachstockindex": 1,
    "frequency": 1,
    "atday": 1,
    "benchmark": 2,
    "heterogeneous": 1,
    "har": 4,
    "corsi": 2,
    "log": 4,
    "asalternatives": 1,
    "sideredhere": 1,
    "weconsidertwo": 1,
    "thedatastartinfebru": 1,
    "ary": 1,
    "andendsinmay": 1,
    "andthecovid": 1,
    "pandemics": 2,
    "of": 1,
    "smooth": 1,
    "version": 1,
    "hille": 1,
    "brandandmedeiros": 1,
    "longmemory": 1,
    "hillebrand": 3,
    "table": 2,
    "forecastingresults": 1,
    "fullsample": 1,
    "qlike": 4,
    "harx": 1,
    "randomforest": 1,
    "neuralnetwork": 3,
    "reports": 1,
    "mean": 1,
    "squared": 1,
    "ratio": 1,
    "generalizations": 1,
    "extensions": 1,
    "whichinthe": 1,
    "ric": 1,
    "themseandtheqlike": 1,
    "performsthehar": 1,
    "marianotestofequalfore": 1,
    "castingperformance": 1,
    "report": 1,
    "full": 1,
    "out": 1,
    "financial": 1,
    "crisis": 1,
    "way": 1,
    "effects": 1,
    "covid": 1,
    "pan": 1,
    "mark": 1,
    "withadalasso": 1,
    "duringthecovid": 1,
    "rfsdonotperformwell": 1,
    "ontheotherhand": 1,
    "nnmodelswith": 1,
    "andhigh": 1,
    "wepresentedbothlinear": 1,
    "anditsgeneralizations": 1,
    "andensemblemethods": 1,
    "baggingandcsr": 1,
    "dependentdata": 1,
    "wefocusedonnnsandtree": 1,
    "basedmethods": 1,
    "theoret": 1,
    "forshallownns": 1,
    "chenetal": 1,
    "provide": 1,
    "theoretical": 1,
    "behavior": 1,
    "asymptotic": 1,
    "normality": 1,
    "suchastextdata": 1,
    "toeconomicforecasting": 1,
    "support": 1,
    "autoenconders": 1,
    "factor": 1,
    "andmanymore": 1,
    "orfinancialforecasting": 1,
    "acknowledgments": 1,
    "thesecond": 1,
    "wearealsogratefulto": 1,
    "francisx": 1,
    "danielborup": 1,
    "orcid": 2,
    "org": 2,
    "endnotes": 1,
    "thissurveywillnot": 1,
    "the": 1,
    "sentence": 1,
    "programming": 1,
    "computers": 1,
    "experience": 1,
    "eventually": 1,
    "eliminate": 1,
    "seesamuel": 1,
    "alsothevarianceof": 1,
    "theoracleproperty": 1,
    "signconsistency": 2,
    "appearedinzhaoandyu": 1,
    "thepopulationones": 1,
    "weaksparsity": 1,
    "anunstablepredictor": 1,
    "haslargevariance": 1,
    "intuitively": 1,
    "tivemodel": 1,
    "genreetal": 1,
    "realized": 1,
    "oxford": 3,
    "man": 1,
    "ox": 1,
    "ac": 1,
    "uk": 2,
    "assets": 1,
    "admek": 1,
    "smeekes": 2,
    "wilms": 1,
    "lassoinferenceforhigh": 1,
    "dimensionaltimeseries": 1,
    "technicalreport": 13,
    "arxiv": 10,
    "bluteau": 1,
    "boudt": 1,
    "sparseforecastingusing": 1,
    "thousandsofnews": 1,
    "basedsentimentvalues": 1,
    "audrino": 1,
    "knaus": 1,
    "lassoingtheharmodel": 1,
    "dynamics": 1,
    "econometricreviews": 3,
    "ghysels": 3,
    "striaukas": 3,
    "inferenceforhigh": 1,
    "balkin": 1,
    "ord": 1,
    "automatic": 1,
    "network": 4,
    "modeling": 1,
    "univariate": 1,
    "international": 1,
    "journalofforecasting": 3,
    "ieeetransactions": 2,
    "oninformationtheory": 1,
    "bartlett": 1,
    "traskin": 1,
    "adaboostisconsistent": 1,
    "basu": 1,
    "michailidis": 1,
    "annals": 3,
    "ofstatistics": 2,
    "chernozhukov": 3,
    "dimensionalcontrols": 1,
    "christensen": 1,
    "mhlbach": 1,
    "rapach": 1,
    "schtte": 1,
    "now": 1,
    "dimensionaldailyinter": 1,
    "netsearch": 1,
    "volumedata": 1,
    "ssrn": 1,
    "breiman": 2,
    "baggingpredictors": 1,
    "machinelearning": 4,
    "lboosting": 1,
    "matching": 1,
    "pursuit": 1,
    "type": 1,
    "basis": 2,
    "func": 1,
    "tions": 1,
    "inresearchreport": 1,
    "seminarfrstatistik": 1,
    "eth": 2,
    "vol": 5,
    "seminar": 1,
    "frstatistik": 1,
    "boostingforhigh": 1,
    "annalsofstatistics": 10,
    "callot": 3,
    "adaptive": 2,
    "inn": 1,
    "haldrup": 2,
    "meitz": 2,
    "saikkonen": 2,
    "eds": 3,
    "essaysin": 1,
    "oxforduniversitypress": 2,
    "foliochoice": 1,
    "chan": 1,
    "chen": 5,
    "nonparametricmodels": 1,
    "inj": 1,
    "heckman": 1,
    "leamer": 1,
    "handbookofeconometrics": 1,
    "pp": 8,
    "elsevier": 2,
    "donoho": 1,
    "saunders": 1,
    "siamreview": 1,
    "racine": 1,
    "swanson": 4,
    "forecastinginflation": 1,
    "shen": 1,
    "econometrica": 5,
    "chetverikov": 2,
    "demirer": 2,
    "duflo": 2,
    "newey": 2,
    "dou": 2,
    "ble": 2,
    "debiased": 1,
    "americaneconomicreview": 1,
    "robins": 1,
    "econometricsjournal": 2,
    "chinco": 1,
    "clark": 1,
    "joseph": 1,
    "ye": 1,
    "sectionofreturns": 1,
    "journaloffinance": 1,
    "leroux": 1,
    "stevanovic": 1,
    "surprenant": 1,
    "nomicforecasting": 1,
    "mathematicsofcontrol": 1,
    "signals": 1,
    "systems": 1,
    "davis": 1,
    "electronic": 1,
    "journalofstatistics": 1,
    "twentyyearslater": 1,
    "ofdiebold": 1,
    "marianotests": 1,
    "shin": 2,
    "lassoanditsderivatives": 1,
    "regularizedmixturesof": 1,
    "duffy": 1,
    "helmbold": 1,
    "elliott": 4,
    "gargano": 2,
    "timmermann": 5,
    "journalofeconometrics": 6,
    "complete": 1,
    "economicforecasting": 1,
    "journalof": 2,
    "lv": 1,
    "journaloftheroyal": 1,
    "statisticalsociety": 1,
    "seriesb": 5,
    "xue": 2,
    "annalsofstatis": 1,
    "tics": 2,
    "foresee": 1,
    "hagan": 1,
    "gauss": 1,
    "ieeeinternational": 1,
    "newyork": 3,
    "ieee": 1,
    "realization": 1,
    "mappings": 1,
    "thecaseofbrazil": 1,
    "genre": 1,
    "kenny": 1,
    "meyler": 1,
    "cananythingbeatthe": 1,
    "simpleaverage": 1,
    "giacomini": 1,
    "granger": 2,
    "machina": 1,
    "abstractinference": 1,
    "gu": 1,
    "kelly": 1,
    "xiu": 1,
    "timeseriesanalysis": 1,
    "han": 1,
    "tsay": 1,
    "statisticasinica": 1,
    "biometrika": 1,
    "lunde": 1,
    "nason": 1,
    "themodelconfidenceset": 1,
    "harvey": 1,
    "leybourne": 1,
    "newbold": 1,
    "interna": 1,
    "tibshirani": 8,
    "datamining": 1,
    "prediction": 1,
    "springer": 1,
    "wainwright": 1,
    "crcpress": 1,
    "hecq": 1,
    "margaritella": 1,
    "dimensionalvars": 1,
    "apost": 1,
    "selectionprocedure": 1,
    "heravi": 1,
    "osborne": 1,
    "birchenhall": 1,
    "productionseries": 1,
    "reviews": 1,
    "asymmetries": 1,
    "breaks": 1,
    "andlong": 1,
    "rangedependence": 1,
    "journalofbusiness": 1,
    "andeconomicstatistics": 1,
    "hochreiter": 1,
    "schmidhuber": 1,
    "longshort": 1,
    "neuralcomputation": 5,
    "hoerl": 1,
    "kennard": 1,
    "technometrics": 1,
    "hornik": 2,
    "stinchombe": 1,
    "multi": 1,
    "hsu": 1,
    "hung": 1,
    "chang": 1,
    "dataanalysis": 2,
    "inoue": 1,
    "kilian": 1,
    "useful": 1,
    "consumerpriceinflation": 1,
    "kim": 1,
    "choi": 1,
    "oh": 1,
    "smoothly": 1,
    "clipped": 1,
    "absolute": 1,
    "deviation": 1,
    "dimensions": 1,
    "knight": 1,
    "fu": 1,
    "asymptoticsforlasso": 1,
    "typeestimators": 1,
    "aryautoregressions": 1,
    "econometrictheory": 2,
    "journalofeconomet": 1,
    "rics": 1,
    "three": 2,
    "modelling": 1,
    "techniques": 1,
    "during": 1,
    "economiccrisis": 1,
    "konzen": 1,
    "ziegelmann": 1,
    "koo": 1,
    "anderson": 1,
    "seo": 1,
    "yao": 1,
    "tegration": 1,
    "lederer": 1,
    "yu": 3,
    "gaynanova": 1,
    "dimensionalprediction": 1,
    "bernoulli": 1,
    "sun": 3,
    "taylor": 3,
    "exactpost": 1,
    "factsandfiction": 1,
    "estimators": 2,
    "return": 1,
    "hodges": 1,
    "liao": 2,
    "quaedvlieg": 1,
    "erasmusschool": 1,
    "ofeconomics": 1,
    "lockhart": 2,
    "lugosi": 1,
    "vayatis": 1,
    "onthebayes": 1,
    "bayesianinterpolation": 1,
    "economicsurveys": 1,
    "parametric": 1,
    "additive": 1,
    "regularizationofhigh": 1,
    "seriesmodelswithnon": 1,
    "ardl": 1,
    "garch": 1,
    "environments": 1,
    "eco": 1,
    "nomicsletters": 1,
    "rech": 1,
    "building": 1,
    "veiga": 3,
    "zilberman": 1,
    "richenviron": 1,
    "ment": 1,
    "onneuralnetworks": 1,
    "pedreira": 2,
    "modellingexchangerates": 1,
    "smoothtransitions": 1,
    "andlinearmodels": 1,
    "melnyk": 1,
    "banerjee": 1,
    "mhaska": 1,
    "poggio": 1,
    "proceedings": 2,
    "ofthethirty": 1,
    "aaai": 1,
    "nardi": 1,
    "rinaldo": 1,
    "journalofmultivariate": 1,
    "analysis": 1,
    "sakaori": 1,
    "functionnetworks": 1,
    "thebayesianlasso": 1,
    "probabilityletters": 2,
    "samuel": 1,
    "studies": 1,
    "game": 1,
    "checkers": 1,
    "ibm": 1,
    "development": 1,
    "sang": 1,
    "tailedautore": 1,
    "gressiveprocesses": 1,
    "scharth": 1,
    "scornet": 1,
    "biau": 1,
    "vert": 1,
    "simon": 1,
    "asparse": 1,
    "grouplasso": 1,
    "graphicalstatistics": 1,
    "smeeks": 2,
    "wijler": 2,
    "internationaljour": 1,
    "nalofforecasting": 1,
    "srivastava": 1,
    "hinton": 1,
    "krizhevsky": 1,
    "sutskever": 1,
    "salakhutdinov": 1,
    "proceedingsof": 1,
    "universal": 1,
    "non": 1,
    "washington": 1,
    "ny": 1,
    "ieeepress": 1,
    "farias": 1,
    "globalneuralnetworks": 1,
    "anewapproachfornonlin": 1,
    "eartimeseriesmodelling": 1,
    "forecastingu": 1,
    "niques": 1,
    "post": 1,
    "sionandthelasso": 1,
    "tjstheim": 1,
    "universitypress": 1,
    "vandijk": 1,
    "linearmodels": 1,
    "areexamination": 1,
    "withdiscussion": 1,
    "internationaljournal": 1,
    "offorecasting": 1,
    "via": 1,
    "ur": 1,
    "na": 1,
    "lo": 1,
    "ft": 1,
    "ya": 1,
    "ls": 2,
    "ic": 1,
    "ciet": 1,
    "inrussian": 1,
    "onthesolutionofill": 1,
    "dokladyakademii": 1,
    "nauk": 1,
    "solutionsofill": 1,
    "posedproblems": 1,
    "hwinstonandsons": 1,
    "canadian": 1,
    "gdp": 1,
    "trapletti": 1,
    "leisch": 1,
    "izedregression": 1,
    "vandegeer": 1,
    "ritov": 1,
    "dezeure": 1,
    "testsforhigh": 1,
    "wager": 1,
    "athey": 1,
    "tsai": 1,
    "thelasso": 1,
    "wong": 1,
    "tewari": 1,
    "lassoguaranteesfor": 1,
    "system": 1,
    "look": 1,
    "national": 1,
    "academy": 1,
    "sciences": 1,
    "estimates": 1,
    "correlatederrors": 1,
    "xu": 1,
    "taniguchi": 1,
    "disturbances": 1,
    "statisticalmethods": 1,
    "statis": 1,
    "ticsandcomputing": 1,
    "yoon": 1,
    "journalofstatis": 1,
    "yousuf": 1,
    "yuan": 1,
    "lin": 1,
    "grouped": 1,
    "zhao": 1,
    "society": 1,
    "ontheadaptiveelastic": 1,
    "howtocitethisarticle": 1
}