{
    "ieee": 35,
    "transactions": 6,
    "neural": 86,
    "networks": 61,
    "learning": 22,
    "systems": 6,
    "vol": 56,
    "july": 6,
    "toward": 5,
    "automatic": 35,
    "time": 83,
    "series": 181,
    "forecasting": 83,
    "using": 38,
    "weizhong": 2,
    "yan": 12,
    "senior": 1,
    "member": 2,
    "abstract": 1,
    "over": 16,
    "past": 2,
    "few": 6,
    "decades": 4,
    "application": 4,
    "arti": 8,
    "cial": 9,
    "ann": 40,
    "tsf": 36,
    "beengrowing": 1,
    "rapidly": 1,
    "due": 1,
    "several": 22,
    "unique": 5,
    "features": 4,
    "models": 45,
    "however": 15,
    "date": 4,
    "consistent": 1,
    "performance": 29,
    "differentstudies": 1,
    "not": 21,
    "been": 20,
    "achieved": 2,
    "many": 10,
    "factors": 14,
    "contribute": 4,
    "theinconsistency": 1,
    "network": 40,
    "one": 21,
    "such": 12,
    "factor": 36,
    "that": 86,
    "modeling": 76,
    "involves": 7,
    "determininga": 1,
    "large": 25,
    "number": 45,
    "design": 47,
    "parameters": 11,
    "current": 5,
    "designpractice": 1,
    "essentially": 1,
    "heuristic": 3,
    "ad": 4,
    "hoc": 4,
    "this": 50,
    "does": 5,
    "exploitthe": 1,
    "full": 8,
    "potential": 5,
    "systematic": 3,
    "modelingprocesses": 1,
    "strategies": 19,
    "therefore": 4,
    "greatly": 1,
    "needed": 2,
    "motivated": 1,
    "by": 37,
    "need": 2,
    "paper": 35,
    "attempts": 1,
    "develop": 3,
    "anautomatic": 1,
    "scheme": 48,
    "it": 39,
    "based": 28,
    "generalizedregression": 1,
    "grnn": 37,
    "special": 4,
    "type": 11,
    "neuralnetwork": 1,
    "taking": 2,
    "advantage": 2,
    "properties": 6,
    "asingle": 1,
    "parameter": 6,
    "fast": 15,
    "incorporatingseveral": 1,
    "fusing": 1,
    "multiple": 19,
    "grnns": 46,
    "havebeen": 1,
    "able": 2,
    "make": 6,
    "proposed": 14,
    "effectivefor": 1,
    "scale": 7,
    "business": 4,
    "initial": 6,
    "modelwas": 1,
    "entered": 2,
    "into": 5,
    "nn": 16,
    "competition": 25,
    "was": 14,
    "awardedthe": 1,
    "best": 14,
    "prediction": 25,
    "reduced": 4,
    "dataset": 12,
    "among": 3,
    "approximately": 3,
    "different": 33,
    "submitted": 4,
    "scholars": 1,
    "worldwide": 2,
    "index": 2,
    "terms": 3,
    "generalized": 4,
    "regression": 14,
    "model": 61,
    "combination": 11,
    "ntroduction": 1,
    "conventionally": 1,
    "seri": 1,
    "es": 4,
    "performed": 8,
    "predominan": 1,
    "tly": 1,
    "statistical": 8,
    "methods": 29,
    "example": 12,
    "autoregressive": 2,
    "integrated": 1,
    "moving": 1,
    "average": 14,
    "arima": 2,
    "anns": 6,
    "which": 30,
    "exhibit": 1,
    "superior": 3,
    "perfor": 1,
    "mance": 1,
    "classi": 11,
    "cation": 20,
    "problems": 4,
    "machine": 12,
    "domain": 2,
    "attracted": 1,
    "tremendous": 1,
    "attention": 2,
    "thetsf": 1,
    "community": 2,
    "compared": 5,
    "statistics": 2,
    "techniques": 5,
    "approaches": 8,
    "characteristics": 3,
    "including": 7,
    "being": 3,
    "both": 11,
    "nonlinear": 6,
    "data": 26,
    "driven": 1,
    "having": 2,
    "requirement": 2,
    "an": 42,
    "explicit": 2,
    "underlying": 2,
    "nonparametric": 3,
    "more": 30,
    "exible": 3,
    "uni": 1,
    "versal": 1,
    "thus": 7,
    "applicable": 8,
    "mo": 1,
    "re": 3,
    "complicated": 1,
    "because": 2,
    "aforementione": 1,
    "regarded": 1,
    "experts": 1,
    "promising": 1,
    "technology": 1,
    "fortsf": 1,
    "consequently": 1,
    "last": 7,
    "than": 19,
    "articles": 1,
    "published": 1,
    "manuscript": 1,
    "received": 2,
    "january": 1,
    "revised": 1,
    "april": 2,
    "accepted": 1,
    "publication": 1,
    "june": 2,
    "version": 2,
    "author": 3,
    "with": 39,
    "learni": 1,
    "ng": 2,
    "laboratory": 2,
    "ge": 3,
    "global": 6,
    "research": 7,
    "center": 3,
    "niskayuna": 2,
    "ny": 3,
    "usa": 2,
    "mail": 1,
    "com": 4,
    "color": 1,
    "versions": 1,
    "or": 14,
    "gures": 1,
    "available": 1,
    "online": 1,
    "http": 1,
    "ieeexplore": 1,
    "org": 1,
    "digital": 1,
    "object": 1,
    "identi": 17,
    "er": 3,
    "tnnls": 1,
    "covering": 1,
    "wide": 2,
    "range": 2,
    "applications": 12,
    "elds": 1,
    "great": 2,
    "empirical": 9,
    "studies": 21,
    "shown": 12,
    "forecasters": 1,
    "basedon": 2,
    "single": 18,
    "small": 9,
    "set": 13,
    "inferior": 3,
    "traditional": 1,
    "heravi": 4,
    "et": 17,
    "al": 18,
    "conducted": 7,
    "study": 16,
    "comparing": 3,
    "against": 8,
    "linear": 15,
    "annual": 1,
    "change": 1,
    "monthly": 7,
    "industrial": 1,
    "production": 2,
    "three": 19,
    "european": 2,
    "countries": 1,
    "their": 8,
    "results": 12,
    "indicated": 2,
    "generally": 10,
    "outperform": 1,
    "studyby": 1,
    "callen": 2,
    "quarterly": 5,
    "accounting": 2,
    "earning": 2,
    "also": 21,
    "showed": 3,
    "inferiority": 1,
    "inconsistent": 1,
    "across": 1,
    "adya": 4,
    "collopy": 3,
    "attributed": 3,
    "inconsistency": 1,
    "ineffectiveness": 1,
    "validation": 2,
    "implementation": 1,
    "involved": 2,
    "some": 7,
    "they": 5,
    "found": 2,
    "out": 20,
    "related": 6,
    "studiesthey": 1,
    "ed": 7,
    "only": 12,
    "were": 4,
    "correctly": 2,
    "imple": 1,
    "mented": 1,
    "validated": 3,
    "other": 18,
    "hand": 6,
    "nelson": 3,
    "zhang": 9,
    "kline": 5,
    "suggested": 1,
    "inconsistencyof": 1,
    "from": 37,
    "result": 4,
    "preprocessing": 13,
    "adopted": 7,
    "those": 9,
    "believe": 1,
    "detrending": 22,
    "deseasonalizing": 6,
    "contributes": 1,
    "signi": 11,
    "cantly": 7,
    "others": 2,
    "inherent": 1,
    "suf": 2,
    "cient": 7,
    "samples": 28,
    "order": 1,
    "fully": 1,
    "trained": 3,
    "most": 5,
    "real": 5,
    "world": 6,
    "especially": 3,
    "economic": 2,
    "nan": 1,
    "short": 23,
    "ones": 1,
    "inadequate": 1,
    "learn": 5,
    "pattern": 8,
    "structure": 2,
    "resulting": 1,
    "poor": 1,
    "sample": 10,
    "rediction": 1,
    "still": 5,
    "poorperformance": 1,
    "determining": 13,
    "num": 1,
    "ber": 1,
    "types": 6,
    "architectures": 1,
    "paramet": 2,
    "ers": 5,
    "largely": 2,
    "process": 3,
    "allow": 2,
    "exploiting": 1,
    "clearly": 2,
    "how": 10,
    "effective": 13,
    "open": 2,
    "question": 3,
    "work": 10,
    "regard": 1,
    "approach": 24,
    "maximally": 1,
    "exploring": 1,
    "through": 3,
    "organized": 2,
    "competitions": 1,
    "pooling": 1,
    "development": 1,
    "effort": 6,
    "skills": 1,
    "participants": 1,
    "beperformed": 1,
    "effectively": 4,
    "m": 5,
    "x": 4,
    "authorized": 12,
    "licensed": 12,
    "use": 19,
    "limited": 15,
    "national": 12,
    "university": 12,
    "downloaded": 12,
    "february": 12,
    "utc": 12,
    "xplore": 12,
    "restrictions": 12,
    "apply": 13,
    "towards": 6,
    "recently": 6,
    "two": 22,
    "examples": 2,
    "another": 3,
    "important": 6,
    "thedevelopment": 1,
    "replace": 1,
    "doing": 1,
    "alleviate": 2,
    "dif": 7,
    "culty": 4,
    "encountered": 1,
    "andthus": 1,
    "reliable": 1,
    "evaluation": 7,
    "end": 3,
    "balkin": 3,
    "ord": 3,
    "procedure": 2,
    "multilayer": 1,
    "perceptron": 1,
    "mlp": 6,
    "method": 8,
    "our": 86,
    "realizing": 1,
    "severalshortcomings": 1,
    "long": 22,
    "training": 28,
    "suffering": 1,
    "local": 2,
    "minima": 1,
    "automation": 2,
    "cult": 4,
    "attempt": 1,
    "neuralnetworks": 1,
    "simple": 11,
    "desirable": 2,
    "automated": 2,
    "focuseson": 1,
    "designing": 2,
    "take": 3,
    "these": 13,
    "addition": 3,
    "pay": 1,
    "following": 11,
    "achieve": 2,
    "ef": 5,
    "good": 8,
    "well": 9,
    "fusion": 11,
    "spread": 47,
    "feature": 9,
    "treatment": 8,
    "strategy": 11,
    "outliers": 4,
    "trends": 2,
    "adopting": 2,
    "direct": 12,
    "step": 12,
    "ahead": 10,
    "msa": 15,
    "www": 1,
    "submissions": 1,
    "overall": 8,
    "winner": 1,
    "error": 9,
    "measures": 6,
    "rest": 4,
    "follows": 3,
    "section": 24,
    "ii": 8,
    "provides": 1,
    "overview": 4,
    "networkforecasting": 1,
    "iii": 9,
    "gives": 4,
    "brief": 1,
    "introduction": 2,
    "described": 6,
    "detail": 5,
    "iv": 6,
    "experimental": 2,
    "themodel": 1,
    "vi": 8,
    "dedicated": 2,
    "sensitivity": 6,
    "discussion": 1,
    "vii": 2,
    "concludes": 1,
    "elated": 1,
    "literature": 6,
    "there": 8,
    "publications": 4,
    "cover": 2,
    "varying": 2,
    "nancial": 3,
    "toeconomic": 1,
    "natural": 1,
    "physical": 1,
    "phenomena": 1,
    "river": 4,
    "ow": 4,
    "earthquakes": 2,
    "weather": 3,
    "papers": 1,
    "provide": 1,
    "for": 1,
    "complete": 3,
    "ranked": 2,
    "th": 18,
    "improved": 3,
    "see": 9,
    "table": 10,
    "summary": 1,
    "various": 5,
    "employed": 2,
    "diverse": 1,
    "earliest": 1,
    "popular": 2,
    "feed": 1,
    "forward": 1,
    "mlps": 2,
    "early": 1,
    "applicationsof": 1,
    "include": 8,
    "farway": 2,
    "chat": 3,
    "eld": 5,
    "hill": 3,
    "while": 8,
    "recent": 5,
    "recurrent": 7,
    "often": 6,
    "used": 29,
    "radial": 4,
    "basis": 4,
    "function": 6,
    "rbf": 7,
    "bayesian": 4,
    "neuron": 2,
    "fuzzy": 5,
    "ahmed": 3,
    "comparison": 14,
    "rbfs": 1,
    "nearest": 3,
    "neighbor": 1,
    "regres": 1,
    "sion": 1,
    "tree": 2,
    "support": 3,
    "vector": 4,
    "gaussian": 3,
    "processes": 3,
    "extreme": 2,
    "elm": 2,
    "newtype": 1,
    "introduced": 3,
    "huang": 4,
    "sorjamaa": 2,
    "clifford": 2,
    "machin": 1,
    "causality": 2,
    "analysis": 15,
    "investigated": 2,
    "please": 1,
    "details": 3,
    "referred": 2,
    "combining": 13,
    "forecasts": 18,
    "history": 1,
    "combin": 1,
    "ing": 7,
    "improves": 2,
    "accuracy": 8,
    "but": 8,
    "alsoalleviates": 1,
    "associated": 2,
    "conventional": 1,
    "selecting": 2,
    "zou": 2,
    "yang": 2,
    "convexly": 1,
    "combined": 2,
    "orders": 1,
    "so": 5,
    "called": 1,
    "aggregated": 1,
    "forecast": 26,
    "exponential": 1,
    "reweighting": 1,
    "after": 5,
    "thatmodel": 1,
    "could": 3,
    "perform": 9,
    "better": 9,
    "selection": 12,
    "when": 7,
    "uncertainty": 1,
    "cant": 3,
    "actively": 2,
    "explored": 2,
    "years": 1,
    "theoret": 1,
    "ical": 1,
    "intelligently": 1,
    "outputs": 5,
    "greateraccuracy": 1,
    "individual": 7,
    "inspired": 2,
    "success": 2,
    "ensembles": 2,
    "nnes": 1,
    "rst": 13,
    "hansen": 2,
    "salamon": 2,
    "domains": 1,
    "mining": 2,
    "concept": 1,
    "nne": 2,
    "maqsood": 2,
    "ensemble": 5,
    "southern": 1,
    "saskatchewan": 1,
    "canada": 1,
    "lim": 2,
    "goh": 2,
    "modi": 2,
    "adaboostalgorithm": 1,
    "integrate": 1,
    "predictions": 2,
    "elman": 2,
    "recur": 1,
    "rent": 1,
    "original": 5,
    "adaboost": 2,
    "works": 5,
    "tasks": 3,
    "prob": 1,
    "lems": 1,
    "assaad": 2,
    "studied": 3,
    "boosting": 3,
    "ssa": 3,
    "benchmarking": 1,
    "datasets": 4,
    "sunspots": 1,
    "mackey": 1,
    "glass": 1,
    "yet": 1,
    "applied": 2,
    "fig": 20,
    "typical": 3,
    "variant": 1,
    "layers": 1,
    "neurons": 10,
    "input": 25,
    "layer": 6,
    "hidden": 7,
    "output": 8,
    "transfer": 1,
    "given": 6,
    "approximate": 2,
    "continuous": 1,
    "toan": 1,
    "arbitrary": 1,
    "universal": 1,
    "approximator": 1,
    "equal": 5,
    "will": 4,
    "complex": 2,
    "too": 1,
    "way": 2,
    "reducing": 1,
    "cluster": 1,
    "clusters": 1,
    "toeach": 1,
    "distance": 3,
    "between": 13,
    "scaled": 1,
    "ofneuron": 1,
    "character": 1,
    "izing": 1,
    "closeness": 1,
    "vectors": 1,
    "commonly": 2,
    "multivariate": 1,
    "de": 3,
    "ned": 2,
    "exp": 3,
    "s": 3,
    "xi": 13,
    "where": 16,
    "xiandsare": 1,
    "width": 1,
    "respectively": 9,
    "minput": 1,
    "pairs": 2,
    "yj": 1,
    "rn": 2,
    "r": 1,
    "assume": 1,
    "test": 6,
    "point": 7,
    "sd": 1,
    "da": 1,
    "y": 1,
    "wiyi": 1,
    "wi": 1,
    "xk": 1,
    "tunable": 1,
    "namely": 4,
    "above": 3,
    "fact": 4,
    "steep": 1,
    "closest": 1,
    "roughresponse": 1,
    "surface": 2,
    "increases": 3,
    "becomes": 1,
    "wider": 1,
    "raining": 1,
    "leads": 1,
    "smoother": 1,
    "responsesurface": 1,
    "dictates": 1,
    "discussed": 10,
    "shortcomings": 1,
    "particularly": 1,
    "task": 5,
    "advantages": 2,
    "easy": 2,
    "train": 2,
    "since": 11,
    "aone": 1,
    "pass": 1,
    "algorithm": 7,
    "accurately": 1,
    "functions": 1,
    "sparse": 2,
    "noisy": 2,
    "converge": 1,
    "conditional": 1,
    "mean": 7,
    "increasing": 1,
    "us": 1,
    "choose": 2,
    "spite": 1,
    "basic": 1,
    "form": 1,
    "fold": 1,
    "cross": 2,
    "valid": 1,
    "ation": 1,
    "select": 2,
    "ranging": 2,
    "to": 1,
    "concluded": 1,
    "gp": 1,
    "robust": 5,
    "difference": 11,
    "clude": 1,
    "load": 4,
    "plasma": 2,
    "etching": 2,
    "roposed": 1,
    "methodology": 1,
    "primary": 1,
    "goal": 1,
    "possible": 2,
    "ciently": 1,
    "modela": 1,
    "speci": 9,
    "cally": 7,
    "devoted": 1,
    "objectives": 1,
    "requires": 3,
    "minimal": 2,
    "humanintervention": 1,
    "computationally": 5,
    "consists": 4,
    "essential": 1,
    "components": 1,
    "subsections": 3,
    "regardless": 1,
    "its": 7,
    "contains": 2,
    "patterns": 4,
    "trend": 17,
    "seasonality": 16,
    "outlier": 6,
    "recognized": 1,
    "treat": 1,
    "ment": 1,
    "call": 2,
    "critical": 2,
    "part": 2,
    "typically": 2,
    "includes": 2,
    "steps": 3,
    "manually": 1,
    "identifying": 2,
    "via": 2,
    "visual": 2,
    "beenpopularly": 1,
    "labor": 1,
    "intensive": 1,
    "necessary": 2,
    "challenging": 4,
    "already": 1,
    "looked": 1,
    "attern": 1,
    "problem": 3,
    "focuses": 1,
    "season": 8,
    "ality": 1,
    "normalization": 11,
    "required": 1,
    "general": 8,
    "included": 1,
    "iso": 1,
    "lated": 1,
    "observations": 15,
    "value": 22,
    "second": 3,
    "indication": 1,
    "own": 2,
    "previous": 1,
    "experience": 1,
    "ne": 2,
    "outlieras": 1,
    "whose": 1,
    "absolute": 3,
    "four": 3,
    "times": 2,
    "greater": 5,
    "medians": 1,
    "consecutive": 1,
    "points": 18,
    "before": 3,
    "iis": 1,
    "if": 15,
    "satis": 1,
    "condition": 1,
    "max": 5,
    "ma": 5,
    "mb": 2,
    "median": 5,
    "observation": 5,
    "deemed": 1,
    "simply": 4,
    "replaced": 1,
    "immediately": 1,
    "whether": 3,
    "qi": 2,
    "answerin": 1,
    "conclusion": 1,
    "stochastic": 3,
    "timeseries": 1,
    "practical": 1,
    "bu": 1,
    "ilding": 1,
    "exclusively": 1,
    "similarity": 3,
    "historical": 17,
    "space": 5,
    "descriptions": 1,
    "inherently": 1,
    "ineffective": 1,
    "espe": 1,
    "cially": 1,
    "removing": 2,
    "common": 2,
    "handling": 2,
    "curve": 1,
    "tting": 1,
    "ltering": 1,
    "differencing": 1,
    "big": 1,
    "challenge": 1,
    "what": 1,
    "even": 5,
    "systematical": 1,
    "manual": 3,
    "fashion": 2,
    "aiming": 1,
    "proposea": 1,
    "generic": 1,
    "subtracting": 2,
    "means": 15,
    "under": 1,
    "split": 2,
    "segments": 6,
    "length": 10,
    "ofseasonality": 1,
    "within": 1,
    "each": 21,
    "subtracted": 1,
    "every": 1,
    "segment": 1,
    "let": 2,
    "mk": 1,
    "lbe": 2,
    "detrended": 2,
    "dti": 2,
    "mj": 1,
    "cell": 1,
    "nis": 5,
    "non": 4,
    "built": 2,
    "onthe": 1,
    "represented": 1,
    "needs": 1,
    "added": 1,
    "back": 6,
    "obtainfuture": 1,
    "fu": 1,
    "ll": 1,
    "easily": 1,
    "calculated": 6,
    "themeans": 1,
    "future": 16,
    "unknown": 1,
    "nd": 6,
    "ways": 2,
    "estimate": 2,
    "createa": 1,
    "enough": 3,
    "adopt": 3,
    "same": 4,
    "estimated": 2,
    "effectiveness": 4,
    "willbe": 1,
    "schemes": 1,
    "addressing": 2,
    "annmodeling": 1,
    "irect": 1,
    "deseasonalized": 4,
    "opin": 1,
    "ions": 1,
    "regarding": 1,
    "mixed": 1,
    "networkstrained": 1,
    "raw": 2,
    "favor": 1,
    "directly": 2,
    "concern": 1,
    "nonlinearity": 1,
    "induced": 1,
    "adjustment": 1,
    "identify": 1,
    "them": 3,
    "interpreting": 1,
    "correlogram": 1,
    "graph": 1,
    "autocorrelation": 4,
    "coef": 3,
    "cients": 2,
    "plotted": 1,
    "lags": 5,
    "automatically": 4,
    "trivial": 1,
    "rule": 3,
    "thumb": 2,
    "seasonal": 24,
    "he": 6,
    "lag": 5,
    "during": 1,
    "preliminary": 2,
    "competitiondata": 1,
    "worked": 1,
    "reasonably": 4,
    "misclassi": 1,
    "majority": 4,
    "nonseasonal": 12,
    "follo": 1,
    "wing": 1,
    "otherwise": 2,
    "criterion": 1,
    "petition": 1,
    "seasonalseries": 1,
    "deseasonalization": 5,
    "proce": 1,
    "dure": 1,
    "performs": 6,
    "subtractingthe": 1,
    "averages": 2,
    "dsi": 1,
    "aj": 1,
    "mod": 1,
    "add": 5,
    "deseason": 1,
    "alized": 1,
    "effectiv": 1,
    "eness": 1,
    "deseasonality": 1,
    "performing": 2,
    "mentioned": 1,
    "then": 4,
    "normalized": 1,
    "rangeof": 1,
    "scalin": 1,
    "maximum": 4,
    "values": 3,
    "meth": 1,
    "ods": 1,
    "schemeto": 1,
    "efforts": 1,
    "deter": 1,
    "inputs": 14,
    "deciding": 1,
    "fore": 5,
    "casting": 4,
    "subsequent": 2,
    "affects": 1,
    "erformance": 1,
    "unfortu": 1,
    "nately": 1,
    "forall": 1,
    "moreover": 2,
    "analytical": 1,
    "allows": 2,
    "accurate": 2,
    "ly": 1,
    "haykin": 4,
    "provided": 2,
    "aguidance": 1,
    "n": 2,
    "dmaxis": 2,
    "guidance": 1,
    "dependent": 3,
    "tends": 1,
    "yieldbig": 1,
    "empirically": 4,
    "trial": 2,
    "practice": 1,
    "thedesign": 1,
    "consuming": 1,
    "optimizer": 2,
    "genetic": 1,
    "wrapperto": 1,
    "determine": 4,
    "optimal": 3,
    "minimizing": 1,
    "objective": 2,
    "errors": 4,
    "holdout": 5,
    "optimization": 2,
    "expensive": 3,
    "may": 7,
    "wellwhen": 1,
    "optimally": 2,
    "selected": 2,
    "maynot": 1,
    "generalize": 3,
    "ample": 1,
    "instead": 1,
    "searching": 2,
    "actor": 1,
    "tackles": 1,
    "issue": 4,
    "uses": 6,
    "factorset": 1,
    "distribution": 2,
    "instance": 1,
    "sam": 1,
    "ple": 3,
    "hypothesize": 1,
    "should": 2,
    "distributedin": 1,
    "propose": 1,
    "d": 23,
    "percentiles": 4,
    "distances": 1,
    "tothe": 1,
    "explore": 1,
    "sensitive": 4,
    "arrive": 1,
    "nal": 2,
    "body": 1,
    "improve": 1,
    "tool": 2,
    "improving": 1,
    "knowledge": 2,
    "foralleviating": 1,
    "individually": 2,
    "derived": 1,
    "underlyingframeworks": 1,
    "probability": 1,
    "theory": 5,
    "sets": 1,
    "dem": 1,
    "pster": 1,
    "shafer": 2,
    "evidence": 3,
    "group": 1,
    "decision": 2,
    "making": 1,
    "voting": 2,
    "weighted": 1,
    "borda": 1,
    "count": 1,
    "kuncheva": 2,
    "ecasting": 1,
    "popularly": 2,
    "outperformsthe": 1,
    "sophistic": 1,
    "combinatio": 1,
    "jose": 2,
    "winkler": 2,
    "new": 5,
    "trimmed": 2,
    "winsorized": 1,
    "onemay": 1,
    "effectof": 1,
    "combina": 1,
    "tion": 2,
    "lagged": 4,
    "exam": 1,
    "topic": 2,
    "dash": 2,
    "liu": 4,
    "carried": 1,
    "comprehensive": 4,
    "broadly": 1,
    "speaking": 1,
    "categorized": 1,
    "lter": 2,
    "wrapper": 4,
    "selects": 1,
    "itself": 1,
    "independent": 3,
    "pseudocode": 1,
    "hold": 2,
    "keep": 1,
    "remaining": 2,
    "fuse": 1,
    "obtain": 4,
    "calculate": 4,
    "smape": 24,
    "record": 1,
    "corresponding": 3,
    "retrain": 1,
    "election": 1,
    "tikka": 2,
    "crone": 4,
    "nikolopoulos": 3,
    "rely": 1,
    "experi": 2,
    "ments": 1,
    "intuition": 2,
    "try": 1,
    "pick": 2,
    "withthe": 1,
    "smallest": 2,
    "measure": 2,
    "testing": 4,
    "mental": 1,
    "minimize": 1,
    "search": 4,
    "consider": 1,
    "contiguous": 2,
    "further": 2,
    "limit": 1,
    "onefull": 1,
    "xed": 7,
    "considering": 1,
    "depending": 1,
    "horizon": 4,
    "singl": 1,
    "mult": 1,
    "forecas": 1,
    "ting": 1,
    "shortest": 1,
    "relatively": 2,
    "widely": 2,
    "notbeen": 1,
    "despite": 1,
    "much": 5,
    "becau": 1,
    "se": 1,
    "dealing": 2,
    "growing": 1,
    "uncertainties": 1,
    "caused": 1,
    "sources": 1,
    "accumulation": 2,
    "lack": 1,
    "information": 1,
    "di": 1,
    "rect": 1,
    "recursive": 10,
    "ksteps": 1,
    "recursively": 1,
    "prior": 1,
    "until": 2,
    "reach": 1,
    "desired": 1,
    "hori": 1,
    "zon": 1,
    "intuitive": 1,
    "major": 2,
    "drawback": 1,
    "computationallymore": 1,
    "relative": 3,
    "depends": 1,
    "atiya": 4,
    "analytically": 1,
    "proved": 1,
    "superiority": 1,
    "employsthe": 1,
    "discuss": 1,
    "ance": 1,
    "building": 1,
    "summarized": 1,
    "xperimental": 1,
    "validating": 1,
    "consisting": 1,
    "drawnfrom": 1,
    "homogeneous": 1,
    "population": 1,
    "subset": 3,
    "completedataset": 1,
    "balanced": 1,
    "per": 9,
    "less": 4,
    "thehistorical": 1,
    "xt": 1,
    "evaluating": 1,
    "percentage": 2,
    "hyndman": 2,
    "koehler": 2,
    "evaluationand": 1,
    "winners": 1,
    "organizers": 2,
    "chose": 1,
    "symmetric": 1,
    "segmentation": 1,
    "boxplots": 11,
    "smapes": 14,
    "groupwise": 1,
    "groups": 1,
    "longnonseasonal": 1,
    "note": 3,
    "red": 1,
    "line": 1,
    "notch": 1,
    "box": 2,
    "indicates": 3,
    "ends": 1,
    "represent": 1,
    "represents": 1,
    "outside": 1,
    "below": 2,
    "mm": 1,
    "yi": 4,
    "yiandyiare": 1,
    "true": 2,
    "predicted": 2,
    "respec": 1,
    "tively": 1,
    "ith": 1,
    "mis": 1,
    "computed": 2,
    "averaged": 2,
    "calledoverall": 1,
    "multi": 3,
    "worth": 3,
    "pointing": 1,
    "reserved": 1,
    "portion": 1,
    "considered": 3,
    "aremonthly": 1,
    "here": 4,
    "klagged": 1,
    "tried": 1,
    "smapeon": 1,
    "chosen": 2,
    "longsmape": 1,
    "versus": 17,
    "seasonalsmape": 1,
    "boxplot": 1,
    "retrained": 1,
    "noting": 1,
    "kept": 1,
    "implemented": 2,
    "atlab": 2,
    "rb": 1,
    "mathworks": 1,
    "inc": 1,
    "natick": 1,
    "theneural": 1,
    "toolbox": 1,
    "assess": 6,
    "employ": 1,
    "origin": 9,
    "casts": 1,
    "accordance": 2,
    "theforecasts": 1,
    "descriptive": 1,
    "show": 2,
    "thenspeci": 1,
    "compare": 4,
    "onecan": 1,
    "slightly": 2,
    "favorable": 1,
    "moredif": 1,
    "plot": 1,
    "six": 9,
    "levels": 5,
    "horizons": 2,
    "shows": 4,
    "theforecasting": 1,
    "horizonssmape": 1,
    "ground": 2,
    "truth": 2,
    "yields": 3,
    "observationsvaluehis": 1,
    "torical": 1,
    "worst": 1,
    "highersmape": 1,
    "particular": 2,
    "close": 2,
    "capture": 1,
    "underlyingpattern": 1,
    "top": 3,
    "modelssubmitted": 1,
    "ids": 2,
    "letter": 2,
    "pre": 1,
    "stand": 2,
    "computational": 1,
    "intelligence": 3,
    "ci": 4,
    "benchmark": 8,
    "compiled": 1,
    "schemeproposed": 1,
    "outperforms": 1,
    "almost": 1,
    "except": 1,
    "c": 6,
    "echo": 2,
    "state": 3,
    "co": 1,
    "mparable": 1,
    "refer": 1,
    "somehowtable": 1,
    "ourmodel": 1,
    "id": 1,
    "rank": 3,
    "b": 8,
    "stat": 6,
    "forecastpro": 1,
    "des": 2,
    "comb": 1,
    "autobox": 1,
    "ga": 1,
    "ses": 1,
    "hes": 1,
    "knn": 1,
    "submission": 1,
    "ledto": 1,
    "higher": 1,
    "adopteda": 1,
    "reported": 1,
    "resulted": 1,
    "fixed": 1,
    "rolling": 4,
    "originsmape": 1,
    "evaluations": 2,
    "assuming": 1,
    "tuni": 1,
    "would": 8,
    "around": 1,
    "put": 1,
    "desensitize": 1,
    "events": 1,
    "any": 1,
    "assessed": 1,
    "did": 1,
    "origins": 2,
    "tis": 1,
    "opposed": 2,
    "iscussion": 1,
    "includ": 1,
    "subtraction": 2,
    "simplifying": 1,
    "thedetermination": 1,
    "mainly": 1,
    "automating": 2,
    "applying": 3,
    "demonstrated": 1,
    "inour": 1,
    "like": 4,
    "investigation": 1,
    "affect": 1,
    "forecastingperformance": 1,
    "choices": 1,
    "contrast": 4,
    "limitations": 2,
    "comparisons": 9,
    "designs": 5,
    "attempting": 1,
    "answer": 1,
    "questions": 1,
    "preprocess": 1,
    "tackling": 1,
    "sectioniv": 1,
    "designate": 3,
    "auto": 14,
    "alsocompare": 1,
    "designated": 1,
    "understand": 1,
    "formance": 1,
    "notuse": 1,
    "nondeseasonalizing": 2,
    "spreadfactor": 1,
    "formula": 2,
    "nding": 1,
    "grid": 1,
    "thespread": 1,
    "ranges": 1,
    "increment": 1,
    "sf": 2,
    "con": 4,
    "guration": 1,
    "treated": 1,
    "baseline": 1,
    "changingtable": 1,
    "wilcoxon": 3,
    "signed": 2,
    "testresults": 1,
    "allcomparison": 1,
    "sp": 2,
    "spe": 1,
    "keeping": 1,
    "st": 2,
    "unchanged": 1,
    "cance": 1,
    "differences": 1,
    "pairwise": 2,
    "wsrt": 4,
    "hypothesis": 1,
    "normal": 1,
    "makes": 3,
    "fewer": 1,
    "stringent": 1,
    "assumptions": 1,
    "distributions": 1,
    "powerful": 1,
    "detecting": 1,
    "existence": 1,
    "cantdifferences": 1,
    "setting": 2,
    "matched": 1,
    "pair": 1,
    "summarizes": 2,
    "follow": 1,
    "conclusions": 5,
    "made": 2,
    "statistically": 4,
    "fromthe": 1,
    "smaller": 1,
    "sincethe": 1,
    "negative": 1,
    "trending": 1,
    "improvement": 1,
    "fourth": 1,
    "determination": 2,
    "dent": 1,
    "words": 1,
    "equally": 2,
    "interms": 1,
    "advan": 1,
    "tageous": 1,
    "evaluatingthree": 1,
    "dsmape": 1,
    "though": 1,
    "insigni": 1,
    "refers": 1,
    "thru": 1,
    "comparedin": 1,
    "combi": 1,
    "nations": 1,
    "effect": 1,
    "interaction": 1,
    "thedesigns": 1,
    "cautious": 2,
    "drawing": 1,
    "experiments": 3,
    "doe": 4,
    "formed": 1,
    "ign": 1,
    "forfusion": 1,
    "min": 2,
    "variance": 2,
    "ofgrnns": 1,
    "ve": 3,
    "dista": 1,
    "nces": 1,
    "factorial": 1,
    "total": 1,
    "anov": 3,
    "numberof": 1,
    "again": 1,
    "about": 1,
    "generalizing": 1,
    "completed": 1,
    "main": 2,
    "limitation": 1,
    "designed": 2,
    "nottable": 1,
    "esults": 1,
    "source": 1,
    "df": 2,
    "sum": 1,
    "squares": 1,
    "square": 1,
    "degree": 2,
    "freedom": 1,
    "always": 1,
    "certain": 1,
    "carefully": 2,
    "handcrafted": 1,
    "rather": 1,
    "extend": 2,
    "ity": 1,
    "optimized": 1,
    "exhaustively": 1,
    "nonstationary": 1,
    "ourmodeling": 1,
    "incorporate": 1,
    "hence": 1,
    "drawn": 2,
    "wellover": 1,
    "nonbusiness": 2,
    "interesting": 1,
    "envision": 1,
    "potentially": 2,
    "bene": 1,
    "aspects": 1,
    "users": 2,
    "gain": 1,
    "ora": 1,
    "default": 1,
    "tools": 1,
    "options": 1,
    "choosing": 1,
    "strategiesor": 1,
    "gurations": 2,
    "onclusion": 1,
    "applica": 1,
    "tions": 1,
    "lacking": 1,
    "attempted": 1,
    "todevelop": 1,
    "introducing": 1,
    "sev": 1,
    "eral": 1,
    "thatconsisted": 1,
    "heterogeneous": 1,
    "applicability": 1,
    "inthis": 1,
    "candidate": 1,
    "thanks": 1,
    "base": 1,
    "respect": 1,
    "mostof": 1,
    "wh": 1,
    "ich": 1,
    "feasible": 1,
    "property": 1,
    "certainly": 2,
    "go": 1,
    "maturing": 1,
    "sim": 1,
    "improvements": 1,
    "fying": 1,
    "salient": 1,
    "noncontiguous": 1,
    "stated": 1,
    "earlier": 1,
    "thorough": 1,
    "robustness": 1,
    "todifferent": 1,
    "pursuing": 1,
    "cknowledgment": 1,
    "thank": 2,
    "allowing": 1,
    "anonymous": 1,
    "reviewers": 1,
    "constructive": 1,
    "comments": 1,
    "references": 1,
    "patuwo": 1,
    "hu": 2,
    "art": 1,
    "int": 22,
    "pp": 59,
    "mar": 3,
    "grafeille": 1,
    "eval": 1,
    "uation": 1,
    "framework": 1,
    "sales": 1,
    "proc": 8,
    "conf": 5,
    "artif": 4,
    "intell": 6,
    "las": 1,
    "vegas": 1,
    "nv": 1,
    "jun": 6,
    "connor": 2,
    "remus": 1,
    "manage": 1,
    "sci": 4,
    "jul": 3,
    "swanson": 1,
    "white": 1,
    "econometric": 1,
    "cao": 1,
    "schnied": 1,
    "erjans": 1,
    "share": 1,
    "comparative": 2,
    "alternative": 1,
    "osborn": 1,
    "birchenhall": 1,
    "ndustrial": 1,
    "sep": 2,
    "kwan": 1,
    "yip": 1,
    "yuan": 1,
    "earnings": 1,
    "review": 4,
    "nos": 7,
    "nov": 4,
    "renas": 1,
    "nns": 1,
    "trans": 11,
    "netw": 9,
    "univariate": 1,
    "hibon": 2,
    "advances": 2,
    "competitionon": 1,
    "makridakis": 1,
    "conclu": 1,
    "sions": 1,
    "implications": 1,
    "el": 3,
    "shoura": 1,
    "shaheen": 1,
    "sherif": 1,
    "networ": 1,
    "case": 1,
    "feb": 3,
    "vere": 1,
    "jones": 1,
    "earthquake": 1,
    "risk": 1,
    "dec": 5,
    "khan": 1,
    "abraham": 1,
    "comput": 5,
    "appl": 5,
    "hippert": 1,
    "pedreira": 1,
    "souza": 1,
    "term": 6,
    "power": 1,
    "syst": 6,
    "net": 1,
    "airline": 1,
    "connors": 1,
    "martin": 1,
    "atlas": 1,
    "kuan": 1,
    "exchange": 1,
    "rates": 1,
    "feedforward": 1,
    "econ": 2,
    "giles": 1,
    "lawrence": 1,
    "tsoi": 1,
    "grammatical": 1,
    "inference": 1,
    "mach": 4,
    "parlos": 1,
    "rais": 1,
    "dynamic": 1,
    "wang": 2,
    "yu": 1,
    "li": 2,
    "cybern": 4,
    "guangzhou": 2,
    "china": 2,
    "aug": 2,
    "liang": 2,
    "jan": 3,
    "firat": 1,
    "hydrol": 1,
    "earth": 1,
    "bodyanskiy": 1,
    "pliss": 1,
    "ynokurova": 1,
    "adaptive": 1,
    "wavelet": 1,
    "neuro": 1,
    "emulation": 1,
    "inf": 3,
    "theories": 1,
    "gayar": 1,
    "shishiny": 1,
    "empiri": 1,
    "cal": 1,
    "rev": 1,
    "zhu": 2,
    "siew": 1,
    "neurocomputing": 2,
    "miche": 1,
    "weiss": 1,
    "lendasse": 3,
    "predic": 1,
    "projection": 1,
    "op": 1,
    "congr": 1,
    "bayro": 1,
    "corrochano": 1,
    "arana": 1,
    "daniel": 1,
    "machines": 1,
    "recurrence": 1,
    "dai": 2,
    "worrell": 1,
    "connectivity": 1,
    "ex": 1,
    "amination": 1,
    "existing": 1,
    "armstrong": 3,
    "principles": 1,
    "handbook": 1,
    "researchers": 1,
    "practitioners": 1,
    "norwell": 1,
    "kluwer": 1,
    "clemen": 1,
    "annotated": 1,
    "bibliog": 1,
    "raphy": 1,
    "anal": 2,
    "oct": 3,
    "boosted": 1,
    "bone": 1,
    "cardot": 1,
    "foundation": 1,
    "englewood": 1,
    "cliffs": 1,
    "nj": 1,
    "prentice": 1,
    "hall": 2,
    "specht": 1,
    "husain": 1,
    "khalid": 1,
    "yusof": 1,
    "clustering": 1,
    "ized": 1,
    "meansclustering": 1,
    "region": 1,
    "tencon": 1,
    "luo": 1,
    "le": 1,
    "ar": 1,
    "niu": 1,
    "gu": 1,
    "tripathi": 1,
    "upadhyay": 1,
    "singh": 1,
    "probabilistic": 1,
    "electricity": 1,
    "market": 1,
    "electr": 1,
    "kim": 2,
    "lee": 1,
    "parka": 1,
    "choi": 2,
    "randomi": 1,
    "zed": 1,
    "vacuum": 1,
    "boston": 1,
    "chapman": 1,
    "kennedy": 1,
    "gavin": 1,
    "jeremy": 1,
    "rachel": 1,
    "xin": 1,
    "diversity": 1,
    "creation": 1,
    "survey": 1,
    "categorization": 1,
    "bonissone": 1,
    "goebel": 1,
    "triangular": 1,
    "norms": 1,
    "workshop": 1,
    "cagliari": 1,
    "italy": 1,
    "xu": 1,
    "krzyzak": 1,
    "suen": 1,
    "handwriting": 1,
    "recognition": 1,
    "man": 2,
    "cho": 1,
    "integral": 1,
    "aniand": 1,
    "deriche": 1,
    "technique": 1,
    "dempster": 1,
    "res": 1,
    "algorithms": 1,
    "york": 2,
    "wiley": 2,
    "kohavi": 1,
    "george": 1,
    "wrappers": 1,
    "nakamor": 1,
    "ang": 1,
    "vari": 1,
    "ables": 1,
    "hollm": 1,
    "en": 1,
    "variable": 1,
    "autocorrelationand": 1,
    "spectral": 1,
    "eur": 1,
    "symp": 1,
    "predict": 1,
    "helsinki": 1,
    "finland": 1,
    "sorjamaaa": 1,
    "jin": 1,
    "reyhania": 1,
    "jia": 1,
    "ology": 1,
    "look": 1,
    "tashman": 1,
    "tests": 1,
    "parisons": 1,
    "ranking": 1,
    "biometrics": 1,
    "hollander": 1,
    "wolfe": 1,
    "sm": 1,
    "ph": 1,
    "mechanical": 1,
    "engineering": 1,
    "rensselaer": 1,
    "polytechnic": 1,
    "institute": 1,
    "troy": 1,
    "electric": 1,
    "company": 1,
    "fair": 1,
    "ct": 1,
    "currently": 1,
    "seniorresearcher": 1,
    "specialties": 1,
    "advanced": 1,
    "drivenanalytic": 1,
    "anomaly": 1,
    "detection": 1,
    "diagnos": 1,
    "tics": 1,
    "prognostics": 2,
    "health": 2,
    "management": 2,
    "indus": 1,
    "assets": 1,
    "jet": 1,
    "engines": 1,
    "gas": 2,
    "turbines": 1,
    "oil": 1,
    "equipment": 1,
    "authored": 1,
    "ove": 1,
    "journals": 1,
    "conference": 1,
    "proceedings": 1,
    "led": 1,
    "patents": 1,
    "interests": 1,
    "analytics": 1,
    "dr": 1,
    "editor": 1,
    "international": 2,
    "journal": 2,
    "editorial": 1,
    "board": 1
}