{
    "review": 6,
    "article": 4,
    "deep": 157,
    "learning": 165,
    "time": 182,
    "series": 144,
    "forecasting": 87,
    "survey": 13,
    "jose": 1,
    "torres": 12,
    "dalil": 1,
    "hadjout": 2,
    "abderrazak": 1,
    "sebaa": 2,
    "marti": 7,
    "nez": 7,
    "lvarez": 6,
    "alicia": 2,
    "abstract": 1,
    "become": 2,
    "very": 7,
    "intensive": 2,
    "eld": 8,
    "research": 15,
    "which": 26,
    "even": 6,
    "increasing": 3,
    "recent": 5,
    "years": 6,
    "neural": 100,
    "networks": 54,
    "proved": 1,
    "powerful": 6,
    "achieving": 2,
    "high": 20,
    "accuracy": 3,
    "many": 20,
    "application": 21,
    "elds": 5,
    "these": 27,
    "reasons": 2,
    "they": 9,
    "one": 38,
    "most": 32,
    "widely": 6,
    "used": 56,
    "methods": 20,
    "machine": 21,
    "solve": 4,
    "problems": 16,
    "dealing": 3,
    "with": 75,
    "big": 34,
    "data": 98,
    "nowadays": 4,
    "this": 63,
    "work": 15,
    "problem": 13,
    "initially": 1,
    "formulated": 1,
    "along": 5,
    "its": 12,
    "mathematical": 7,
    "fundamentals": 2,
    "then": 5,
    "common": 5,
    "architectures": 25,
    "that": 52,
    "currently": 2,
    "being": 8,
    "successfully": 1,
    "applied": 10,
    "predict": 6,
    "described": 10,
    "highlighting": 2,
    "their": 6,
    "advantages": 1,
    "limitations": 2,
    "particular": 6,
    "attention": 7,
    "given": 6,
    "feed": 11,
    "forward": 15,
    "recurrent": 32,
    "including": 3,
    "elman": 24,
    "long": 28,
    "short": 27,
    "term": 27,
    "memory": 16,
    "gated": 11,
    "units": 21,
    "andbidirectional": 1,
    "convolutional": 30,
    "practical": 5,
    "aspects": 5,
    "such": 20,
    "setting": 1,
    "values": 29,
    "hyper": 30,
    "parameters": 32,
    "choice": 3,
    "suitable": 2,
    "frameworks": 15,
    "successful": 2,
    "also": 22,
    "provided": 3,
    "discussed": 3,
    "several": 9,
    "fruitful": 2,
    "analyzed": 1,
    "obtained": 4,
    "good": 3,
    "performance": 9,
    "reviewed": 3,
    "result": 2,
    "gaps": 3,
    "been": 33,
    "identi": 6,
    "ed": 8,
    "literature": 9,
    "domains": 3,
    "thus": 7,
    "expecting": 1,
    "inspire": 2,
    "new": 13,
    "better": 7,
    "forms": 2,
    "knowledge": 7,
    "keywords": 1,
    "introduction": 2,
    "interest": 2,
    "processing": 25,
    "huge": 1,
    "amounts": 1,
    "ex": 8,
    "perienced": 1,
    "rapid": 1,
    "increase": 1,
    "during": 4,
    "past": 6,
    "decade": 1,
    "due": 7,
    "massive": 1,
    "deployment": 2,
    "smart": 6,
    "so": 2,
    "cial": 4,
    "media": 2,
    "platforms": 2,
    "generate": 2,
    "continu": 1,
    "ous": 1,
    "basis": 2,
    "situation": 1,
    "poses": 1,
    "challenges": 3,
    "storing": 1,
    "disks": 1,
    "or": 45,
    "making": 5,
    "available": 12,
    "required": 1,
    "computational": 7,
    "resources": 7,
    "analytics": 3,
    "emerges": 1,
    "context": 3,
    "an": 38,
    "es": 9,
    "sential": 1,
    "process": 14,
    "focused": 3,
    "ef": 8,
    "ciently": 2,
    "collecting": 1,
    "organiz": 1,
    "ing": 12,
    "analyzing": 2,
    "aim": 3,
    "discovering": 1,
    "patterns": 3,
    "extracting": 1,
    "valuable": 1,
    "information": 29,
    "organizations": 2,
    "helps": 1,
    "identify": 1,
    "opportunities": 1,
    "smarter": 1,
    "moves": 2,
    "leads": 1,
    "more": 16,
    "cient": 8,
    "operations": 2,
    "higher": 5,
    "pro": 6,
    "ts": 1,
    "from": 42,
    "paradigms": 1,
    "cur": 1,
    "rently": 1,
    "da": 4,
    "ta": 1,
    "lights": 1,
    "because": 3,
    "outstanding": 1,
    "scale": 6,
    "increases": 1,
    "layer": 30,
    "computa": 2,
    "tions": 4,
    "done": 2,
    "parallel": 3,
    "by": 86,
    "instance": 5,
    "graphic": 2,
    "gpus": 7,
    "way": 5,
    "scalable": 4,
    "distributed": 11,
    "models": 28,
    "easier": 3,
    "built": 2,
    "provide": 6,
    "much": 5,
    "speed": 11,
    "depth": 4,
    "allows": 8,
    "complex": 5,
    "non": 1,
    "linear": 5,
    "functions": 2,
    "but": 15,
    "turn": 1,
    "compu": 1,
    "tational": 1,
    "costs": 1,
    "numerous": 1,
    "applications": 11,
    "both": 10,
    "supervised": 1,
    "unsuper": 1,
    "vised": 1,
    "abundantly": 1,
    "found": 8,
    "litera": 1,
    "ture": 3,
    "recognition": 10,
    "classi": 18,
    "cation": 19,
    "were": 6,
    "rst": 3,
    "relevant": 6,
    "uses": 5,
    "achievinggreat": 1,
    "success": 1,
    "speech": 2,
    "text": 3,
    "mining": 10,
    "image": 15,
    "analysis": 17,
    "nevertheless": 1,
    "regres": 1,
    "sion": 1,
    "becoming": 1,
    "quite": 2,
    "popular": 4,
    "mainly": 3,
    "development": 5,
    "archi": 4,
    "tectures": 4,
    "particularly": 2,
    "conceived": 1,
    "deal": 8,
    "indexed": 1,
    "over": 16,
    "case": 5,
    "spe": 1,
    "ci": 1,
    "cally": 5,
    "science": 8,
    "lab": 2,
    "pablo": 2,
    "de": 30,
    "olavide": 2,
    "university": 24,
    "seville": 2,
    "spain": 2,
    "commerce": 1,
    "sadeg": 1,
    "company": 1,
    "sonelgaz": 1,
    "group": 2,
    "bejaia": 4,
    "algeria": 4,
    "laboratory": 1,
    "faculty": 1,
    "exact": 1,
    "sciences": 22,
    "school": 1,
    "technologies": 2,
    "computing": 9,
    "digital": 1,
    "equally": 1,
    "contributing": 1,
    "authors": 18,
    "address": 4,
    "correspondence": 1,
    "troncoso": 7,
    "mail": 1,
    "atrolor": 1,
    "upo": 1,
    "esbig": 1,
    "volume": 3,
    "number": 24,
    "ann": 2,
    "liebert": 1,
    "inc": 1,
    "doi": 2,
    "downloaded": 19,
    "national": 20,
    "computer": 24,
    "emerging": 21,
    "islamabad": 19,
    "pakistan": 19,
    "www": 20,
    "liebertpub": 19,
    "com": 33,
    "personal": 19,
    "use": 32,
    "only": 22,
    "set": 7,
    "measures": 1,
    "collected": 3,
    "tervals": 1,
    "ordered": 2,
    "chronologically": 1,
    "nition": 8,
    "it": 45,
    "hard": 3,
    "nd": 4,
    "physical": 3,
    "chemical": 1,
    "phenomena": 1,
    "without": 3,
    "variables": 2,
    "evolve": 1,
    "reason": 6,
    "proposal": 1,
    "approaches": 4,
    "almost": 4,
    "scienti": 2,
    "disciplines": 1,
    "statistical": 2,
    "onward": 1,
    "especially": 1,
    "those": 3,
    "based": 73,
    "box": 3,
    "jenkins": 3,
    "methodology": 1,
    "appearance": 1,
    "learn": 6,
    "regression": 3,
    "mod": 2,
    "els": 2,
    "proposed": 4,
    "outperforming": 1,
    "former": 1,
    "remained": 1,
    "baseline": 1,
    "works": 15,
    "however": 9,
    "superior": 1,
    "results": 6,
    "effort": 1,
    "put": 2,
    "into": 11,
    "developing": 2,
    "architecture": 31,
    "mentioned": 1,
    "earlier": 2,
    "primary": 1,
    "motivation": 1,
    "behind": 2,
    "compre": 1,
    "hensive": 1,
    "understanding": 1,
    "researchers": 2,
    "interested": 2,
    "fore": 6,
    "casting": 4,
    "further": 3,
    "overviews": 3,
    "techniques": 14,
    "proven": 2,
    "expected": 1,
    "bet": 1,
    "ter": 1,
    "although": 10,
    "other": 7,
    "surveys": 1,
    "discussing": 1,
    "properties": 4,
    "publishe": 1,
    "dd": 2,
    "gt": 1,
    "ep": 2,
    "ty": 2,
    "majority": 3,
    "them": 10,
    "general": 5,
    "overview": 4,
    "ory": 1,
    "zhang": 21,
    "et": 125,
    "al": 132,
    "researches": 1,
    "th": 7,
    "eir": 1,
    "formula": 1,
    "tion": 14,
    "feature": 6,
    "another": 8,
    "remarkable": 1,
    "ref": 19,
    "intro": 1,
    "duced": 1,
    "open": 3,
    "source": 3,
    "framework": 13,
    "implemented": 2,
    "algorithms": 9,
    "east": 1,
    "anglia": 1,
    "californiain": 1,
    "riverside": 1,
    "repository": 2,
    "mayer": 2,
    "jacobsen": 2,
    "published": 4,
    "about": 4,
    "sca": 1,
    "pl": 1,
    "go": 4,
    "tributed": 1,
    "infrastructures": 2,
    "focus": 4,
    "was": 8,
    "placed": 2,
    "tools": 3,
    "discussion": 1,
    "existing": 4,
    "rest": 2,
    "structured": 1,
    "follows": 4,
    "formulation": 4,
    "sec": 1,
    "section": 12,
    "introduces": 2,
    "typically": 4,
    "con": 10,
    "sectionprovides": 1,
    "cluding": 1,
    "implementation": 7,
    "parameter": 7,
    "tuning": 3,
    "hardware": 6,
    "must": 5,
    "considered": 2,
    "when": 12,
    "ap": 6,
    "plying": 1,
    "forecast": 25,
    "papers": 2,
    "sorted": 1,
    "cast": 2,
    "finally": 2,
    "lessons": 1,
    "learned": 1,
    "clusions": 2,
    "drawn": 2,
    "conclusions": 2,
    "provides": 2,
    "timeseries": 1,
    "description": 4,
    "ofthe": 1,
    "main": 9,
    "components": 5,
    "compo": 3,
    "nents": 3,
    "mathema": 1,
    "tical": 1,
    "introduced": 2,
    "final": 1,
    "remarks": 1,
    "length": 3,
    "seri": 1,
    "ned": 9,
    "sequence": 12,
    "chrono": 1,
    "logically": 1,
    "observed": 2,
    "variable": 5,
    "measured": 2,
    "continuous": 1,
    "thevalues": 1,
    "sampled": 1,
    "constant": 3,
    "intervals": 2,
    "xed": 2,
    "sampling": 1,
    "frequency": 3,
    "holds": 1,
    "true": 2,
    "not": 14,
    "every": 1,
    "modeled": 4,
    "some": 15,
    "following": 4,
    "missing": 3,
    "reliability": 1,
    "collection": 2,
    "there": 14,
    "lot": 2,
    "strat": 1,
    "egies": 1,
    "imputing": 1,
    "formation": 4,
    "omitting": 1,
    "entire": 2,
    "record": 2,
    "outlying": 1,
    "issue": 5,
    "appears": 1,
    "frequently": 2,
    "robust": 4,
    "statistics": 3,
    "chosen": 2,
    "remove": 1,
    "simply": 1,
    "incorporate": 1,
    "model": 57,
    "irregular": 2,
    "periods": 2,
    "called": 6,
    "either": 2,
    "unevenly": 1,
    "spaced": 1,
    "se": 7,
    "ries": 4,
    "if": 4,
    "enough": 2,
    "streams": 2,
    "issues": 2,
    "handled": 1,
    "natively": 1,
    "irregularly": 1,
    "should": 2,
    "accounted": 1,
    "preprocessing": 1,
    "out": 7,
    "scope": 1,
    "please": 1,
    "refer": 2,
    "detailed": 2,
    "usually": 6,
    "characterized": 1,
    "three": 8,
    "trend": 7,
    "seasonality": 7,
    "known": 4,
    "residuals": 5,
    "scribed": 2,
    "later": 2,
    "movement": 2,
    "exhibits": 1,
    "observation": 1,
    "period": 2,
    "considering": 3,
    "irregularities": 1,
    "texts": 1,
    "component": 5,
    "variation": 1,
    "different": 13,
    "kinds": 3,
    "trends": 1,
    "exponential": 1,
    "parabolic": 1,
    "ones": 2,
    "variations": 1,
    "occur": 1,
    "speci": 9,
    "regular": 2,
    "may": 2,
    "useful": 7,
    "hibit": 1,
    "similar": 1,
    "integrates": 1,
    "effects": 2,
    "rea": 1,
    "sonably": 1,
    "stable": 1,
    "magnitude": 1,
    "direction": 1,
    "caused": 1,
    "factors": 3,
    "climate": 1,
    "economical": 1,
    "cycles": 2,
    "festivities": 1,
    "cyclic": 1,
    "oscillations": 3,
    "calculated": 1,
    "removed": 1,
    "residual": 4,
    "remain": 1,
    "va": 1,
    "lues": 1,
    "sometimes": 1,
    "mask": 1,
    "outlier": 1,
    "cope": 1,
    "uctuations": 1,
    "diverse": 1,
    "origin": 2,
    "makes": 4,
    "prediction": 41,
    "impossible": 1,
    "any": 3,
    "chance": 1,
    "detected": 1,
    "thought": 1,
    "precursors": 1,
    "changes": 2,
    "aggregate": 1,
    "real": 2,
    "world": 1,
    "present": 3,
    "meaningful": 1,
    "ir": 1,
    "stationary": 1,
    "mean": 3,
    "variance": 1,
    "turning": 1,
    "ponent": 2,
    "challenging": 2,
    "thisreason": 1,
    "make": 9,
    "accurate": 5,
    "predictions": 4,
    "tremely": 1,
    "dif": 1,
    "cult": 1,
    "classical": 3,
    "meth": 2,
    "ods": 2,
    "try": 2,
    "decompose": 1,
    "target": 2,
    "separately": 1,
    "effectiveness": 2,
    "technique": 1,
    "assessed": 1,
    "according": 3,
    "capability": 1,
    "where": 15,
    "shown": 6,
    "graphically": 1,
    "represented": 5,
    "particu": 1,
    "lar": 1,
    "axis": 2,
    "whereas": 1,
    "iden": 1,
    "ti": 1,
    "recorded": 2,
    "punctual": 1,
    "stamps": 1,
    "representation": 1,
    "visual": 2,
    "detection": 12,
    "features": 6,
    "oscilla": 1,
    "amplitude": 2,
    "seasons": 1,
    "istence": 1,
    "anomalous": 1,
    "outliers": 1,
    "figure": 10,
    "depictsan": 1,
    "using": 62,
    "additive": 1,
    "function": 20,
    "sin": 1,
    "consistently": 1,
    "made": 7,
    "same": 3,
    "amount": 1,
    "random": 9,
    "num": 1,
    "bers": 1,
    "interval": 1,
    "univariate": 3,
    "dependent": 3,
    "multivariate": 8,
    "than": 5,
    "dra": 1,
    "matically": 1,
    "differ": 1,
    "between": 7,
    "system": 3,
    "handle": 2,
    "indistinctly": 1,
    "hand": 4,
    "let": 2,
    "t\u00feh": 4,
    "lvalues": 1,
    "historical": 2,
    "each": 16,
    "represents": 1,
    "value": 9,
    "yat": 1,
    "consists": 3,
    "estimating": 3,
    "denoted": 2,
    "minimizing": 2,
    "error": 3,
    "horizon": 2,
    "greater": 1,
    "objective": 1,
    "hnext": 1,
    "after": 5,
    "t\u00fei": 3,
    "situ": 1,
    "ation": 1,
    "best": 2,
    "reached": 2,
    "minimized": 1,
    "expressed": 1,
    "matrix": 4,
    "form": 1,
    "yi": 1,
    "ng": 2,
    "lgthe": 1,
    "current": 9,
    "sample": 1,
    "yn": 6,
    "bbbbb": 1,
    "ccccca": 1,
    "bbbb": 1,
    "cccca": 1,
    "fig": 8,
    "illustrative": 1,
    "showing": 1,
    "future": 2,
    "hvalues": 1,
    "predicted": 7,
    "remaining": 4,
    "independent": 1,
    "key": 1,
    "depending": 2,
    "samples": 7,
    "well": 6,
    "onsuming": 1,
    "param": 1,
    "eters": 1,
    "optimization": 30,
    "ei": 3,
    "fi": 1,
    "hi": 4,
    "sn": 1,
    "ol": 1,
    "ru": 1,
    "lt": 2,
    "om": 1,
    "odel": 1,
    "how": 4,
    "highly": 5,
    "related": 6,
    "purpose": 4,
    "flexible": 2,
    "nonparametric": 2,
    "modelscould": 1,
    "still": 1,
    "assumes": 1,
    "struc": 1,
    "will": 11,
    "whole": 2,
    "always": 1,
    "approach": 11,
    "allowing": 1,
    "vary": 1,
    "ther": 1,
    "adjusting": 2,
    "parametric": 1,
    "varying": 3,
    "kernel": 4,
    "goal": 1,
    "few": 3,
    "observations": 1,
    "simpler": 2,
    "transforming": 2,
    "preliminary": 2,
    "distrib": 2,
    "uted": 2,
    "arima": 5,
    "recently": 2,
    "remains": 2,
    "serieswith": 1,
    "adapted": 1,
    "ultra": 2,
    "havebeen": 1,
    "clusters": 1,
    "machines": 1,
    "overcome": 1,
    "previous": 5,
    "paragraphs": 2,
    "forecasts": 3,
    "ble": 1,
    "established": 2,
    "nearest": 2,
    "pattern": 7,
    "quence": 3,
    "similarity": 2,
    "theoretical": 1,
    "tour": 1,
    "environments": 4,
    "first": 3,
    "state": 7,
    "art": 3,
    "carried": 4,
    "rameworks": 1,
    "network": 87,
    "dffnn": 17,
    "alsocalled": 1,
    "multi": 14,
    "perceptron": 2,
    "arose": 1,
    "inability": 1,
    "single": 5,
    "certain": 3,
    "func": 2,
    "composed": 2,
    "input": 16,
    "output": 9,
    "hidden": 17,
    "layers": 18,
    "addition": 7,
    "neurons": 12,
    "determined": 1,
    "relationships": 1,
    "two": 8,
    "secutive": 1,
    "weights": 17,
    "calcu": 1,
    "lated": 1,
    "training": 11,
    "phase": 2,
    "basic": 7,
    "computed": 5,
    "cost": 10,
    "means": 3,
    "gradient": 6,
    "descent": 1,
    "back": 1,
    "propagation": 3,
    "algorithm": 7,
    "calculate": 1,
    "equation": 2,
    "wl": 4,
    "aal": 1,
    "alare": 1,
    "activation": 14,
    "vector": 3,
    "aandbl": 2,
    "aare": 2,
    "bias": 7,
    "corresponding": 3,
    "gis": 4,
    "alvalues": 1,
    "si": 2,
    "nt": 3,
    "sf": 1,
    "recti": 1,
    "unit": 22,
    "commonly": 3,
    "except": 1,
    "obtain": 4,
    "gener": 2,
    "ally": 1,
    "hyperbolic": 1,
    "tangent": 1,
    "tanh": 5,
    "advance": 1,
    "ne": 1,
    "rate": 6,
    "momentum": 3,
    "iterations": 1,
    "mini": 2,
    "batch": 6,
    "size": 12,
    "among": 3,
    "others": 4,
    "great": 2,
    "uence": 3,
    "convergence": 3,
    "descend": 1,
    "optimal": 2,
    "impor": 2,
    "tant": 2,
    "greatly": 2,
    "re": 6,
    "sults": 1,
    "detail": 1,
    "rnns": 9,
    "callydesigned": 1,
    "sequential": 1,
    "sequences": 6,
    "words": 1,
    "translation": 4,
    "audio": 1,
    "characteristic": 1,
    "whi": 1,
    "ch": 1,
    "temporal": 20,
    "pendency": 1,
    "traditional": 2,
    "neuralnetworks": 2,
    "cannot": 1,
    "take": 1,
    "account": 2,
    "dependencies": 3,
    "arise": 1,
    "precisely": 1,
    "therefore": 3,
    "rnnare": 1,
    "types": 2,
    "inputs": 2,
    "outputs": 3,
    "inputsand": 1,
    "ad": 2,
    "dition": 2,
    "inputdata": 1,
    "rnn": 20,
    "ser": 1,
    "ies": 2,
    "iand": 1,
    "xi": 2,
    "actual": 1,
    "brie": 1,
    "enn": 14,
    "incorporated": 2,
    "tstate": 2,
    "sists": 1,
    "connected": 4,
    "equal": 1,
    "thisfig": 1,
    "save": 1,
    "copy": 1,
    "waxt\u00feuaat": 1,
    "atare": 1,
    "xtis": 1,
    "saved": 2,
    "wa": 1,
    "ua": 1,
    "andbaare": 1,
    "activa": 1,
    "standard": 4,
    "suf": 3,
    "fer": 1,
    "vanishing": 3,
    "decreasing": 1,
    "creases": 1,
    "indeed": 1,
    "practically": 1,
    "becomes": 1,
    "null": 2,
    "prevent": 3,
    "quire": 1,
    "memorizing": 1,
    "contained": 1,
    "complete": 2,
    "lstm": 38,
    "emerge": 1,
    "gradi": 1,
    "ent": 1,
    "gates": 6,
    "keep": 1,
    "longstanding": 1,
    "discard": 1,
    "irrelevant": 1,
    "gfforget": 1,
    "gate": 6,
    "guupdate": 2,
    "gooutput": 1,
    "gfdecides": 1,
    "what": 2,
    "thrown": 1,
    "away": 1,
    "close": 2,
    "forgottenwhereas": 1,
    "ude": 1,
    "cides": 1,
    "ctto": 1,
    "update": 3,
    "ct": 15,
    "ctis": 1,
    "updated": 2,
    "gf": 3,
    "andgu": 1,
    "godecides": 1,
    "next": 3,
    "xtcurrent": 1,
    "passed": 1,
    "through": 5,
    "thersigmoid": 1,
    "compute": 3,
    "pute": 1,
    "ctnew": 1,
    "date": 2,
    "equations": 2,
    "ning": 1,
    "ect": 1,
    "wc": 2,
    "xt": 8,
    "\u00febc": 2,
    "gu": 4,
    "wu": 11,
    "\u00febu": 2,
    "wf": 2,
    "\u00febf": 1,
    "wo": 2,
    "\u00febo": 1,
    "ct\u00fegf": 1,
    "bu": 1,
    "bf": 1,
    "boare": 1,
    "biases": 1,
    "govern": 2,
    "behavior": 2,
    "theg": 1,
    "andgogates": 1,
    "respectively": 5,
    "wcandbcare": 2,
    "ctmemory": 4,
    "cell": 2,
    "candidate": 3,
    "shows": 3,
    "picture": 1,
    "operators": 1,
    "element": 2,
    "wise": 2,
    "vectors": 1,
    "multiplication": 1,
    "sum": 2,
    "gru": 26,
    "net": 8,
    "lstms": 3,
    "emerged": 2,
    "simpli": 1,
    "tional": 3,
    "versions": 1,
    "converged": 1,
    "possible": 2,
    "improve": 3,
    "capturing": 1,
    "range": 3,
    "effective": 1,
    "effec": 1,
    "tive": 1,
    "since": 3,
    "instead": 2,
    "computationally": 1,
    "faster": 2,
    "grrelevance": 1,
    "gugate": 1,
    "decide": 1,
    "whether": 3,
    "grgate": 1,
    "deter": 1,
    "mines": 1,
    "candi": 1,
    "gr": 2,
    "wr": 1,
    "\u00febr": 1,
    "ct\u00fe": 1,
    "wuandwr": 1,
    "buandbrare": 1,
    "guandgr": 1,
    "bidirectional": 8,
    "natural": 2,
    "language": 6,
    "nlp": 2,
    "instant": 2,
    "before": 3,
    "needed": 5,
    "brnns": 2,
    "kind": 1,
    "disadvantage": 2,
    "unidirectional": 3,
    "brnn": 15,
    "backward": 4,
    "agactivation": 1,
    "wx": 1,
    "af": 2,
    "ab": 1,
    "\u00febx": 1,
    "wxandbxare": 1,
    "tandab": 1,
    "presents": 1,
    "seen": 2,
    "together": 1,
    "puted": 2,
    "fact": 1,
    "unitsis": 1,
    "neu": 1,
    "ral": 1,
    "drnn": 6,
    "stacked": 2,
    "hid": 1,
    "den": 1,
    "sections": 1,
    "illustrates": 1,
    "deteriorates": 1,
    "addressthis": 1,
    "mechanisms": 1,
    "ideas": 1,
    "neuralfig": 1,
    "pay": 2,
    "part": 2,
    "while": 1,
    "generating": 1,
    "atten": 1,
    "cnn": 32,
    "presentedin": 1,
    "fukushima": 2,
    "mon": 1,
    "vision": 4,
    "cnns": 4,
    "convolu": 3,
    "pooling": 7,
    "fully": 3,
    "task": 3,
    "convolution": 13,
    "lters": 1,
    "prede": 1,
    "plied": 3,
    "operation": 2,
    "tween": 1,
    "matrices": 2,
    "products": 1,
    "reduces": 1,
    "speeding": 1,
    "preventing": 1,
    "tting": 2,
    "av": 3,
    "erage": 1,
    "max": 1,
    "summarize": 2,
    "valuesby": 1,
    "maximum": 1,
    "extracted": 2,
    "dense": 1,
    "last": 6,
    "attened": 1,
    "resulting": 1,
    "depicts": 1,
    "overall": 1,
    "ar": 4,
    "chitecture": 1,
    "variant": 1,
    "convo": 1,
    "lutional": 1,
    "tcns": 2,
    "competing": 2,
    "directly": 1,
    "drnns": 1,
    "terms": 1,
    "execution": 2,
    "times": 2,
    "requirements": 2,
    "activations": 1,
    "dilated": 10,
    "select": 2,
    "contribute": 1,
    "tothe": 1,
    "captures": 1,
    "local": 2,
    "fd": 3,
    "dis": 1,
    "dilation": 2,
    "factor": 1,
    "fis": 1,
    "lter": 4,
    "tcnn": 1,
    "applying": 2,
    "moreover": 3,
    "necessary": 1,
    "generic": 4,
    "modules": 1,
    "deeper": 1,
    "larger": 2,
    "tcn": 18,
    "achieve": 2,
    "sta": 1,
    "bilization": 1,
    "blocks": 3,
    "consist": 1,
    "add": 1,
    "theactivation": 1,
    "afd": 1,
    "\u00febl": 1,
    "a\u00feal": 1,
    "dfactor": 1,
    "tis": 1,
    "neuron": 1,
    "ac": 1,
    "tivation": 1,
    "multilayer": 1,
    "rela": 1,
    "tively": 1,
    "simple": 2,
    "requires": 3,
    "highlevel": 1,
    "technical": 1,
    "expertise": 1,
    "considerable": 1,
    "vestment": 2,
    "implement": 2,
    "le": 2,
    "expert": 3,
    "demanded": 1,
    "implementations": 1,
    "reduce": 3,
    "design": 1,
    "train": 1,
    "companies": 1,
    "veloping": 1,
    "allow": 2,
    "implementa": 1,
    "idea": 1,
    "interface": 1,
    "having": 2,
    "too": 3,
    "complexity": 2,
    "depend": 3,
    "type": 2,
    "support": 4,
    "programming": 4,
    "run": 3,
    "sense": 1,
    "table": 17,
    "summarizes": 3,
    "includes": 1,
    "cpu": 12,
    "central": 2,
    "predominant": 1,
    "python": 25,
    "gpu": 9,
    "facilitate": 1,
    "require": 1,
    "lines": 3,
    "code": 2,
    "forthis": 1,
    "level": 7,
    "libraries": 7,
    "core": 2,
    "developed": 1,
    "gramming": 1,
    "examples": 3,
    "keras": 7,
    "gluon": 1,
    "advantage": 1,
    "library": 5,
    "syntax": 1,
    "reused": 1,
    "base": 1,
    "facilitating": 1,
    "imple": 1,
    "mentation": 1,
    "lack": 2,
    "exibility": 1,
    "combination": 1,
    "facilitates": 1,
    "important": 4,
    "study": 11,
    "gap": 1,
    "determinethe": 1,
    "quality": 5,
    "performed": 3,
    "adjustment": 1,
    "adjusted": 2,
    "optimiza": 1,
    "dataset": 2,
    "cat": 1,
    "egorized": 1,
    "uenced": 1,
    "characteristics": 3,
    "interfaces": 1,
    "jgpu": 1,
    "javascript": 1,
    "java": 3,
    "julia": 2,
    "scala": 3,
    "clojure": 2,
    "kotlin": 1,
    "matlab": 1,
    "perl": 1,
    "paddlepaddle": 1,
    "opti": 3,
    "mizing": 1,
    "challenge": 1,
    "community": 2,
    "taking": 1,
    "immense": 1,
    "binations": 1,
    "deduced": 1,
    "various": 2,
    "metaheuristics": 3,
    "strategies": 4,
    "strategiesto": 1,
    "optimize": 2,
    "four": 1,
    "major": 1,
    "trial": 2,
    "method": 13,
    "manually": 2,
    "implies": 1,
    "relatively": 1,
    "low": 4,
    "search": 14,
    "space": 4,
    "action": 2,
    "user": 1,
    "modify": 1,
    "nished": 1,
    "large": 9,
    "nite": 2,
    "advis": 1,
    "able": 2,
    "grid": 4,
    "explores": 1,
    "pos": 1,
    "sible": 1,
    "combinations": 2,
    "covers": 1,
    "associated": 1,
    "unvi": 1,
    "apply": 2,
    "alone": 1,
    "cover": 2,
    "ofhyper": 1,
    "generated": 2,
    "within": 1,
    "differentiate": 1,
    "totally": 1,
    "ran": 1,
    "dom": 1,
    "guided": 1,
    "searches": 1,
    "genetic": 3,
    "cle": 1,
    "swarm": 2,
    "neuroevolution": 1,
    "augmenting": 1,
    "oth": 1,
    "ers": 1,
    "wide": 4,
    "added": 2,
    "medium": 4,
    "involved": 3,
    "strategy": 5,
    "oneof": 1,
    "optimizing": 1,
    "mization": 2,
    "bioinspired": 2,
    "covid": 4,
    "presented": 2,
    "probabilistic": 9,
    "tracks": 1,
    "evaluations": 2,
    "assigns": 1,
    "arethose": 1,
    "bayesian": 4,
    "automated": 1,
    "verytable": 1,
    "optimizer": 1,
    "iteration": 3,
    "determines": 3,
    "step": 4,
    "epochs": 1,
    "passes": 1,
    "sub": 1,
    "nonlinearity": 1,
    "extraction": 2,
    "prevents": 3,
    "weight": 2,
    "initialization": 3,
    "explosion": 1,
    "dropout": 2,
    "eliminates": 1,
    "connections": 1,
    "fitting": 2,
    "regularization": 3,
    "stopping": 1,
    "does": 2,
    "stride": 2,
    "pixels": 1,
    "move": 1,
    "filter": 1,
    "padding": 2,
    "processed": 1,
    "channels": 2,
    "convolutions": 2,
    "calculations": 2,
    "nb_stacks": 1,
    "stacks": 1,
    "dilations": 1,
    "stack": 1,
    "capture": 1,
    "drivendeep": 1,
    "designed": 7,
    "compatible": 2,
    "librar": 1,
    "classifying": 2,
    "lan": 1,
    "guage": 1,
    "note": 3,
    "hpolib": 1,
    "supports": 1,
    "decisions": 1,
    "researcher": 1,
    "determine": 1,
    "ensure": 1,
    "hence": 1,
    "ware": 1,
    "contexts": 1,
    "demand": 7,
    "sophisticated": 1,
    "execute": 1,
    "insuf": 1,
    "scalar": 2,
    "tensor": 2,
    "tpu": 4,
    "intelligence": 3,
    "cessing": 1,
    "ipu": 6,
    "co": 1,
    "processor": 2,
    "allocated": 1,
    "graphics": 1,
    "hundreds": 2,
    "thousands": 1,
    "cores": 1,
    "running": 1,
    "atlower": 1,
    "speeds": 1,
    "parallelism": 1,
    "instructions": 1,
    "multiple": 2,
    "play": 1,
    "role": 1,
    "arti": 2,
    "telligence": 1,
    "domain": 4,
    "variety": 2,
    "generation": 5,
    "tpus": 7,
    "google": 2,
    "conference": 19,
    "already": 1,
    "trained": 1,
    "custom": 1,
    "integrated": 2,
    "cir": 1,
    "cuits": 1,
    "compared": 3,
    "tasks": 2,
    "implicitly": 1,
    "reduced": 2,
    "precision": 2,
    "calculation": 1,
    "bits": 1,
    "rasterization": 1,
    "texture": 1,
    "mapping": 2,
    "coined": 1,
    "cchip": 1,
    "tensorflow": 2,
    "generally": 2,
    "speaking": 1,
    "less": 2,
    "computations": 1,
    "normal": 1,
    "perform": 1,
    "individual": 1,
    "millions": 1,
    "pictures": 1,
    "per": 3,
    "day": 3,
    "optimized": 3,
    "batches": 2,
    "highest": 1,
    "throughput": 2,
    "completely": 1,
    "diffe": 1,
    "rent": 1,
    "today": 1,
    "processors": 2,
    "ible": 1,
    "easy": 1,
    "ground": 1,
    "todeliver": 1,
    "importantly": 1,
    "workloads": 1,
    "realized": 1,
    "delivers": 1,
    "arithmetic": 1,
    "ciency": 1,
    "small": 4,
    "sizes": 1,
    "inference": 2,
    "generalize": 1,
    "ability": 1,
    "parallelize": 1,
    "deliversmuch": 1,
    "lower": 2,
    "latencies": 1,
    "interesting": 1,
    "power": 11,
    "consump": 2,
    "explored": 1,
    "perfor": 1,
    "mance": 1,
    "ops": 1,
    "usd": 2,
    "elephas": 1,
    "yes": 7,
    "hyperas": 1,
    "tuner": 1,
    "kerash": 1,
    "pytorch": 3,
    "asic": 1,
    "graph": 1,
    "cloud": 4,
    "services": 1,
    "price": 13,
    "starting": 1,
    "hour": 1,
    "retrieved": 1,
    "march": 1,
    "motivate": 1,
    "relevance": 1,
    "energy": 30,
    "fuels": 2,
    "video": 7,
    "nance": 3,
    "environment": 1,
    "indus": 3,
    "health": 9,
    "widespread": 3,
    "summary": 2,
    "items": 1,
    "highlight": 1,
    "goals": 1,
    "newable": 1,
    "energies": 2,
    "estimates": 1,
    "planning": 3,
    "operat": 1,
    "cluded": 1,
    "vast": 1,
    "chitectures": 3,
    "area": 4,
    "example": 5,
    "electricity": 7,
    "photo": 2,
    "voltaic": 1,
    "load": 11,
    "soot": 2,
    "emission": 2,
    "diesel": 2,
    "en": 3,
    "gines": 1,
    "ensemble": 8,
    "devel": 1,
    "oped": 1,
    "applica": 1,
    "oil": 1,
    "production": 1,
    "hybrid": 12,
    "car": 1,
    "bon": 1,
    "mar": 1,
    "kets": 1,
    "consumption": 4,
    "solar": 3,
    "broad": 1,
    "hu": 2,
    "conducted": 4,
    "cancer": 2,
    "diagno": 1,
    "sis": 1,
    "summarized": 1,
    "studies": 3,
    "recognize": 1,
    "actions": 1,
    "timed": 2,
    "images": 6,
    "monitor": 1,
    "slopes": 2,
    "displacementover": 1,
    "photogrammetry": 3,
    "unmanned": 1,
    "aerial": 1,
    "vehicles": 1,
    "combined": 1,
    "classify": 1,
    "satellite": 3,
    "offer": 1,
    "competitive": 1,
    "predominates": 1,
    "combustion": 2,
    "instability": 2,
    "traf": 5,
    "detect": 4,
    "coronary": 2,
    "artery": 2,
    "stenosis": 2,
    "booming": 1,
    "comes": 1,
    "analyz": 1,
    "videos": 3,
    "miao": 3,
    "estimate": 1,
    "density": 1,
    "maps": 1,
    "vid": 1,
    "eos": 1,
    "dynamically": 1,
    "stress": 3,
    "facialphotographs": 1,
    "financial": 6,
    "misc": 1,
    "challeng": 1,
    "decades": 1,
    "comparison": 1,
    "architec": 2,
    "tures": 2,
    "offers": 1,
    "plexity": 1,
    "methodologies": 1,
    "environmental": 3,
    "areas": 3,
    "wind": 12,
    "temperature": 1,
    "meteorological": 1,
    "beijing": 1,
    "china": 3,
    "mand": 1,
    "refs": 2,
    "correlated": 1,
    "wan": 3,
    "carbon": 3,
    "dioxide": 2,
    "emissions": 2,
    "ood": 2,
    "ornh": 1,
    "swine": 2,
    "industry": 2,
    "industr": 1,
    "sector": 1,
    "carry": 1,
    "ow": 5,
    "purposes": 1,
    "equipment": 2,
    "au": 2,
    "thors": 1,
    "bath": 2,
    "metal": 2,
    "height": 2,
    "electrolysis": 2,
    "cess": 1,
    "life": 4,
    "degradation": 2,
    "materials": 1,
    "inref": 1,
    "concluded": 1,
    "ea": 1,
    "ao": 1,
    "fh": 1,
    "sc": 2,
    "ni": 2,
    "comprehensive": 1,
    "care": 1,
    "diagnosis": 3,
    "prognosis": 2,
    "cardiovascular": 1,
    "disease": 1,
    "usual": 1,
    "ample": 1,
    "accelerate": 1,
    "computation": 2,
    "magnetic": 2,
    "resonance": 1,
    "ngerprint": 1,
    "monitoring": 5,
    "ps": 1,
    "nr": 1,
    "detecting": 2,
    "premature": 2,
    "ventricular": 2,
    "sepsis": 4,
    "backpropagation": 1,
    "incidence": 2,
    "pneumonia": 2,
    "status": 1,
    "critical": 1,
    "patients": 1,
    "vital": 1,
    "cases": 1,
    "miscellaneous": 2,
    "checked": 1,
    "architecturescan": 1,
    "appli": 1,
    "exam": 1,
    "ple": 1,
    "human": 4,
    "activity": 4,
    "anomalies": 1,
    "namely": 1,
    "readers": 1,
    "cybersecurity": 1,
    "exist": 2,
    "yet": 1,
    "second": 2,
    "existence": 1,
    "encourages": 1,
    "conduction": 1,
    "ful": 1,
    "solving": 1,
    "devices": 1,
    "fre": 1,
    "quent": 1,
    "topics": 2,
    "jointly": 2,
    "special": 1,
    "emphasis": 1,
    "reported": 1,
    "lighten": 1,
    "viding": 1,
    "comparative": 3,
    "fu": 7,
    "show": 2,
    "tested": 1,
    "author": 1,
    "disclosure": 1,
    "statement": 1,
    "nancial": 4,
    "interests": 1,
    "funding": 1,
    "supported": 2,
    "spanish": 1,
    "ministry": 1,
    "innovation": 1,
    "universities": 1,
    "under": 5,
    "project": 2,
    "partially": 1,
    "ge": 1,
    "neral": 1,
    "directorate": 1,
    "sci": 16,
    "enti": 2,
    "technological": 1,
    "dgrsdt": 1,
    "prfu": 1,
    "references": 1,
    "plageras": 1,
    "psannis": 1,
    "ke": 1,
    "stergiou": 1,
    "iot": 1,
    "sensor": 3,
    "buildings": 1,
    "futuregener": 1,
    "comput": 27,
    "syst": 12,
    "patil": 1,
    "hp": 1,
    "atique": 1,
    "cdnb": 1,
    "caviar": 1,
    "dragon": 1,
    "naive": 1,
    "bayes": 1,
    "sentiment": 2,
    "affect": 1,
    "social": 2,
    "gama": 1,
    "discovery": 3,
    "uk": 4,
    "chapman": 3,
    "hall": 3,
    "crc": 3,
    "jarrah": 1,
    "oy": 1,
    "yoo": 1,
    "pd": 1,
    "muhaidat": 1,
    "res": 5,
    "dhar": 1,
    "sun": 4,
    "batra": 1,
    "concurrent": 1,
    "nguyen": 2,
    "dlugolinsky": 1,
    "boba": 1,
    "sur": 1,
    "vey": 1,
    "artif": 5,
    "intell": 4,
    "rev": 1,
    "maji": 1,
    "mullins": 1,
    "reduction": 1,
    "entropy": 1,
    "schmidhuber": 2,
    "netw": 2,
    "makridakis": 1,
    "wheelwright": 1,
    "hyndman": 3,
    "rj": 3,
    "usa": 32,
    "john": 2,
    "wiley": 3,
    "sons": 2,
    "chat": 1,
    "gep": 1,
    "gm": 1,
    "control": 7,
    "asencio": 3,
    "corte": 3,
    "riquelme": 1,
    "jc": 1,
    "seriesforecasting": 1,
    "yang": 6,
    "chen": 10,
    "fusion": 3,
    "fawaz": 1,
    "forestier": 1,
    "weber": 1,
    "min": 1,
    "knowl": 6,
    "discov": 2,
    "bagnall": 1,
    "vickers": 1,
    "uea": 1,
    "ucr": 1,
    "online": 9,
    "timeseriesclassi": 1,
    "accessed": 5,
    "april": 5,
    "ha": 1,
    "infra": 1,
    "structures": 1,
    "acm": 4,
    "surv": 1,
    "buuren": 1,
    "imputation": 1,
    "maronna": 1,
    "ra": 1,
    "martin": 1,
    "rd": 1,
    "yohai": 1,
    "vj": 1,
    "theory": 1,
    "tc": 2,
    "eng": 12,
    "appl": 13,
    "shumway": 1,
    "rh": 1,
    "stoffer": 1,
    "ds": 2,
    "springer": 1,
    "athanasopoulos": 1,
    "principles": 1,
    "practice": 1,
    "australia": 1,
    "otexts": 1,
    "wang": 28,
    "kang": 1,
    "arxiv": 24,
    "prints": 12,
    "rakthanmanon": 1,
    "campana": 1,
    "mueen": 1,
    "addressing": 1,
    "trillions": 1,
    "subsequences": 1,
    "dynamictime": 1,
    "warping": 1,
    "trans": 3,
    "jf": 3,
    "galicia": 2,
    "integr": 1,
    "aided": 1,
    "talavera": 3,
    "llames": 3,
    "rl": 1,
    "pe": 3,
    "rez": 3,
    "chaco": 3,
    "neighbors": 1,
    "spark": 1,
    "mv": 1,
    "kwnn": 1,
    "novel": 4,
    "weighted": 1,
    "nearestneighbors": 1,
    "neurocom": 1,
    "puting": 1,
    "bas": 1,
    "rumelhart": 1,
    "hinton": 2,
    "williams": 1,
    "nature": 2,
    "jl": 1,
    "finding": 1,
    "structure": 1,
    "rep": 2,
    "hochreiter": 1,
    "chung": 1,
    "gulcehre": 1,
    "cho": 4,
    "empirical": 7,
    "evaluation": 3,
    "modeling": 3,
    "proceedings": 39,
    "systems": 13,
    "canada": 1,
    "pp": 41,
    "merrienboer": 1,
    "bv": 1,
    "bahdanau": 2,
    "encoder": 1,
    "decoder": 1,
    "ssst": 1,
    "qatar": 1,
    "bengio": 1,
    "align": 1,
    "translate": 1,
    "inte": 3,
    "rnat": 3,
    "iona": 3,
    "lcon": 3,
    "fere": 3,
    "nce": 3,
    "representations": 2,
    "xu": 3,
    "ba": 2,
    "kiros": 1,
    "attend": 1,
    "tell": 1,
    "caption": 1,
    "neocognitron": 1,
    "self": 2,
    "organizing": 1,
    "mechanism": 1,
    "unaffected": 1,
    "shift": 2,
    "position": 2,
    "biol": 2,
    "cybern": 1,
    "hasegawa": 1,
    "matoba": 1,
    "invariant": 1,
    "generalization": 1,
    "neuralnetw": 1,
    "iii": 1,
    "alla": 1,
    "adari": 1,
    "sk": 2,
    "beginning": 1,
    "anomaly": 3,
    "apress": 1,
    "abadi": 1,
    "agarwal": 2,
    "barham": 1,
    "heterogeneous": 3,
    "athttp": 1,
    "org": 1,
    "candel": 1,
    "ledell": 1,
    "arora": 1,
    "http": 2,
    "ai": 1,
    "eclipse": 2,
    "team": 2,
    "https": 4,
    "github": 4,
    "paszke": 1,
    "gross": 1,
    "massa": 1,
    "imperative": 1,
    "style": 1,
    "highper": 1,
    "formance": 1,
    "advances": 1,
    "inneural": 1,
    "vol": 4,
    "jia": 1,
    "shelhamer": 1,
    "donahue": 1,
    "caffe": 1,
    "fast": 2,
    "embedding": 1,
    "intel": 1,
    "nervana": 1,
    "neon": 2,
    "nervanasystems": 1,
    "lastaccessed": 1,
    "tokui": 1,
    "okuta": 1,
    "akiba": 1,
    "chainer": 1,
    "accelerating": 1,
    "cycle": 1,
    "international": 13,
    "ference": 2,
    "theano": 2,
    "expressions": 1,
    "tianqi": 1,
    "li": 14,
    "mxnet": 1,
    "exible": 1,
    "bai": 1,
    "lu": 3,
    "onnx": 3,
    "exchange": 3,
    "onjune": 1,
    "seide": 1,
    "cntk": 1,
    "microsoft": 1,
    "toolkit": 1,
    "sigkdd": 1,
    "chollet": 1,
    "deepmind": 1,
    "revision": 1,
    "sonnet": 1,
    "guo": 2,
    "he": 5,
    "gluoncv": 1,
    "gluonnlp": 1,
    "puter": 1,
    "mach": 3,
    "choi": 1,
    "shallue": 1,
    "cj": 1,
    "nado": 1,
    "comparisons": 1,
    "optimizers": 1,
    "you": 1,
    "jordan": 1,
    "mi": 2,
    "decay": 1,
    "help": 1,
    "modern": 1,
    "sinha": 1,
    "singh": 2,
    "tn": 1,
    "verma": 1,
    "epoch": 1,
    "determination": 1,
    "organized": 1,
    "map": 1,
    "som": 1,
    "geosci": 1,
    "masters": 1,
    "luschi": 1,
    "revisiting": 1,
    "sha": 1,
    "ahmad": 2,
    "shah": 1,
    "impact": 2,
    "ieee": 12,
    "multitopic": 1,
    "ding": 1,
    "qian": 1,
    "zhou": 3,
    "chinese": 3,
    "anddecision": 1,
    "sutskever": 1,
    "martens": 1,
    "dahl": 1,
    "importance": 1,
    "kumar": 1,
    "srivastava": 1,
    "krizhevsky": 1,
    "ay": 1,
    "selection": 1,
    "vs": 2,
    "rotational": 1,
    "invari": 1,
    "ance": 1,
    "mairal": 1,
    "koniusz": 1,
    "harchaoui": 1,
    "schmid": 1,
    "zaniolo": 1,
    "marques": 1,
    "multimed": 2,
    "dwarampudi": 1,
    "reddy": 1,
    "nvs": 1,
    "zhu": 2,
    "rethinking": 1,
    "scherer": 1,
    "mu": 1,
    "ller": 1,
    "behnke": 1,
    "volutional": 1,
    "object": 1,
    "ofarti": 1,
    "ma": 5,
    "xia": 2,
    "autonomous": 1,
    "dcnn": 1,
    "designer": 1,
    "neurocomputing": 7,
    "itano": 1,
    "abreu": 1,
    "sousa": 1,
    "del": 1,
    "moral": 1,
    "hernandez": 1,
    "extending": 1,
    "mlp": 1,
    "joint": 2,
    "kennedy": 1,
    "eberhart": 1,
    "particle": 1,
    "stanley": 1,
    "ko": 2,
    "miikkulainen": 1,
    "evolving": 1,
    "aug": 1,
    "menting": 1,
    "topologies": 1,
    "evol": 1,
    "coronavirus": 1,
    "metaheuristic": 1,
    "ranjit": 1,
    "mp": 2,
    "ganapathy": 1,
    "sridhar": 1,
    "infrastructure": 1,
    "intelligent": 1,
    "distr": 1,
    "ibute": 1,
    "dhype": 1,
    "rpara": 1,
    "meter": 1,
    "bergstra": 1,
    "yamins": 1,
    "cox": 1,
    "hyperparameter": 1,
    "dimensions": 1,
    "oninternational": 1,
    "camero": 1,
    "toutouh": 1,
    "alba": 1,
    "dlopt": 1,
    "autonomio": 2,
    "talos": 2,
    "balandat": 1,
    "karrer": 1,
    "jiang": 5,
    "dr": 1,
    "botorch": 1,
    "programmable": 1,
    "eggensperger": 1,
    "feurer": 1,
    "hutter": 1,
    "towards": 1,
    "foun": 1,
    "dation": 1,
    "assessing": 2,
    "hyperparameters": 1,
    "ye": 1,
    "wei": 2,
    "gy": 1,
    "brooks": 1,
    "benchmarking": 1,
    "yu": 6,
    "liu": 9,
    "pem": 1,
    "fuel": 1,
    "cells": 1,
    "improved": 5,
    "gorithm": 1,
    "zheng": 2,
    "yao": 1,
    "top": 1,
    "gas": 1,
    "recovery": 1,
    "turbine": 1,
    "ruiz": 1,
    "lgb": 1,
    "rueda": 1,
    "cue": 1,
    "llar": 1,
    "evolutive": 1,
    "expertsyst": 1,
    "lv": 1,
    "liang": 5,
    "fouling": 2,
    "resistance": 1,
    "ga": 2,
    "circulating": 1,
    "cooling": 1,
    "water": 5,
    "electromag": 1,
    "netic": 1,
    "anti": 1,
    "treatment": 1,
    "inst": 1,
    "jiao": 1,
    "du": 2,
    "indirect": 1,
    "rul": 1,
    "lithium": 2,
    "ion": 2,
    "battery": 2,
    "vibration": 1,
    "int": 5,
    "hydrogenergy": 1,
    "bru": 1,
    "ndlinger": 1,
    "residents": 1,
    "comfort": 1,
    "index": 2,
    "electr": 6,
    "technol": 3,
    "ception": 1,
    "technology": 1,
    "storage": 2,
    "systembased": 1,
    "informationtechnology": 1,
    "networking": 1,
    "electronic": 2,
    "automation": 1,
    "confer": 1,
    "ence": 1,
    "abdel": 1,
    "nasser": 1,
    "mahmoud": 1,
    "photovoltaic": 2,
    "khodabakhsh": 1,
    "ari": 1,
    "bakir": 1,
    "engi": 1,
    "neering": 1,
    "communications": 3,
    "gao": 3,
    "hong": 1,
    "ahead": 2,
    "plant": 1,
    "weather": 1,
    "muzaffar": 1,
    "afshari": 1,
    "proc": 9,
    "song": 1,
    "xue": 1,
    "petsci": 1,
    "jq": 1,
    "periodicity": 1,
    "gokhan": 1,
    "yilmaz": 1,
    "unel": 1,
    "engines": 1,
    "ifac": 1,
    "liao": 1,
    "tang": 5,
    "dai": 2,
    "iet": 1,
    "transmdistrib": 1,
    "shao": 2,
    "clearing": 1,
    "belm": 2,
    "frameworkand": 1,
    "analytic": 1,
    "econ": 1,
    "qiu": 2,
    "ren": 3,
    "suganthan": 1,
    "pn": 1,
    "mode": 2,
    "decomposition": 4,
    "applsoft": 1,
    "symposium": 1,
    "manohar": 1,
    "koley": 1,
    "ghosh": 1,
    "spatio": 2,
    "protection": 1,
    "scheme": 2,
    "pv": 1,
    "microgrid": 1,
    "irra": 1,
    "dian": 1,
    "cein": 1,
    "itte": 1,
    "ncy": 1,
    "electrpower": 1,
    "mishra": 1,
    "basu": 1,
    "maulik": 1,
    "danse": 1,
    "causal": 1,
    "lect": 8,
    "notes": 7,
    "qiao": 1,
    "wavelet": 3,
    "transform": 2,
    "ji": 1,
    "zou": 1,
    "futures": 1,
    "kim": 2,
    "sb": 1,
    "predicting": 4,
    "residential": 1,
    "shen": 6,
    "bus": 1,
    "alkandari": 1,
    "semble": 2,
    "kong": 1,
    "deng": 1,
    "condition": 1,
    "turbines": 1,
    "scada": 1,
    "convolutionalneural": 1,
    "renew": 1,
    "uav": 1,
    "afsa": 1,
    "displacement": 1,
    "ksce": 1,
    "civil": 1,
    "sarkar": 2,
    "lore": 1,
    "kg": 1,
    "early": 3,
    "ame": 1,
    "via": 3,
    "symbolic": 1,
    "annual": 1,
    "prog": 1,
    "nostics": 1,
    "management": 1,
    "society": 1,
    "transportation": 2,
    "predic": 1,
    "sensors": 3,
    "shi": 1,
    "relative": 1,
    "ienco": 2,
    "interdonato": 2,
    "gaetano": 2,
    "combining": 3,
    "sentinel": 2,
    "land": 1,
    "remotesens": 1,
    "arellano": 1,
    "terrazas": 1,
    "ratchev": 1,
    "tool": 2,
    "wear": 2,
    "imaging": 1,
    "adv": 2,
    "manuf": 1,
    "xie": 2,
    "automatic": 1,
    "constraint": 1,
    "med": 2,
    "han": 1,
    "st": 1,
    "spatial": 1,
    "crowd": 1,
    "counting": 1,
    "recogn": 3,
    "lett": 1,
    "feng": 1,
    "dynamic": 3,
    "facial": 1,
    "kampffmeyer": 1,
    "relational": 1,
    "adversarial": 1,
    "summarization": 1,
    "toolsappl": 1,
    "duplo": 1,
    "dual": 1,
    "view": 1,
    "point": 1,
    "isprs": 1,
    "gramm": 1,
    "remote": 1,
    "sens": 1,
    "yan": 2,
    "ouyang": 1,
    "wireless": 1,
    "pers": 2,
    "commun": 2,
    "sismanoglu": 1,
    "onde": 1,
    "kocer": 1,
    "stock": 10,
    "market": 2,
    "meeting": 1,
    "electrical": 1,
    "electronics": 2,
    "biomedical": 2,
    "engineering": 6,
    "jayanth": 1,
    "harish": 1,
    "rds": 1,
    "nair": 1,
    "bb": 1,
    "applicability": 1,
    "bankex": 1,
    "proccomput": 2,
    "stacking": 1,
    "leveraging": 2,
    "tree": 2,
    "physica": 2,
    "interpreting": 1,
    "ofcommunications": 1,
    "orimoloye": 1,
    "lo": 1,
    "sung": 1,
    "mc": 1,
    "comparing": 1,
    "feedforward": 1,
    "shallow": 1,
    "indices": 1,
    "makarenko": 1,
    "lyapunov": 1,
    "ponents": 1,
    "discrete": 1,
    "stability": 1,
    "ofnonlinear": 1,
    "dingli": 1,
    "fournier": 1,
    "ks": 1,
    "kelotra": 1,
    "pandey": 1,
    "convlstm": 1,
    "forex": 1,
    "bao": 1,
    "yue": 1,
    "rao": 1,
    "autoencoders": 1,
    "plos": 1,
    "munkhdalai": 1,
    "theera": 1,
    "umpon": 1,
    "var": 1,
    "chiang": 1,
    "lk": 1,
    "huang": 5,
    "yc": 1,
    "interaction": 1,
    "change": 1,
    "rates": 1,
    "currencies": 1,
    "cryptocurrencies": 1,
    "relation": 1,
    "agents": 1,
    "berradi": 1,
    "lazaar": 1,
    "integration": 1,
    "principal": 1,
    "casablancastock": 1,
    "enhancing": 3,
    "intraday": 1,
    "manip": 1,
    "ulation": 1,
    "cui": 1,
    "tian": 1,
    "hq": 1,
    "xf": 1,
    "secondary": 1,
    "applenergy": 1,
    "xiang": 1,
    "assisted": 1,
    "packet": 1,
    "aerodyn": 1,
    "mx": 1,
    "fei": 1,
    "ly": 1,
    "termmemory": 1,
    "conv": 3,
    "manage": 6,
    "pan": 1,
    "environ": 1,
    "pollut": 1,
    "enhanced": 1,
    "air": 4,
    "xiao": 1,
    "hou": 2,
    "wz": 1,
    "hourly": 1,
    "campus": 1,
    "eemd": 1,
    "sustainabledevelopment": 1,
    "hydraulic": 1,
    "earth": 1,
    "concentration": 1,
    "house": 1,
    "cold": 1,
    "region": 1,
    "decompo": 1,
    "sition": 1,
    "agric": 3,
    "heterogeneity": 1,
    "oferror": 1,
    "distributions": 1,
    "resour": 1,
    "yin": 1,
    "cts": 1,
    "correlatedtime": 1,
    "freeman": 1,
    "bs": 1,
    "taylor": 1,
    "gharabaghi": 1,
    "waste": 1,
    "assoc": 1,
    "melo": 1,
    "sugimoto": 1,
    "dn": 1,
    "tasinaffo": 1,
    "pm": 1,
    "river": 1,
    "latin": 1,
    "zeng": 1,
    "gq": 1,
    "nonlinear": 2,
    "andextremal": 1,
    "niu": 1,
    "dissolved": 1,
    "oxygen": 1,
    "shery": 1,
    "pond": 1,
    "press": 2,
    "peng": 4,
    "denoising": 1,
    "conversmanage": 1,
    "jin": 1,
    "maqsood": 2,
    "mehmood": 1,
    "global": 1,
    "event": 3,
    "deeplearning": 1,
    "shea": 1,
    "tj": 1,
    "roy": 1,
    "clancy": 1,
    "radio": 1,
    "signal": 4,
    "thorburn": 1,
    "pj": 3,
    "fitch": 1,
    "ofneural": 1,
    "andinformation": 1,
    "zhao": 3,
    "timescale": 1,
    "gravitational": 1,
    "microlensing": 1,
    "events": 1,
    "singular": 1,
    "spectrum": 1,
    "convolutionalgated": 1,
    "renewenergy": 1,
    "batteries": 1,
    "ul": 1,
    "trasonic": 1,
    "motor": 1,
    "particleswarm": 1,
    "measurement": 2,
    "rashid": 1,
    "km": 1,
    "louis": 1,
    "augmentation": 1,
    "construction": 1,
    "inform": 1,
    "zanni": 1,
    "merk": 1,
    "cre": 1,
    "milleux": 1,
    "semantics": 1,
    "manufacturing": 2,
    "mehdiyev": 1,
    "lahann": 1,
    "emrich": 1,
    "slewing": 1,
    "bearing": 1,
    "hmm": 1,
    "predictive": 3,
    "bohan": 1,
    "yun": 1,
    "emergency": 1,
    "communication": 1,
    "pasias": 1,
    "vafeiadis": 1,
    "ioannidis": 1,
    "inter": 1,
    "evolutions": 1,
    "rhe": 1,
    "ieeeinternational": 2,
    "robotics": 1,
    "canizo": 1,
    "triguero": 1,
    "conde": 1,
    "head": 1,
    "industrial": 1,
    "kuang": 1,
    "hua": 1,
    "sources": 1,
    "gps": 1,
    "trajectory": 1,
    "mobile": 1,
    "chang": 1,
    "driven": 1,
    "order": 1,
    "mecheng": 1,
    "varona": 1,
    "monteserin": 1,
    "teyseyre": 1,
    "tomatic": 1,
    "road": 1,
    "surface": 1,
    "pothole": 1,
    "ubiqui": 1,
    "tous": 1,
    "cai": 1,
    "pipattanasomporn": 1,
    "rahman": 1,
    "building": 1,
    "silva": 1,
    "db": 1,
    "schmidt": 1,
    "costa": 1,
    "ca": 1,
    "rosa": 1,
    "righi": 1,
    "esko": 1,
    "er": 1,
    "signs": 1,
    "tection": 2,
    "patient": 1,
    "deterioration": 1,
    "mechefske": 1,
    "estimation": 1,
    "bi": 1,
    "directional": 1,
    "autoencoder": 1,
    "mech": 2,
    "bui": 1,
    "pham": 1,
    "vo": 1,
    "tran": 1,
    "healthcare": 1,
    "prognostics": 1,
    "cardiovasculardiseases": 1,
    "thedevelopment": 1,
    "vietnam": 1,
    "contrac": 1,
    "children": 1,
    "shanghai": 1,
    "jiaotong": 1,
    "univ": 1,
    "hoppe": 1,
    "rzdo": 1,
    "rfer": 1,
    "reso": 1,
    "ngerprinting": 1,
    "quantitativeparameter": 1,
    "technologyand": 1,
    "informatics": 1,
    "netherlands": 1,
    "ios": 1,
    "chambon": 1,
    "galtier": 1,
    "mn": 1,
    "arnal": 1,
    "sleep": 2,
    "stage": 1,
    "modal": 1,
    "rehabil": 1,
    "lauritsen": 1,
    "sm": 1,
    "kal\u00f8r": 1,
    "me": 1,
    "kongsgaard": 1,
    "el": 1,
    "utilizing": 1,
    "staging": 1,
    "fut": 1,
    "gen": 1,
    "bp": 1,
    "fuzzy": 1,
    "sarafrazi": 1,
    "choudhari": 1,
    "rs": 1,
    "mehta": 1,
    "cracking": 1,
    "ehr": 1,
    "forearly": 1,
    "cardiol": 1,
    "ogy": 1,
    "zeroual": 1,
    "harrou": 1,
    "dairi": 1,
    "chaos": 1,
    "solit": 1,
    "fract": 1,
    "lag": 1,
    "pedestrian": 1,
    "straight": 1,
    "corridors": 1,
    "imamverdiyev": 1,
    "abdullayeva": 1,
    "denial": 1,
    "service": 1,
    "attack": 1,
    "restricted": 1,
    "boltzmann": 1,
    "munir": 1,
    "siddiqui": 1,
    "sa": 1,
    "dengel": 1,
    "deepant": 1,
    "proach": 2,
    "unsupervised": 1,
    "access": 1,
    "zebin": 1,
    "scully": 1,
    "ozanyan": 1,
    "kb": 1,
    "inertial": 1,
    "bendong": 1,
    "huanzhang": 1,
    "shangfeng": 1,
    "transformer": 1,
    "pre": 1,
    "mised": 1,
    "word": 1,
    "segmenta": 1,
    "cao": 1,
    "popularity": 1,
    "messages": 1,
    "medias": 1,
    "notescomput": 1,
    "kan": 1,
    "multimodality": 1,
    "chaotic": 1,
    "math": 1,
    "rodrigues": 1,
    "markou": 1,
    "pereira": 1,
    "fc": 1,
    "textual": 1,
    "taxi": 1,
    "kalinin": 1,
    "mo": 1,
    "lavrova": 1,
    "yarmak": 1,
    "threats": 1,
    "cyberphys": 1,
    "ical": 1,
    "multidimensional": 1,
    "autom": 1,
    "lei": 1,
    "renewable": 1,
    "atto": 1,
    "benoit": 1,
    "lambert": 1,
    "sezer": 1,
    "ob": 1,
    "gudelek": 1,
    "ozbayoglu": 1,
    "systematic": 1,
    "soft": 1,
    "transp": 1,
    "emerg": 1,
    "kamilaris": 1,
    "prenafeta": 1,
    "boldu": 1,
    "fx": 1,
    "agriculture": 1,
    "rui": 1,
    "ruqiang": 1,
    "zhenghua": 1,
    "mahdavifar": 1,
    "ghorbani": 1,
    "aa": 1,
    "cyberse": 1,
    "curity": 1,
    "cite": 1,
    "abbreviations": 1,
    "\u00bcbidirectional": 1,
    "\u00bcconvolutional": 1,
    "\u00bccentral": 1,
    "\u00bcdeep": 2,
    "\u00bcelman": 1,
    "\u00bcgraphic": 1,
    "\u00bcgated": 1,
    "ipu\u00bcintelligence": 1,
