{
    "training": 154,
    "tips": 12,
    "transformer": 13,
    "model": 57,
    "martin": 5,
    "popel": 5,
    "ondrej": 7,
    "bojar": 8,
    "charles": 2,
    "university": 3,
    "faculty": 2,
    "mathematics": 2,
    "physics": 2,
    "institute": 2,
    "formal": 2,
    "applied": 4,
    "linguistics": 2,
    "prague": 1,
    "czechia": 1,
    "abstract": 1,
    "this": 52,
    "article": 5,
    "describes": 1,
    "our": 38,
    "experiments": 39,
    "neural": 14,
    "machine": 18,
    "translation": 27,
    "using": 13,
    "recent": 2,
    "ten": 1,
    "sequencemodel": 1,
    "vaswanietal": 4,
    "examine": 1,
    "some": 12,
    "critical": 2,
    "parameters": 12,
    "that": 44,
    "ect": 18,
    "nal": 5,
    "quality": 9,
    "memory": 8,
    "usage": 2,
    "stability": 2,
    "time": 35,
    "concluding": 1,
    "each": 7,
    "experiment": 9,
    "with": 90,
    "set": 20,
    "recom": 1,
    "mendations": 1,
    "fellow": 1,
    "researchers": 4,
    "addition": 2,
    "con": 6,
    "rming": 1,
    "general": 6,
    "mantra": 1,
    "more": 24,
    "data": 41,
    "larger": 5,
    "models": 13,
    "address": 2,
    "scaling": 17,
    "multiple": 7,
    "gpus": 47,
    "provide": 4,
    "practical": 4,
    "im": 1,
    "proved": 1,
    "regarding": 1,
    "batch": 94,
    "size": 97,
    "learning": 66,
    "rate": 58,
    "warmup": 25,
    "steps": 41,
    "maximum": 10,
    "sentence": 12,
    "length": 11,
    "andc": 2,
    "heck": 1,
    "poin": 2,
    "tave": 1,
    "ragi": 1,
    "ng": 7,
    "given": 15,
    "their": 5,
    "particular": 3,
    "hardware": 4,
    "constraints": 1,
    "introduction": 2,
    "it": 36,
    "been": 3,
    "already": 2,
    "clearly": 5,
    "established": 1,
    "nmt": 8,
    "new": 3,
    "state": 2,
    "art": 2,
    "see": 21,
    "most": 7,
    "evaluation": 10,
    "campaigns": 1,
    "bojaretal": 1,
    "cettoloetal": 1,
    "underlying": 1,
    "network": 4,
    "architecture": 1,
    "nevertheless": 2,
    "still": 7,
    "frequent": 1,
    "very": 5,
    "di": 23,
    "cult": 3,
    "predict": 1,
    "which": 24,
    "architectures": 1,
    "best": 9,
    "combination": 1,
    "properties": 1,
    "towi": 1,
    "nint": 1,
    "helo": 1,
    "ngte": 1,
    "rm": 3,
    "speed": 22,
    "inte": 2,
    "rpre": 1,
    "tabi": 1,
    "lity": 1,
    "but": 29,
    "also": 24,
    "availability": 1,
    "good": 3,
    "impl": 1,
    "emen": 1,
    "tati": 1,
    "ons": 1,
    "acons": 1,
    "idera": 1,
    "blepa": 1,
    "rtofa": 1,
    "consists": 1,
    "sensitivity": 2,
    "noise": 5,
    "wide": 1,
    "range": 5,
    "hyper": 11,
    "having": 1,
    "right": 3,
    "setting": 10,
    "them": 4,
    "turns": 1,
    "out": 7,
    "often": 1,
    "component": 1,
    "success": 1,
    "cs": 4,
    "cl": 1,
    "may": 6,
    "inth": 1,
    "isar": 1,
    "ticl": 1,
    "call": 1,
    "edtr": 2,
    "ansf": 1,
    "orme": 1,
    "one": 49,
    "superior": 33,
    "toolkit": 1,
    "camp": 1,
    "aign": 1,
    "atwm": 1,
    "two": 48,
    "explored": 1,
    "want": 3,
    "empirically": 4,
    "explore": 1,
    "important": 4,
    "hopefully": 2,
    "observations": 4,
    "will": 6,
    "useful": 2,
    "other": 8,
    "considering": 2,
    "framework": 1,
    "ectofhyper": 1,
    "sizea": 1,
    "reava": 1,
    "ilabl": 1,
    "einth": 1,
    "edeep": 1,
    "lear": 3,
    "ning": 6,
    "comm": 2,
    "unit": 2,
    "bottouetal": 1,
    "smithand": 1,
    "le": 9,
    "jastrzebski": 3,
    "et": 16,
    "al": 16,
    "these": 8,
    "either": 2,
    "mostly": 2,
    "theoretic": 1,
    "or": 33,
    "experimentally": 1,
    "supported": 2,
    "from": 24,
    "domains": 1,
    "like": 1,
    "image": 1,
    "recognition": 1,
    "rather": 4,
    "than": 32,
    "ll": 2,
    "gap": 5,
    "by": 39,
    "focusing": 1,
    "exclusively": 1,
    "mt": 1,
    "only": 14,
    "providing": 1,
    "practices": 1,
    "wisdom": 1,
    "areg": 1,
    "ener": 1,
    "ally": 2,
    "bett": 1,
    "er": 7,
    "czec": 1,
    "htra": 2,
    "nsla": 2,
    "tion": 3,
    "expe": 1,
    "iments": 1,
    "somewhat": 4,
    "surprising": 2,
    "three": 27,
    "times": 18,
    "faster": 9,
    "single": 28,
    "gpu": 41,
    "ndings": 1,
    "about": 10,
    "interaction": 1,
    "between": 6,
    "olog": 1,
    "yand": 1,
    "main": 7,
    "crit": 1,
    "eria": 1,
    "sect": 1,
    "desc": 1,
    "ribe": 1,
    "dataset": 12,
    "its": 7,
    "preparations": 1,
    "section": 22,
    "contribution": 1,
    "commented": 1,
    "recommendations": 1,
    "finally": 1,
    "sec": 2,
    "conclude": 2,
    "methodology": 1,
    "evaluated": 4,
    "many": 5,
    "ways": 2,
    "forms": 1,
    "human": 2,
    "judgment": 1,
    "should": 7,
    "always": 6,
    "used": 7,
    "ultimate": 1,
    "resolution": 1,
    "any": 12,
    "application": 1,
    "against": 4,
    "reference": 4,
    "translations": 2,
    "widespread": 1,
    "automatic": 8,
    "papinenietal": 1,
    "desp": 1,
    "itei": 1,
    "tsac": 1,
    "know": 3,
    "ledg": 1,
    "ed": 5,
    "problems": 1,
    "better": 18,
    "performing": 1,
    "alternatives": 1,
    "simplicity": 1,
    "stick": 1,
    "bleu": 51,
    "too": 9,
    "results": 26,
    "sc": 2,
    "scf": 1,
    "popovic": 2,
    "foun": 2,
    "dnos": 1,
    "ubst": 1,
    "anti": 1,
    "aldi": 1,
    "erencesfrombleu": 1,
    "inparticular": 1,
    "weusethecase": 1,
    "insensitive": 2,
    "sacr\u00e9bleu": 2,
    "superiorwhich": 1,
    "uses": 7,
    "xed": 4,
    "tokenization": 5,
    "identical": 1,
    "mteval": 1,
    "pl": 1,
    "interna": 1,
    "superiorhttps": 3,
    "github": 6,
    "com": 8,
    "tensorflow": 7,
    "superiorhttp": 1,
    "www": 4,
    "statmt": 2,
    "org": 18,
    "awslabs": 1,
    "sockeye": 1,
    "tree": 1,
    "master": 2,
    "contrib": 1,
    "sacrebleu": 1,
    "signature": 1,
    "scores": 4,
    "reported": 4,
    "paper": 4,
    "case": 11,
    "lc": 1,
    "lang": 3,
    "en": 3,
    "numrefs": 1,
    "smooth": 1,
    "exp": 1,
    "test": 10,
    "tok": 1,
    "intl": 2,
    "version": 5,
    "automatically": 1,
    "downloads": 1,
    "wmt": 3,
    "testset": 1,
    "considerations": 1,
    "stopping": 5,
    "criterion": 2,
    "situation": 1,
    "further": 4,
    "complicated": 1,
    "fact": 3,
    "syst": 1,
    "emsi": 1,
    "susu": 1,
    "non": 3,
    "deterministic": 1,
    "esp": 1,
    "ostr": 1,
    "ecen": 1,
    "tmod": 1,
    "els": 1,
    "hardly": 1,
    "everc": 1,
    "onver": 1,
    "gesor": 1,
    "start": 1,
    "sover": 1,
    "tting": 3,
    "easo": 1,
    "nabl": 1,
    "ybig": 1,
    "sets": 2,
    "lead": 2,
    "stol": 1,
    "earn": 2,
    "ing": 2,
    "curv": 2,
    "esth": 1,
    "atne": 1,
    "verf": 1,
    "ully": 1,
    "thecommon": 1,
    "practice": 3,
    "evaluate": 3,
    "when": 32,
    "started": 1,
    "over": 9,
    "bit": 5,
    "sooner": 1,
    "thus": 12,
    "not": 40,
    "applicable": 2,
    "papers": 4,
    "specify": 1,
    "criteria": 1,
    "whatsoever": 1,
    "sometimes": 2,
    "was": 11,
    "trained": 13,
    "bahdanau": 2,
    "exact": 2,
    "number": 37,
    "indication": 1,
    "how": 7,
    "much": 4,
    "converged": 4,
    "point": 5,
    "mostprobably": 1,
    "andthemodelwas": 1,
    "such": 4,
    "an": 9,
    "approximate": 2,
    "risky": 1,
    "conc": 1,
    "eiva": 1,
    "blet": 1,
    "hatd": 1,
    "comparison": 3,
    "fair": 1,
    "reliable": 2,
    "method": 3,
    "keep": 5,
    "speci": 6,
    "iterations": 2,
    "certain": 3,
    "epochs": 11,
    "however": 15,
    "perfect": 1,
    "solution": 4,
    "if": 10,
    "quite": 4,
    "erence": 8,
    "performance": 3,
    "su": 1,
    "ciently": 1,
    "large": 12,
    "possible": 6,
    "complex": 1,
    "would": 7,
    "need": 12,
    "few": 6,
    "eventually": 1,
    "arrived": 1,
    "higher": 17,
    "score": 14,
    "competitor": 1,
    "duration": 1,
    "step": 4,
    "epoch": 3,
    "ers": 1,
    "wear": 1,
    "emos": 1,
    "tlyi": 1,
    "nter": 1,
    "este": 1,
    "wall": 2,
    "clock": 2,
    "tried": 2,
    "standard": 1,
    "technique": 1,
    "early": 3,
    "nsubsequent": 1,
    "delta": 2,
    "nalbleu": 1,
    "even": 14,
    "fore": 2,
    "xper": 2,
    "imen": 2,
    "ts": 3,
    "same": 20,
    "just": 4,
    "erent": 6,
    "random": 3,
    "seed": 1,
    "moreover": 1,
    "get": 2,
    "use": 21,
    "nand": 1,
    "small": 7,
    "xtherandomseed": 1,
    "acha": 1,
    "ngeo": 1,
    "fsom": 1,
    "ehyp": 1,
    "because": 11,
    "change": 2,
    "itself": 2,
    "uenced": 2,
    "initialization": 1,
    "mean": 2,
    "here": 4,
    "begins": 1,
    "worsen": 1,
    "while": 14,
    "loss": 3,
    "keeps": 1,
    "improving": 3,
    "final": 1,
    "choice": 1,
    "full": 1,
    "curves": 10,
    "based": 3,
    "onthe": 1,
    "discu": 1,
    "ssion": 1,
    "above": 1,
    "does": 7,
    "fully": 6,
    "prevent": 4,
    "risk": 1,
    "premature": 1,
    "judgments": 1,
    "sudden": 2,
    "twist": 1,
    "cases": 3,
    "plot": 2,
    "hours": 24,
    "obviously": 2,
    "depends": 2,
    "chosen": 1,
    "so": 19,
    "thes": 3,
    "amee": 1,
    "quip": 1,
    "ment": 1,
    "driver": 2,
    "variation": 3,
    "measurements": 1,
    "unfortunately": 1,
    "unavoidable": 1,
    "could": 3,
    "isolate": 1,
    "computation": 13,
    "processes": 1,
    "tra": 1,
    "replicated": 1,
    "negligible": 1,
    "terminology": 1,
    "clarity": 1,
    "de": 9,
    "ne": 3,
    "following": 2,
    "terms": 2,
    "adhere": 1,
    "rest": 2,
    "estimate": 2,
    "well": 6,
    "carried": 1,
    "expresses": 1,
    "meaning": 2,
    "source": 4,
    "solely": 1,
    "denote": 1,
    "opti": 2,
    "mizer": 1,
    "update": 2,
    "run": 3,
    "equals": 3,
    "mini": 1,
    "batches": 4,
    "were": 9,
    "processed": 2,
    "sequence": 4,
    "usually": 5,
    "ofsentencepairs": 1,
    "theparameter": 3,
    "batch_size": 22,
    "ttra": 1,
    "spec": 1,
    "es": 1,
    "tokens": 2,
    "subwords": 15,
    "allows": 5,
    "short": 1,
    "sentences": 12,
    "smaller": 16,
    "long": 5,
    "ective": 11,
    "examples": 11,
    "consumed": 2,
    "isinterpreted": 1,
    "pergpu": 1,
    "thatis": 1,
    "yste": 2,
    "mact": 1,
    "uall": 1,
    "ydig": 1,
    "ests": 1,
    "language": 3,
    "corresponds": 1,
    "complete": 2,
    "pass": 1,
    "unfortu": 1,
    "nately": 1,
    "easy": 1,
    "measure": 2,
    "purpose": 1,
    "ned": 3,
    "target": 3,
    "padding": 3,
    "symbols": 1,
    "needed": 10,
    "approximates": 1,
    "actual": 8,
    "issues": 4,
    "order": 3,
    "convert": 1,
    "multiply": 2,
    "divide": 3,
    "thesegmentation": 1,
    "must": 2,
    "computed": 1,
    "special": 1,
    "script": 2,
    "putation": 2,
    "cpu": 1,
    "communication": 1,
    "software": 1,
    "cuda": 2,
    "library": 1,
    "imple": 1,
    "mentation": 1,
    "ecting": 1,
    "throughput": 18,
    "amount": 1,
    "digested": 1,
    "report": 3,
    "per": 4,
    "hour": 12,
    "multiplied": 2,
    "convergence": 8,
    "orbl": 1,
    "euco": 1,
    "nver": 1,
    "genc": 1,
    "changes": 1,
    "heavily": 1,
    "during": 4,
    "starting": 2,
    "high": 12,
    "decreasing": 4,
    "progresses": 1,
    "conver": 1,
    "gence": 1,
    "zero": 2,
    "till": 9,
    "achieve": 4,
    "level": 5,
    "informal": 1,
    "clear": 1,
    "moment": 2,
    "achieving": 1,
    "after": 26,
    "never": 4,
    "falls": 1,
    "below": 4,
    "tools": 3,
    "within": 5,
    "being": 2,
    "implemented": 3,
    "provides": 2,
    "nice": 1,
    "tensorboard": 2,
    "visualizations": 1,
    "progress": 2,
    "original": 3,
    "implementation": 3,
    "optimized": 1,
    "towards": 3,
    "standards": 1,
    "eld": 1,
    "reports": 1,
    "approx": 2,
    "bydefault": 1,
    "exposed": 1,
    "user": 1,
    "actually": 5,
    "instead": 9,
    "words": 9,
    "according": 3,
    "result": 2,
    "real": 2,
    "due": 3,
    "dependence": 1,
    "subword": 5,
    "vocabulary": 3,
    "easily": 2,
    "reproducible": 1,
    "varying": 4,
    "suitable": 2,
    "reporting": 2,
    "publications": 1,
    "nition": 1,
    "leads": 3,
    "variance": 4,
    "values": 6,
    "relatively": 2,
    "subsequent": 2,
    "checkpoints": 10,
    "visible": 3,
    "ickering": 2,
    "gures": 3,
    "decrease": 3,
    "bigger": 13,
    "development": 4,
    "czeng": 22,
    "europarl": 2,
    "news": 3,
    "commentary": 2,
    "commoncrawl": 1,
    "total": 3,
    "table": 13,
    "resources": 5,
    "whic": 5,
    "hcom": 1,
    "pute": 1,
    "sthe": 2,
    "giving": 2,
    "translated": 2,
    "my": 1,
    "directory": 2,
    "created": 2,
    "translate": 3,
    "store": 2,
    "events": 1,
    "way": 4,
    "weal": 1,
    "soim": 1,
    "plem": 1,
    "ente": 1,
    "avg": 1,
    "scripts": 3,
    "whichtranslate": 1,
    "average": 3,
    "window": 1,
    "check": 2,
    "points": 1,
    "respectively": 2,
    "details": 2,
    "averaging": 15,
    "selection": 1,
    "preprocessing": 5,
    "focused": 1,
    "english": 6,
    "czech": 10,
    "direction": 1,
    "comes": 3,
    "parallel": 4,
    "treebank": 1,
    "pairs": 6,
    "sources": 1,
    "common": 3,
    "crawl": 1,
    "detailed": 1,
    "sections": 1,
    "substitute": 1,
    "older": 2,
    "considerably": 1,
    "containing": 2,
    "throughout": 1,
    "overlapping": 1,
    "apply": 1,
    "judged": 1,
    "systems": 4,
    "now": 1,
    "mergedin": 1,
    "trainingis": 1,
    "they": 3,
    "wait": 1,
    "minutes": 2,
    "appear": 1,
    "http": 17,
    "ufal": 2,
    "mff": 2,
    "cuni": 2,
    "cz": 2,
    "subset": 2,
    "truecasing": 1,
    "ahugeleapin": 1,
    "realistic": 1,
    "achieved": 1,
    "units": 3,
    "sennrichetal": 1,
    "butthelong": 1,
    "term": 1,
    "visi": 1,
    "onof": 1,
    "thed": 1,
    "eep": 1,
    "leave": 3,
    "technicalities": 1,
    "feed": 1,
    "input": 1,
    "lee": 1,
    "adopts": 1,
    "vision": 1,
    "supports": 1,
    "external": 1,
    "own": 1,
    "built": 1,
    "similar": 2,
    "word": 2,
    "piece": 1,
    "algorithm": 1,
    "wu": 2,
    "base": 33,
    "dona": 1,
    "smal": 1,
    "lsam": 1,
    "pleo": 1,
    "thetrainingdata": 1,
    "later": 2,
    "follow": 1,
    "default": 17,
    "raw": 1,
    "plain": 1,
    "text": 2,
    "shared": 2,
    "superiorafter": 1,
    "millions": 1,
    "taking": 2,
    "lengths": 1,
    "pair": 1,
    "computing": 1,
    "million": 3,
    "both": 5,
    "space": 1,
    "delimited": 1,
    "considered": 1,
    "rst": 10,
    "technical": 1,
    "cien": 1,
    "tlyl": 1,
    "arge": 1,
    "samp": 1,
    "asdi": 1,
    "scus": 1,
    "sedi": 1,
    "nsec": 1,
    "ahigh": 1,
    "erbat": 1,
    "chsiz": 1,
    "emayb": 1,
    "ebene": 1,
    "cial": 3,
    "fort": 2,
    "hetr": 3,
    "aini": 5,
    "excluding": 2,
    "longer": 9,
    "threshold": 3,
    "controlled": 2,
    "parameter": 17,
    "max_length": 31,
    "datagen": 1,
    "les": 1,
    "processing": 4,
    "vs": 2,
    "thein": 1,
    "terna": 1,
    "limpl": 1,
    "ement": 1,
    "ation": 1,
    "morp": 1,
    "holo": 1,
    "gica": 1,
    "land": 1,
    "uage": 2,
    "attached": 1,
    "deliverable": 1,
    "project": 2,
    "eu": 3,
    "superiorthis": 1,
    "file": 1,
    "_byt": 1,
    "e_bu": 1,
    "dget": 1,
    "constant": 6,
    "changed": 1,
    "directly": 1,
    "code": 1,
    "min_count": 1,
    "asreported": 1,
    "logs": 1,
    "low": 2,
    "estimated": 1,
    "seen": 3,
    "twice": 1,
    "superiorwe": 1,
    "did": 3,
    "pre": 3,
    "ltering": 1,
    "present": 1,
    "several": 5,
    "summarizing": 2,
    "obser": 1,
    "vations": 1,
    "generally": 1,
    "learned": 1,
    "done": 4,
    "unless": 1,
    "stated": 1,
    "otherwise": 2,
    "trans": 6,
    "form": 2,
    "er_b": 2,
    "ig_s": 1,
    "ingl": 2,
    "e_gp": 1,
    "big": 42,
    "mainly": 1,
    "note": 3,
    "ase_": 1,
    "sing": 4,
    "le_g": 2,
    "pu": 2,
    "names": 1,
    "baselinesetting": 1,
    "thebig": 1,
    "withits": 1,
    "para": 1,
    "mete": 1,
    "rsex": 1,
    "cept": 1,
    "discussion": 1,
    "sizes": 5,
    "train_steps": 1,
    "highenough": 1,
    "ually": 1,
    "save": 2,
    "_che": 1,
    "ckpo": 1,
    "ints": 1,
    "_sec": 1,
    "forces": 1,
    "checkpoint": 13,
    "saving": 2,
    "schedule": 6,
    "train": 12,
    "disables": 1,
    "internal": 1,
    "approx_bleu": 1,
    "makes": 3,
    "primarily": 1,
    "interested": 1,
    "timetillscore": 1,
    "inthissection": 1,
    "focu": 1,
    "show": 6,
    "ever": 1,
    "onth": 1,
    "comp": 2,
    "utat": 1,
    "ions": 1,
    "peed": 1,
    "andt": 1,
    "rain": 3,
    "ingt": 3,
    "hrou": 1,
    "ghpu": 1,
    "botharea": 1,
    "ected": 1,
    "factors": 2,
    "almost": 7,
    "shows": 7,
    "various": 5,
    "cells": 1,
    "where": 6,
    "resulted": 3,
    "errors": 4,
    "marked": 2,
    "oom": 8,
    "supe": 3,
    "rior": 3,
    "ordi": 1,
    "former_big": 1,
    "although": 2,
    "naming": 1,
    "suggests": 3,
    "authors": 1,
    "opposite": 1,
    "experience": 1,
    "trai": 4,
    "n_an": 1,
    "d_ev": 1,
    "alua": 1,
    "te": 1,
    "itneedsmoremem": 1,
    "ory": 1,
    "conti": 1,
    "nuous": 1,
    "_trai": 1,
    "n_and": 1,
    "_eval": 1,
    "https": 6,
    "sorb": 1,
    "oard": 1,
    "global_step": 2,
    "statistics": 1,
    "curve": 10,
    "exce": 2,
    "ptfo": 1,
    "rmom": 1,
    "ents": 2,
    "saved": 1,
    "slower": 2,
    "able": 5,
    "additional": 1,
    "checked": 2,
    "decreases": 1,
    "increasing": 9,
    "operations": 1,
    "parallelizable": 1,
    "grows": 4,
    "sub": 1,
    "linearly": 2,
    "there": 7,
    "advantage": 3,
    "value": 3,
    "return": 1,
    "question": 2,
    "into": 1,
    "account": 1,
    "approximately": 1,
    "relative": 3,
    "numbers": 2,
    "overhead": 4,
    "synchronization": 1,
    "apparent": 1,
    "process": 1,
    "without": 9,
    "hypothetically": 1,
    "expect": 2,
    "days": 17,
    "figure": 20,
    "alternative": 1,
    "increases": 2,
    "hise": 1,
    "wesu": 1,
    "bsti": 1,
    "tute": 1,
    "dcze": 1,
    "ngda": 1,
    "ta": 1,
    "baseline": 5,
    "versus": 2,
    "converges": 1,
    "improve": 2,
    "next": 2,
    "week": 2,
    "gives": 2,
    "slightly": 6,
    "worse": 3,
    "eight": 5,
    "shown": 5,
    "graph": 1,
    "reaching": 2,
    "rsof": 1,
    "ared": 1,
    "kste": 1,
    "ps": 1,
    "means": 3,
    "compared": 2,
    "datasets": 2,
    "another": 7,
    "gave": 1,
    "hypothesize": 1,
    "cleaner": 2,
    "enough": 5,
    "reach": 5,
    "comparing": 1,
    "noisier": 1,
    "misleading": 1,
    "half": 1,
    "gigaword": 1,
    "improves": 1,
    "cannot": 2,
    "interpolate": 1,
    "continues": 2,
    "choosing": 1,
    "reasons": 1,
    "maynot": 1,
    "transfor": 1,
    "mer_": 1,
    "big_": 1,
    "four": 2,
    "summarized": 1,
    "hidden_size": 1,
    "lter_size": 1,
    "num_heads": 1,
    "erences": 2,
    "andwe": 1,
    "rmed": 2,
    "takes": 2,
    "lessmemory": 1,
    "sowecana": 1,
    "orda": 1,
    "erba": 1,
    "tchs": 1,
    "ize": 1,
    "withno": 1,
    "restriction": 3,
    "seet": 1,
    "hene": 1,
    "xtse": 1,
    "ctio": 1,
    "himp": 1,
    "rove": 1,
    "buteven": 1,
    "wecan": 1,
    "ndit": 1,
    "inli": 1,
    "tera": 1,
    "ture": 1,
    "forexample": 2,
    "bottou": 5,
    "don": 2,
    "less": 6,
    "day": 3,
    "becomes": 2,
    "rmst": 1,
    "hisw": 1,
    "prefer": 1,
    "you": 7,
    "plan": 1,
    "gb": 1,
    "available": 2,
    "benchmark": 1,
    "adam": 8,
    "adafactor": 5,
    "none": 2,
    "maxi": 1,
    "mumb": 1,
    "atch": 1,
    "ofmax_length": 1,
    "optimizer": 1,
    "last": 4,
    "columns": 2,
    "percentage": 2,
    "forf": 1,
    "astd": 1,
    "ebug": 1,
    "ging": 1,
    "ofmodel": 1,
    "unre": 1,
    "late": 1,
    "dasp": 1,
    "ects": 1,
    "useamodelcalled": 1,
    "former_tiny": 1,
    "longersentences": 1,
    "completely": 2,
    "loweringthe": 1,
    "since": 1,
    "suddenly": 1,
    "your": 1,
    "presents": 1,
    "what": 3,
    "measured": 2,
    "mize": 1,
    "rs": 1,
    "biasing": 1,
    "shorter": 1,
    "hurt": 1,
    "lation": 3,
    "resp": 3,
    "detrimental": 1,
    "bias": 1,
    "minimal": 2,
    "strange": 1,
    "drop": 2,
    "lower": 4,
    "shazeerandstern": 1,
    "isav": 1,
    "aila": 1,
    "bleo": 1,
    "nlyi": 1,
    "ewer": 1,
    "andh": 1,
    "asth": 1,
    "ree": 1,
    "second": 4,
    "moments": 1,
    "weights": 1,
    "future": 3,
    "work": 3,
    "max": 6,
    "restricting": 1,
    "thet": 1,
    "osso": 1,
    "hash": 1,
    "ighv": 1,
    "aria": 1,
    "ncea": 1,
    "nd": 3,
    "stops": 1,
    "increase": 5,
    "diverged": 6,
    "discussed": 1,
    "explanation": 2,
    "phenomenon": 1,
    "slow": 1,
    "ergr": 1,
    "owin": 1,
    "gble": 1,
    "ucur": 2,
    "ves": 1,
    "observed": 1,
    "decoding": 1,
    "alpha": 1,
    "reasonably": 1,
    "prevents": 1,
    "ifthebatchsize": 1,
    "seta": 1,
    "reas": 2,
    "onab": 1,
    "lyhi": 1,
    "gh": 1,
    "expecteddrops": 1,
    "orstagnations": 1,
    "ofth": 1,
    "eble": 1,
    "vein": 1,
    "rsth": 1,
    "ours": 1,
    "oftr": 1,
    "thedefault": 1,
    "except": 2,
    "recommend": 1,
    "explicitly": 1,
    "superioror": 1,
    "least": 3,
    "make": 2,
    "experimental": 1,
    "vedi": 1,
    "erentbatchsizes": 1,
    "sizeup": 1,
    "toge": 1,
    "tove": 1,
    "rble": 1,
    "andwith": 1,
    "sowhen": 1,
    "re": 4,
    "plotting": 2,
    "axis": 3,
    "ptio": 1,
    "nist": 1,
    "hedi": 1,
    "hisv": 1,
    "erys": 1,
    "mall": 1,
    "superiore": 1,
    "hparams": 1,
    "learning_rate": 8,
    "power": 1,
    "got": 1,
    "running": 2,
    "restrictions": 1,
    "failed": 1,
    "erth": 1,
    "roug": 1,
    "hput": 1,
    "sofor": 1,
    "dimin": 1,
    "ishing": 1,
    "returns": 1,
    "observation": 2,
    "goes": 1,
    "knowledge": 1,
    "frameworks": 1,
    "deep": 3,
    "keskar": 2,
    "proceedslower": 1,
    "exam": 1,
    "ples": 1,
    "perh": 1,
    "end": 1,
    "expected": 2,
    "interestingly": 1,
    "replicating": 1,
    "erentresults": 1,
    "assh": 1,
    "owni": 1,
    "nfig": 1,
    "tost": 1,
    "artc": 1,
    "onve": 1,
    "rgin": 1,
    "gata": 1,
    "erenceinthe": 1,
    "bleucurves": 1,
    "butstill": 1,
    "sharp": 3,
    "trains": 1,
    "drops": 1,
    "recovering": 1,
    "slowly": 2,
    "smith": 6,
    "gradient": 8,
    "scale": 6,
    "scaleofrandom": 1,
    "uctu": 1,
    "atio": 1,
    "nsin": 1,
    "gd": 2,
    "oradametc": 1,
    "dynamics": 1,
    "isproportional": 1,
    "divided": 1,
    "cf": 4,
    "lowering": 1,
    "batchsize": 1,
    "diverge": 1,
    "thismaybeeither": 1,
    "permanent": 1,
    "temporary": 2,
    "grow": 1,
    "sure": 3,
    "causes": 1,
    "regards": 1,
    "hypothesis": 2,
    "initialize": 1,
    "sensitive": 1,
    "divergence": 8,
    "phase": 2,
    "highly": 1,
    "helpful": 1,
    "until": 1,
    "limit": 2,
    "preventing": 1,
    "tip": 1,
    "keeping": 3,
    "reserve": 1,
    "hitting": 1,
    "advisable": 1,
    "establish": 1,
    "largest": 1,
    "before": 1,
    "tool": 1,
    "ow": 1,
    "sett": 2,
    "hele": 1,
    "arni": 3,
    "gure": 1,
    "dive": 2,
    "rged": 2,
    "buta": 1,
    "tone": 1,
    "mome": 1,
    "ntdr": 1,
    "ops": 1,
    "down": 2,
    "stays": 2,
    "forever": 1,
    "introduce": 2,
    "clipping": 2,
    "linea": 2,
    "r_war": 2,
    "mup_r": 2,
    "sqrt_": 2,
    "decay": 7,
    "called": 2,
    "noamin": 1,
    "versions": 2,
    "root": 3,
    "highest": 2,
    "happen": 1,
    "happens": 1,
    "increased": 1,
    "looked": 1,
    "similarly": 3,
    "baselineone": 1,
    "tryi": 1,
    "ngle": 1,
    "ngra": 2,
    "afte": 1,
    "rone": 1,
    "soft": 1,
    "ingh": 1,
    "avin": 1,
    "figu": 1,
    "hows": 1,
    "thee": 2,
    "ectofdi": 1,
    "eren": 2,
    "twar": 1,
    "mups": 1,
    "teps": 1,
    "xedlearningrate": 1,
    "ingw": 1,
    "armu": 1,
    "pste": 1,
    "psto": 1,
    "olow": 1,
    "resul": 1,
    "tsind": 1,
    "iverg": 1,
    "edtra": 1,
    "ining": 1,
    "green": 1,
    "matching": 1,
    "try": 3,
    "ifth": 1,
    "atdo": 1,
    "esno": 1,
    "thel": 2,
    "lin": 1,
    "ear_": 1,
    "warm": 1,
    "up_r": 1,
    "sqrt": 1,
    "_dec": 1,
    "ay": 1,
    "aka": 2,
    "noam": 3,
    "simply": 2,
    "worker_gpus": 1,
    "explained": 1,
    "interpreted": 1,
    "asingle": 1,
    "cons": 1,
    "ider": 1,
    "ime": 2,
    "thefour": 1,
    "asexplained": 1,
    "asco": 1,
    "uldb": 1,
    "eexp": 1,
    "ecte": 1,
    "inmi": 1,
    "llio": 1,
    "nsof": 1,
    "subw": 1,
    "ords": 1,
    "neededto": 1,
    "surpass": 1,
    "again": 2,
    "fall": 1,
    "ande": 1,
    "xamp": 1,
    "lest": 1,
    "ills": 1,
    "core": 1,
    "surpassing": 1,
    "outside": 1,
    "holds": 3,
    "unexpected": 1,
    "unintuitive": 1,
    "users": 1,
    "making": 1,
    "environment": 1,
    "variable": 1,
    "_vis": 1,
    "ible": 1,
    "_dev": 1,
    "ices": 1,
    "cards": 1,
    "distributed": 3,
    "machines": 1,
    "experimented": 1,
    "multi": 3,
    "synchronous": 1,
    "updates": 2,
    "black": 1,
    "line": 2,
    "measuring": 1,
    "lowe": 1,
    "rexa": 1,
    "mple": 1,
    "stil": 1,
    "lsco": 1,
    "eigh": 1,
    "tgpu": 1,
    "sare": 1,
    "veti": 1,
    "mesf": 1,
    "aste": 1,
    "rtha": 1,
    "ntwo": 1,
    "gpusand": 1,
    "recall": 1,
    "hasa": 1,
    "lmos": 1,
    "tnoe": 1,
    "ecto": 1,
    "nthe": 1,
    "incr": 1,
    "easi": 1,
    "ngth": 2,
    "ee": 1,
    "improvement": 1,
    "especially": 1,
    "tuned": 1,
    "fastest": 1,
    "experi": 1,
    "ments": 1,
    "example": 3,
    "interesting": 1,
    "simulating": 1,
    "doing": 1,
    "upda": 1,
    "teon": 1,
    "ceaf": 1,
    "tern": 1,
    "batc": 4,
    "hes": 1,
    "ands": 1,
    "ummi": 1,
    "egra": 1,
    "dien": 1,
    "issi": 1,
    "mila": 1,
    "rtot": 1,
    "he": 2,
    "ghostbatches": 1,
    "ofho": 1,
    "eretal": 4,
    "ghost": 2,
    "related": 1,
    "sync": 1,
    "hron": 1,
    "ouss": 1,
    "oritsvariants": 1,
    "byin": 1,
    "crea": 1,
    "ectivebatchsize": 2,
    "wewill": 1,
    "focus": 1,
    "adapt": 1,
    "device": 1,
    "kgpus": 1,
    "krizhevsky": 2,
    "says": 1,
    "theory": 2,
    "multiplying": 2,
    "byv": 2,
    "kto": 1,
    "expectation": 1,
    "explaining": 1,
    "wasa": 1,
    "arsc": 1,
    "alin": 1,
    "gheu": 1,
    "rist": 1,
    "ics": 1,
    "nor": 1,
    "betweenv": 1,
    "kscaling": 3,
    "linear": 3,
    "heuristics": 1,
    "become": 1,
    "popular": 2,
    "leading": 1,
    "goyaletal": 2,
    "smithetal": 1,
    "etal": 2,
    "smithandle": 2,
    "jastrzebskietal": 1,
    "interpret": 1,
    "sgd": 5,
    "anditsvariants": 1,
    "asastochasticdi": 1,
    "equalx": 1,
    "nis": 1,
    "bis": 1,
    "drives": 1,
    "away": 1,
    "minima": 4,
    "therefore": 1,
    "optimal": 4,
    "maximizes": 1,
    "accuracy": 1,
    "generalize": 3,
    "ho": 4,
    "suggesttousev": 1,
    "theoretical": 1,
    "empirical": 1,
    "support": 1,
    "claim": 1,
    "cov": 1,
    "nb": 1,
    "win": 1,
    "theyfoundthatv": 1,
    "kscalingworks": 1,
    "perform": 1,
    "imagenet": 4,
    "suggest": 2,
    "layer": 2,
    "wise": 1,
    "adaptive": 2,
    "weca": 1,
    "nsee": 1,
    "larg": 3,
    "mostofthe": 1,
    "usuallyimagenet": 1,
    "onvo": 1,
    "luti": 1,
    "onal": 1,
    "netw": 1,
    "orks": 1,
    "resnet": 1,
    "soit": 1,
    "isno": 1,
    "tcle": 1,
    "arwh": 1,
    "ethe": 2,
    "suggestions": 1,
    "tasks": 1,
    "self": 1,
    "attentional": 1,
    "networks": 4,
    "hnor": 2,
    "mali": 2,
    "zati": 2,
    "io": 2,
    "eand": 1,
    "szegedy": 1,
    "seems": 2,
    "toclo": 1,
    "sethe": 1,
    "gapbe": 1,
    "tween": 1,
    "inin": 1,
    "gand": 1,
    "batchtraining": 1,
    "additiontov": 1,
    "ghos": 1,
    "tbat": 1,
    "chno": 1,
    "rmal": 1,
    "izat": 1,
    "ion": 1,
    "anda": 1,
    "dapt": 1,
    "ngre": 1,
    "gime": 1,
    "hmea": 1,
    "nsde": 1,
    "cayi": 1,
    "normalization": 5,
    "lei": 2,
    "ba": 2,
    "together": 1,
    "inverse": 2,
    "square": 3,
    "momentum": 1,
    "piecewise": 2,
    "decided": 1,
    "dropped": 1,
    "clip_grad_norm": 1,
    "led": 2,
    "anyway": 1,
    "improvements": 2,
    "invariance": 1,
    "under": 1,
    "simultaneous": 1,
    "rescaling": 1,
    "breaks": 1,
    "gets": 2,
    "initial": 1,
    "maximal": 2,
    "stable": 1,
    "gputo": 1,
    "answer": 1,
    "riddle": 2,
    "understand": 1,
    "schedules": 4,
    "parametrization": 1,
    "works": 1,
    "superiorthe": 1,
    "inter": 1,
    "preted": 1,
    "setup": 2,
    "forpiecewise": 1,
    "istodivide": 1,
    "factor": 1,
    "th": 3,
    "itisthe": 1,
    "vari": 1,
    "isus": 1,
    "edas": 1,
    "singlegpu": 1,
    "thea": 1,
    "ctua": 1,
    "llea": 1,
    "rnin": 1,
    "grat": 1,
    "fortheinverse": 1,
    "applying": 1,
    "rnn": 2,
    "successful": 1,
    "switching": 2,
    "possibly": 1,
    "rootdecay": 1,
    "timedecay": 1,
    "exponentialde": 1,
    "cay": 1,
    "api_guides": 1,
    "python": 1,
    "decaying_the_": 1,
    "tf": 1,
    "implementations": 1,
    "actual_lr": 2,
    "equalxc": 1,
    "cis": 1,
    "ing_": 1,
    "explains": 1,
    "previous": 1,
    "ktimes": 3,
    "actu": 1,
    "alle": 1,
    "tev": 1,
    "ignoring": 1,
    "bev": 1,
    "deed": 1,
    "goyal": 2,
    "sense": 1,
    "afterwards": 1,
    "retarded": 1,
    "found": 1,
    "resumed": 3,
    "simp": 1,
    "lyby": 1,
    "ting": 1,
    "output_dir": 1,
    "edinthe": 1,
    "beca": 1,
    "useo": 1,
    "fhar": 1,
    "dwar": 1,
    "eerr": 1,
    "whenwe": 1,
    "continue": 2,
    "search": 1,
    "promising": 1,
    "setups": 2,
    "saves": 1,
    "superiorin": 1,
    "suggesting": 1,
    "thev": 1,
    "klearning": 1,
    "close": 1,
    "generalization": 5,
    "absolute": 1,
    "matters": 1,
    "view": 1,
    "wrong": 1,
    "idea": 1,
    "momen": 1,
    "tumin": 1,
    "tothe": 1,
    "stopped": 1,
    "itstartsfroma": 1,
    "randomposition": 1,
    "ther": 1,
    "elat": 1,
    "ivet": 1,
    "andwall": 1,
    "clocktime": 1,
    "nsor": 1,
    "boar": 1,
    "dgra": 1,
    "phs": 1,
    "exploited": 2,
    "changing": 1,
    "meta": 1,
    "parametrized": 1,
    "sugg": 1,
    "estt": 1,
    "oinc": 1,
    "andnumberofgpus": 1,
    "decaying": 1,
    "yet": 1,
    "domain": 3,
    "adaptation": 1,
    "inthiscase": 1,
    "orfaking": 1,
    "theglobal_step": 1,
    "stored": 1,
    "minute": 1,
    "intervals": 1,
    "utils": 1,
    "avg_checkpoints": 1,
    "py": 1,
    "hourintervals": 1,
    "spent": 1,
    "twofold": 1,
    "averaged": 2,
    "phases": 2,
    "fast": 1,
    "fewer": 1,
    "ave": 2,
    "ter": 3,
    "character": 3,
    "beer": 2,
    "system": 2,
    "uedin": 1,
    "online": 2,
    "limsi": 1,
    "factored": 1,
    "lium": 2,
    "fnmt": 1,
    "cu": 2,
    "chimera": 2,
    "pjatk": 1,
    "tems": 1,
    "ngli": 1,
    "sh": 1,
    "manual": 2,
    "ranking": 1,
    "metrics": 5,
    "provided": 1,
    "matrix": 1,
    "bold": 1,
    "italics": 1,
    "covering": 1,
    "give": 1,
    "proper": 1,
    "signi": 1,
    "cance": 1,
    "paired": 1,
    "bootstrap": 1,
    "testing": 1,
    "then": 1,
    "starts": 1,
    "position": 1,
    "forking": 1,
    "copies": 1,
    "twei": 1,
    "ghts": 1,
    "dint": 1,
    "semi": 1,
    "independent": 1,
    "asde": 1,
    "scri": 1,
    "beda": 1,
    "bove": 1,
    "ourpr": 1,
    "elimi": 1,
    "naryr": 1,
    "esult": 1,
    "sshow": 1,
    "helps": 1,
    "top": 1,
    "boost": 1,
    "free": 1,
    "whole": 1,
    "described": 1,
    "task": 2,
    "despite": 2,
    "rank": 1,
    "outperforms": 1,
    "back": 1,
    "reranking": 2,
    "left": 1,
    "norensembling": 1,
    "asis": 1,
    "thec": 1,
    "aseo": 1,
    "fued": 1,
    "nmta": 1,
    "ndot": 1,
    "hers": 1,
    "ms": 1,
    "notethat": 1,
    "constrained": 1,
    "comparable": 1,
    "conclusion": 1,
    "presented": 1,
    "broad": 1,
    "basic": 2,
    "vaswani": 2,
    "exploration": 1,
    "settings": 1,
    "believe": 1,
    "sum": 1,
    "took": 1,
    "years": 1,
    "among": 1,
    "ve": 1,
    "importantly": 1,
    "shou": 1,
    "ldbe": 1,
    "alwa": 1,
    "yspr": 1,
    "efer": 1,
    "red": 1,
    "intense": 1,
    "concurrently": 1,
    "formed": 1,
    "winner": 1,
    "ackn": 1,
    "owle": 1,
    "dgem": 1,
    "research": 1,
    "grants": 1,
    "science": 1,
    "dation": 1,
    "ict": 1,
    "oftheeu": 1,
    "andu": 1,
    "lindat": 1,
    "clarin": 1,
    "ministry": 1,
    "education": 1,
    "youth": 1,
    "sports": 1,
    "republic": 2,
    "bibliography": 1,
    "dzmitry": 1,
    "kyunghyun": 2,
    "cho": 2,
    "yoshua": 2,
    "bengio": 4,
    "jointly": 1,
    "align": 1,
    "proceedings": 7,
    "iclr": 2,
    "zdenek": 1,
    "\u017eabokrtsk\u00fd": 1,
    "du\u0161ek": 2,
    "petra": 1,
    "galu\u0161c\u00e1kov\u00e1": 1,
    "majli\u0161": 1,
    "david": 1,
    "marecek": 1,
    "jir\u00ed": 1,
    "mar\u0161\u00edk": 1,
    "michal": 2,
    "nov\u00e1k": 2,
    "ale\u0161": 2,
    "tamchyna": 1,
    "joy": 1,
    "par": 1,
    "allelism": 1,
    "eighth": 1,
    "international": 3,
    "eval": 1,
    "uati": 1,
    "onco": 1,
    "nfer": 1,
    "ence": 1,
    "lrec": 1,
    "istanbul": 1,
    "turkey": 1,
    "elra": 1,
    "euro": 1,
    "pean": 1,
    "association": 1,
    "isbn": 3,
    "tom": 1,
    "kocmi": 1,
    "jindrich": 1,
    "libovick\u00fd": 1,
    "roman": 1,
    "sudarikov": 1,
    "du\u0161an": 1,
    "vari\u0161": 1,
    "enlarged": 1,
    "corpus": 1,
    "dockered": 1,
    "sojka": 1,
    "petr": 1,
    "hor\u00e1k": 1,
    "ivan": 1,
    "kopecek": 1,
    "karel": 1,
    "pala": 1,
    "editors": 3,
    "speech": 1,
    "dialogue": 1,
    "conference": 2,
    "tsd": 1,
    "lecture": 1,
    "notes": 1,
    "arti": 1,
    "intelligence": 1,
    "pages": 7,
    "masaryk": 1,
    "springer": 2,
    "publishing": 1,
    "rajenchatterjee": 1,
    "chri": 1,
    "stia": 1,
    "nfed": 1,
    "erma": 1,
    "nn": 1,
    "yvettegraham": 1,
    "barryhaddow": 1,
    "matthias": 1,
    "huck": 1,
    "philippkoehn": 1,
    "varv": 1,
    "aral": 1,
    "ogac": 1,
    "heva": 1,
    "christofmonz": 1,
    "matteonegri": 1,
    "mattpost": 1,
    "raphael": 1,
    "rubino": 1,
    "luciaspecia": 1,
    "andmarcoturchi": 1,
    "copenhagen": 2,
    "denmark": 2,
    "september": 3,
    "acl": 6,
    "yvette": 1,
    "graham": 1,
    "amir": 1,
    "kamran": 1,
    "l\u00e9on": 1,
    "stochastic": 2,
    "descent": 2,
    "tricks": 1,
    "berlin": 3,
    "heidelberg": 2,
    "doi": 2,
    "url": 17,
    "curtis": 1,
    "nocedal": 2,
    "optimization": 1,
    "methods": 1,
    "learn": 1,
    "arxiv": 15,
    "prints": 3,
    "june": 1,
    "abs": 17,
    "cettolo": 1,
    "mauro": 1,
    "marcello": 1,
    "federico": 1,
    "luisa": 1,
    "bentivogli": 1,
    "jan": 2,
    "niehues": 1,
    "sebastian": 1,
    "st\u00fcker": 1,
    "katsuhito": 1,
    "sudoh": 1,
    "koichiro": 1,
    "yoshino": 1,
    "christian": 1,
    "federmann": 1,
    "overview": 1,
    "iwslt": 2,
    "evalua": 1,
    "tioncampaign": 1,
    "tokyo": 1,
    "japan": 1,
    "priya": 1,
    "piotrdoll\u00e1r": 1,
    "rossb": 1,
    "girshick": 1,
    "pieternoordhuis": 1,
    "luka": 1,
    "szwe": 1,
    "solo": 1,
    "wski": 1,
    "aapokyrola": 1,
    "andrewtulloch": 1,
    "yangqingjia": 1,
    "andkaiminghe": 1,
    "accurate": 1,
    "emin": 1,
    "ibat": 1,
    "chsg": 1,
    "corr": 8,
    "elad": 1,
    "itay": 1,
    "hubara": 1,
    "daniel": 1,
    "soudry": 1,
    "closing": 2,
    "guyon": 1,
    "luxburg": 2,
    "wallach": 2,
    "fergus": 2,
    "vishwanathan": 2,
    "garnett": 2,
    "ad": 1,
    "vances": 1,
    "information": 2,
    "curran": 2,
    "associates": 2,
    "inc": 2,
    "nips": 3,
    "cc": 2,
    "pdf": 2,
    "serge": 1,
    "yandc": 1,
    "hrist": 1,
    "iansz": 1,
    "egedy": 1,
    "stanislaw": 1,
    "zachary": 1,
    "kenton": 1,
    "devansh": 1,
    "arpit": 1,
    "nicolas": 1,
    "ballas": 1,
    "asja": 1,
    "fischer": 1,
    "amos": 1,
    "storkey": 1,
    "uencing": 1,
    "nitish": 1,
    "shirish": 1,
    "dheevatsa": 1,
    "mudigere": 1,
    "jorge": 1,
    "mikhail": 1,
    "smelyanskiy": 1,
    "ping": 1,
    "tak": 1,
    "peter": 1,
    "tang": 1,
    "alex": 1,
    "weird": 1,
    "trick": 1,
    "parallelizing": 1,
    "convolutional": 1,
    "jason": 2,
    "thomas": 1,
    "hofmann": 1,
    "explicit": 1,
    "segmentation": 1,
    "kiros": 1,
    "hinton": 1,
    "july": 1,
    "papineni": 1,
    "kishore": 1,
    "salim": 1,
    "roukos": 1,
    "todd": 1,
    "ward": 1,
    "wei": 1,
    "jing": 1,
    "zhu": 1,
    "au": 1,
    "tomatic": 1,
    "philadelphia": 1,
    "pennsylvania": 1,
    "maja": 1,
    "chrf": 1,
    "charactern": 1,
    "gramf": 1,
    "proc": 1,
    "eedi": 1,
    "ngso": 1,
    "fthe": 1,
    "lisbon": 1,
    "portugal": 1,
    "aclweb": 2,
    "anthology": 2,
    "sennrich": 1,
    "rico": 1,
    "barry": 1,
    "haddow": 1,
    "alexandra": 1,
    "birch": 1,
    "rare": 1,
    "germany": 1,
    "august": 1,
    "shazeer": 2,
    "stern": 1,
    "rates": 1,
    "sublinear": 1,
    "cost": 1,
    "apr": 1,
    "samuel": 2,
    "quoc": 3,
    "bayesian": 2,
    "perspective": 1,
    "workshop": 1,
    "beach": 1,
    "ca": 1,
    "usa": 1,
    "pieter": 1,
    "kindermans": 1,
    "ashish": 1,
    "niki": 1,
    "parmar": 1,
    "jakob": 1,
    "uszkoreit": 1,
    "llion": 1,
    "jones": 1,
    "aidan": 1,
    "gomez": 1,
    "lukaszkaiser": 2,
    "andi": 1,
    "llia": 1,
    "polo": 1,
    "sukh": 1,
    "atte": 1,
    "ntio": 1,
    "nisa": 1,
    "llyo": 1,
    "unee": 1,
    "inguyon": 1,
    "advances": 1,
    "attention": 1,
    "yonghui": 1,
    "mike": 1,
    "schuster": 1,
    "zhifeng": 1,
    "chen": 1,
    "mohammad": 1,
    "norouzi": 1,
    "wolfgang": 1,
    "macherey": 1,
    "maximkrikun": 1,
    "yuancao": 1,
    "qingao": 1,
    "klausmacherey": 1,
    "je": 1,
    "klingner": 1,
    "apurvashah": 1,
    "melvinjohnson": 1,
    "xiaobingliu": 1,
    "stephangouws": 1,
    "yoshikiyokato": 1,
    "takukudo": 1,
    "hidetokazawa": 1,
    "keithstevens": 1,
    "georgekurian": 1,
    "nishantpatil": 1,
    "weiwang": 1,
    "cli": 1,
    "young": 1,
    "jasonriesa": 1,
    "alexrudnick": 1,
    "oriolvinyals": 1,
    "gregcorrado": 1,
    "macdu": 1,
    "hughes": 1,
    "andje": 1,
    "rey": 1,
    "dean": 1,
    "google": 1,
    "mach": 1,
    "inet": 1,
    "rans": 1,
    "lati": 1,
    "yang": 1,
    "igor": 1,
    "gitman": 1,
    "boris": 1,
    "ginsburg": 1,
    "correspondence": 1,
    "malostransk\u00e9": 1,
    "n\u00e1mest\u00ed": 1,
    "praha": 1
}