{
    "proceedings": 5,
    "emnlp": 2,
    "systems": 8,
    "demonstrations": 4,
    "pages": 11,
    "november": 1,
    "association": 5,
    "computational": 3,
    "linguistics": 4,
    "transformers": 33,
    "state": 7,
    "art": 6,
    "natural": 14,
    "language": 30,
    "processing": 7,
    "thomas": 2,
    "wolf": 2,
    "lysandre": 2,
    "debut": 2,
    "victor": 2,
    "sanh": 4,
    "julien": 3,
    "chaumond": 2,
    "clement": 1,
    "delangue": 1,
    "anthony": 1,
    "moi": 1,
    "pierric": 1,
    "cistac": 1,
    "tim": 1,
    "rault": 1,
    "emi": 1,
    "louf": 1,
    "morgan": 1,
    "funtowicz": 1,
    "joe": 1,
    "davison": 1,
    "sam": 2,
    "shleifer": 1,
    "patrick": 2,
    "von": 1,
    "platen": 1,
    "clara": 1,
    "ma": 3,
    "yacine": 1,
    "jernite": 1,
    "plu": 1,
    "canwen": 1,
    "xu": 1,
    "teven": 1,
    "le": 7,
    "scao": 1,
    "sylvain": 1,
    "gugger": 1,
    "mariama": 1,
    "drame": 1,
    "quentin": 1,
    "lhoest": 1,
    "alexander": 3,
    "rush": 3,
    "hugging": 3,
    "face": 3,
    "brooklyn": 1,
    "usa": 1,
    "first": 1,
    "name": 5,
    "huggingface": 7,
    "co": 3,
    "abstract": 1,
    "recent": 2,
    "progress": 1,
    "process": 4,
    "ing": 7,
    "been": 1,
    "driven": 1,
    "by": 14,
    "advances": 4,
    "both": 8,
    "model": 85,
    "architecture": 8,
    "pretraining": 16,
    "trans": 6,
    "former": 3,
    "architectures": 6,
    "facilitated": 1,
    "building": 4,
    "higher": 1,
    "capacity": 1,
    "models": 42,
    "made": 4,
    "it": 13,
    "possible": 3,
    "effectively": 1,
    "utilize": 2,
    "this": 14,
    "ca": 1,
    "pacity": 1,
    "wide": 3,
    "variety": 11,
    "tasks": 15,
    "formers": 2,
    "an": 15,
    "open": 8,
    "source": 6,
    "library": 25,
    "with": 33,
    "goal": 2,
    "opening": 1,
    "these": 20,
    "wider": 1,
    "machine": 7,
    "learning": 7,
    "community": 14,
    "li": 3,
    "brary": 2,
    "consists": 1,
    "carefully": 2,
    "engineered": 1,
    "transformer": 21,
    "under": 3,
    "uni": 3,
    "ed": 5,
    "api": 5,
    "backing": 1,
    "cu": 1,
    "rated": 1,
    "collection": 2,
    "pretrained": 18,
    "available": 8,
    "designed": 6,
    "extensible": 3,
    "re": 3,
    "searchers": 1,
    "simple": 4,
    "practitioners": 1,
    "fast": 6,
    "robust": 1,
    "industrial": 2,
    "deployments": 1,
    "https": 8,
    "github": 5,
    "com": 8,
    "introduction": 1,
    "vaswani": 4,
    "et": 49,
    "al": 53,
    "rapidly": 1,
    "become": 2,
    "dominant": 1,
    "lan": 5,
    "guage": 3,
    "surpassing": 1,
    "alternative": 1,
    "neural": 11,
    "such": 9,
    "convolutional": 2,
    "recurrent": 1,
    "networks": 3,
    "performance": 4,
    "understanding": 8,
    "gen": 1,
    "eration": 1,
    "scales": 1,
    "training": 16,
    "data": 5,
    "size": 1,
    "facilitates": 1,
    "ef": 5,
    "cient": 4,
    "parallel": 1,
    "captures": 1,
    "long": 4,
    "range": 3,
    "sequence": 11,
    "features": 4,
    "mccann": 2,
    "howard": 2,
    "ruder": 2,
    "peters": 3,
    "devlin": 3,
    "allows": 6,
    "trained": 6,
    "generic": 2,
    "cor": 1,
    "pora": 1,
    "subsequently": 1,
    "easily": 4,
    "adapted": 2,
    "speci": 20,
    "strong": 2,
    "particularly": 2,
    "conducive": 1,
    "pretrain": 2,
    "large": 4,
    "text": 15,
    "corpora": 1,
    "leading": 2,
    "major": 2,
    "gains": 1,
    "accuracy": 1,
    "downstream": 2,
    "including": 4,
    "classi": 7,
    "cation": 7,
    "yang": 7,
    "liu": 10,
    "b": 4,
    "wang": 7,
    "chine": 1,
    "translation": 7,
    "lample": 4,
    "conneau": 4,
    "a": 4,
    "coreference": 1,
    "resolution": 1,
    "joshi": 4,
    "monsense": 1,
    "inference": 8,
    "bosselut": 2,
    "summarization": 4,
    "lewis": 6,
    "among": 1,
    "others": 1,
    "advance": 1,
    "leads": 2,
    "practical": 1,
    "challenges": 2,
    "that": 11,
    "must": 1,
    "addressed": 2,
    "order": 1,
    "widely": 4,
    "utilized": 1,
    "ubiquitous": 1,
    "use": 18,
    "calls": 1,
    "train": 4,
    "analyze": 1,
    "scale": 2,
    "augment": 1,
    "plat": 1,
    "forms": 1,
    "used": 14,
    "block": 1,
    "design": 4,
    "increasingly": 3,
    "sophisticated": 1,
    "extensions": 1,
    "precise": 1,
    "experiments": 3,
    "pervasive": 1,
    "adoption": 1,
    "pre": 9,
    "methods": 3,
    "led": 1,
    "need": 4,
    "distribute": 2,
    "ne": 11,
    "tune": 2,
    "deploy": 7,
    "compress": 1,
    "core": 10,
    "dedicated": 1,
    "supporting": 1,
    "based": 2,
    "facilitating": 2,
    "distribution": 3,
    "libary": 2,
    "implementation": 2,
    "which": 12,
    "research": 7,
    "production": 5,
    "philosophy": 1,
    "support": 3,
    "strength": 1,
    "im": 5,
    "plementations": 1,
    "popular": 5,
    "variants": 2,
    "easy": 12,
    "read": 1,
    "extend": 1,
    "founda": 1,
    "tion": 6,
    "supports": 3,
    "usage": 2,
    "cen": 1,
    "tralized": 1,
    "hub": 21,
    "users": 13,
    "compare": 1,
    "different": 18,
    "same": 5,
    "minimal": 1,
    "experiment": 3,
    "shared": 1,
    "ongoing": 1,
    "effort": 1,
    "maintained": 1,
    "team": 3,
    "engineers": 1,
    "researchers": 3,
    "from": 18,
    "vibrant": 1,
    "over": 2,
    "external": 1,
    "contributors": 1,
    "leased": 1,
    "apache": 1,
    "license": 1,
    "detailed": 1,
    "documentation": 2,
    "tutorials": 1,
    "website": 1,
    "figure": 9,
    "average": 1,
    "daily": 1,
    "unique": 1,
    "downloads": 1,
    "most": 6,
    "downloaded": 2,
    "oct": 1,
    "may": 2,
    "related": 2,
    "work": 2,
    "nlp": 15,
    "ml": 2,
    "communities": 1,
    "cul": 1,
    "ture": 1,
    "tools": 4,
    "structure": 3,
    "inspired": 1,
    "pi": 1,
    "oneering": 1,
    "tensortensor": 2,
    "original": 2,
    "code": 4,
    "bert": 15,
    "de": 4,
    "vlin": 1,
    "google": 2,
    "concept": 1,
    "providing": 1,
    "caching": 2,
    "stemmed": 1,
    "allennlp": 2,
    "gard": 1,
    "ner": 1,
    "also": 9,
    "closely": 2,
    "lated": 1,
    "modeling": 5,
    "fairseq": 2,
    "ott": 4,
    "nmt": 4,
    "klein": 2,
    "texar": 2,
    "hu": 3,
    "megatron": 2,
    "lm": 4,
    "shoeybi": 2,
    "mar": 3,
    "ian": 3,
    "junczys": 2,
    "dowmunt": 3,
    "build": 2,
    "elements": 1,
    "adds": 1,
    "extra": 2,
    "user": 11,
    "facing": 2,
    "allow": 3,
    "downloading": 1,
    "tuning": 6,
    "well": 2,
    "seamless": 1,
    "transition": 1,
    "maintains": 1,
    "some": 2,
    "compatibility": 1,
    "libraries": 6,
    "directly": 3,
    "tool": 3,
    "performing": 1,
    "infer": 1,
    "ence": 1,
    "using": 4,
    "marian": 2,
    "there": 3,
    "history": 1,
    "general": 5,
    "purpose": 4,
    "two": 2,
    "nltk": 2,
    "loper": 2,
    "bird": 2,
    "stanford": 2,
    "corenlp": 2,
    "manning": 4,
    "collect": 2,
    "approaches": 1,
    "single": 3,
    "package": 1,
    "more": 4,
    "recently": 1,
    "focused": 1,
    "primarily": 1,
    "include": 2,
    "spacy": 2,
    "honnibal": 2,
    "montani": 2,
    "lennlp": 1,
    "gardner": 3,
    "air": 1,
    "akbik": 2,
    "stanza": 2,
    "qi": 2,
    "transform": 1,
    "ersprovides": 1,
    "similar": 3,
    "functionality": 2,
    "additionally": 2,
    "each": 14,
    "now": 3,
    "uses": 4,
    "thetransformers": 1,
    "low": 3,
    "level": 4,
    "framework": 7,
    "since": 3,
    "provides": 2,
    "mod": 3,
    "els": 3,
    "hubs": 2,
    "includ": 1,
    "torch": 1,
    "tensorflow": 4,
    "parameters": 2,
    "unlike": 1,
    "domain": 1,
    "system": 3,
    "provide": 2,
    "automatic": 3,
    "sup": 1,
    "port": 1,
    "analysis": 4,
    "deployment": 6,
    "bench": 2,
    "marking": 2,
    "replicability": 1,
    "mirror": 1,
    "standard": 2,
    "pipeline": 2,
    "apply": 1,
    "make": 4,
    "predictions": 2,
    "though": 1,
    "includes": 4,
    "development": 1,
    "technical": 1,
    "report": 1,
    "focus": 1,
    "cations": 1,
    "complete": 1,
    "details": 2,
    "about": 2,
    "refer": 1,
    "every": 1,
    "fully": 1,
    "ned": 1,
    "three": 3,
    "blocks": 1,
    "shown": 5,
    "diagram": 2,
    "fig": 3,
    "ure": 3,
    "tokenizer": 6,
    "converts": 1,
    "raw": 1,
    "sparse": 2,
    "index": 2,
    "encodings": 1,
    "transforms": 1,
    "indices": 2,
    "contextual": 3,
    "embed": 2,
    "dings": 2,
    "head": 9,
    "em": 1,
    "beddings": 1,
    "task": 3,
    "prediction": 2,
    "needs": 2,
    "ponents": 1,
    "central": 1,
    "tested": 1,
    "implementations": 2,
    "full": 3,
    "list": 1,
    "currently": 1,
    "implemented": 5,
    "left": 4,
    "while": 4,
    "architecturesheads": 1,
    "input": 3,
    "output": 3,
    "ex": 5,
    "datasets": 4,
    "x": 13,
    "xn": 4,
    "generation": 7,
    "wikitext": 2,
    "sentiment": 1,
    "analysisglue": 1,
    "sst": 1,
    "mnli": 1,
    "question": 1,
    "answering": 1,
    "xm": 1,
    "nyspan": 1,
    "qa": 1,
    "reading": 1,
    "comprehensionsquad": 1,
    "questions": 1,
    "token": 5,
    "y": 2,
    "cnner": 1,
    "tagging": 1,
    "ontonotes": 1,
    "wnut": 1,
    "multiple": 1,
    "choice": 1,
    "selection": 1,
    "swag": 1,
    "arc": 1,
    "masked": 3,
    "c": 1,
    "conditional": 3,
    "vmtranslation": 1,
    "summarizationwmt": 1,
    "iwslt": 1,
    "cnn": 1,
    "dm": 1,
    "xsum": 1,
    "roberta": 5,
    "autoregressive": 2,
    "gpt": 6,
    "radford": 2,
    "xl": 2,
    "dai": 3,
    "xlnet": 3,
    "seq": 2,
    "bart": 3,
    "t": 1,
    "raffel": 2,
    "marianmt": 1,
    "specialty": 4,
    "multimodal": 2,
    "mmbt": 1,
    "kiela": 2,
    "distance": 1,
    "reformer": 3,
    "kitaev": 2,
    "longformer": 2,
    "beltagy": 5,
    "albert": 2,
    "electra": 2,
    "clark": 3,
    "distilbert": 3,
    "multilingual": 1,
    "xlm": 1,
    "ransformer": 1,
    "okenizer": 1,
    "tokenizers": 6,
    "character": 2,
    "bpe": 2,
    "byte": 1,
    "wordpiece": 1,
    "sentencepiece": 1,
    "unigram": 1,
    "custom": 1,
    "bio": 1,
    "chem": 1,
    "right": 4,
    "xed": 1,
    "then": 4,
    "further": 2,
    "tuned": 4,
    "alternate": 1,
    "heads": 10,
    "bottom": 1,
    "either": 4,
    "python": 5,
    "or": 13,
    "rust": 2,
    "often": 3,
    "differ": 2,
    "small": 2,
    "but": 3,
    "sync": 1,
    "specialized": 2,
    "versus": 1,
    "cases": 6,
    "speed": 3,
    "image": 1,
    "top": 5,
    "here": 1,
    "assume": 1,
    "nfrom": 1,
    "vocabulary": 3,
    "andyrepresents": 1,
    "outputs": 3,
    "possibly": 1,
    "class": 5,
    "set": 4,
    "example": 9,
    "represent": 1,
    "subset": 1,
    "distributed": 1,
    "shares": 1,
    "multi": 4,
    "headed": 1,
    "attention": 3,
    "signi": 3,
    "cant": 3,
    "differences": 1,
    "between": 5,
    "them": 4,
    "positional": 1,
    "representations": 3,
    "masking": 1,
    "padding": 1,
    "addition": 1,
    "ally": 1,
    "various": 1,
    "built": 1,
    "target": 2,
    "applications": 3,
    "gener": 1,
    "ation": 1,
    "plus": 1,
    "lingual": 3,
    "practically": 1,
    "follow": 2,
    "hierarchy": 1,
    "abstraction": 1,
    "base": 4,
    "implements": 1,
    "computation": 1,
    "graph": 2,
    "encoding": 2,
    "projection": 1,
    "embedding": 1,
    "matrix": 1,
    "through": 4,
    "series": 1,
    "self": 2,
    "layers": 1,
    "nal": 2,
    "encoder": 1,
    "hidden": 2,
    "states": 1,
    "follows": 1,
    "gives": 1,
    "exibility": 1,
    "dissect": 1,
    "inner": 1,
    "workings": 1,
    "individual": 1,
    "enable": 2,
    "ease": 1,
    "extensibility": 1,
    "wherever": 1,
    "fol": 1,
    "allowing": 1,
    "switch": 3,
    "auto": 2,
    "classes": 6,
    "enables": 1,
    "very": 2,
    "even": 1,
    "frameworks": 3,
    "automatically": 2,
    "instantiate": 1,
    "con": 4,
    "guration": 1,
    "critical": 1,
    "aspect": 1,
    "nec": 1,
    "essary": 1,
    "inheriting": 1,
    "common": 2,
    "instantiated": 1,
    "corresponding": 1,
    "gured": 1,
    "manually": 1,
    "store": 1,
    "map": 1,
    "their": 5,
    "corre": 1,
    "sponding": 1,
    "handle": 1,
    "coding": 1,
    "sequences": 1,
    "according": 1,
    "tokenization": 2,
    "plemented": 2,
    "modify": 1,
    "interfaces": 1,
    "add": 1,
    "additional": 2,
    "mappings": 1,
    "special": 2,
    "tokens": 3,
    "separation": 1,
    "otherwise": 1,
    "resize": 1,
    "implement": 1,
    "useful": 1,
    "type": 1,
    "case": 5,
    "maximum": 1,
    "length": 3,
    "truncating": 1,
    "taking": 1,
    "into": 1,
    "account": 2,
    "added": 1,
    "maxi": 1,
    "mum": 1,
    "basedtokenization": 1,
    "undesirably": 1,
    "slow": 1,
    "release": 4,
    "switched": 1,
    "its": 7,
    "plementation": 1,
    "highly": 1,
    "optimized": 3,
    "tokeniza": 1,
    "default": 1,
    "written": 1,
    "procedure": 1,
    "during": 2,
    "paired": 1,
    "one": 5,
    "out": 1,
    "several": 3,
    "ready": 1,
    "amenable": 1,
    "types": 1,
    "ad": 1,
    "ditional": 1,
    "wrapper": 1,
    "adding": 1,
    "layer": 1,
    "op": 1,
    "tional": 2,
    "loss": 1,
    "function": 1,
    "embeddings": 1,
    "naming": 1,
    "pattern": 1,
    "where": 1,
    "xxx": 1,
    "adaptation": 1,
    "like": 3,
    "sampling": 1,
    "beam": 1,
    "search": 2,
    "itself": 1,
    "instance": 1,
    "next": 1,
    "sen": 1,
    "tence": 1,
    "adap": 1,
    "tation": 1,
    "objectives": 1,
    "other": 7,
    "netuning": 1,
    "generally": 1,
    "examples": 1,
    "show": 1,
    "real": 2,
    "problems": 1,
    "amples": 1,
    "demonstrate": 1,
    "how": 2,
    "given": 3,
    "achieve": 2,
    "results": 2,
    "aims": 1,
    "facilitate": 3,
    "dis": 1,
    "tribution": 1,
    "inherently": 1,
    "run": 7,
    "fa": 1,
    "cilitates": 1,
    "many": 2,
    "makes": 2,
    "any": 3,
    "end": 6,
    "ac": 2,
    "cess": 1,
    "own": 1,
    "contains": 1,
    "across": 1,
    "shows": 3,
    "increase": 1,
    "time": 2,
    "continue": 2,
    "spe": 1,
    "cialized": 1,
    "was": 4,
    "developed": 3,
    "are": 1,
    "page": 4,
    "card": 3,
    "scibert": 2,
    "targeting": 1,
    "extraction": 2,
    "scienti": 2,
    "literature": 1,
    "submitted": 1,
    "contrib": 1,
    "utor": 1,
    "widget": 1,
    "enter": 1,
    "arbitrary": 1,
    "version": 2,
    "deployed": 1,
    "produce": 3,
    "summary": 1,
    "interface": 2,
    "upload": 1,
    "sign": 1,
    "command": 2,
    "line": 1,
    "archive": 1,
    "consisting": 1,
    "bundle": 1,
    "converted": 1,
    "checkpoint": 1,
    "stored": 1,
    "canonical": 1,
    "download": 1,
    "cache": 1,
    "lines": 1,
    "load": 1,
    "flaubert": 4,
    "french": 2,
    "corpus": 1,
    "tknzr": 1,
    "autotokenizer": 1,
    "from_pretrained": 2,
    "flaubert_base_uncased": 2,
    "automodel": 1,
    "when": 1,
    "uploaded": 2,
    "landing": 1,
    "describing": 1,
    "properties": 2,
    "addi": 1,
    "metadata": 2,
    "provided": 1,
    "via": 1,
    "mitchell": 2,
    "describes": 1,
    "citation": 1,
    "caveats": 1,
    "known": 1,
    "biases": 1,
    "wouldbe": 1,
    "dif": 1,
    "cult": 1,
    "collections": 1,
    "because": 1,
    "concerning": 1,
    "live": 2,
    "periment": 1,
    "clude": 1,
    "links": 1,
    "visualizations": 1,
    "link": 1,
    "exbert": 2,
    "hoover": 2,
    "visualization": 1,
    "studies": 1,
    "high": 2,
    "lights": 1,
    "stakeholders": 1,
    "summarize": 1,
    "observed": 1,
    "practice": 1,
    "highlight": 1,
    "goals": 1,
    "following": 1,
    "architect": 1,
    "trainer": 1,
    "distinction": 1,
    "strobelt": 3,
    "architects": 1,
    "allenai": 1,
    "lab": 1,
    "new": 2,
    "improved": 1,
    "biomedical": 1,
    "texts": 1,
    "called": 1,
    "they": 6,
    "were": 3,
    "able": 5,
    "utilizing": 1,
    "pubmed": 1,
    "targeted": 1,
    "promote": 1,
    "part": 1,
    "cord": 1,
    "covid": 1,
    "challenge": 1,
    "making": 1,
    "trivial": 1,
    "trainers": 1,
    "nyu": 1,
    "wereinterested": 1,
    "developing": 1,
    "test": 1,
    "bed": 1,
    "per": 2,
    "formance": 1,
    "ent": 1,
    "semantic": 2,
    "recognition": 1,
    "jiant": 2,
    "pruksachatkun": 3,
    "ways": 1,
    "comparing": 1,
    "front": 1,
    "formed": 1,
    "ten": 2,
    "ney": 1,
    "application": 2,
    "plot": 1,
    "ly": 1,
    "company": 1,
    "fo": 1,
    "cused": 1,
    "dashboards": 1,
    "analytics": 1,
    "terested": 1,
    "deploying": 1,
    "doc": 1,
    "ument": 1,
    "wanted": 1,
    "approach": 2,
    "scaled": 1,
    "nd": 2,
    "distilbart": 1,
    "accurate": 1,
    "required": 1,
    "expertise": 1,
    "important": 2,
    "ciently": 1,
    "pro": 3,
    "duction": 1,
    "requires": 1,
    "solving": 1,
    "sig": 1,
    "ni": 1,
    "cantly": 1,
    "than": 2,
    "thereforce": 1,
    "strate": 1,
    "gies": 1,
    "propery": 1,
    "pytorch": 5,
    "interoperability": 1,
    "saved": 2,
    "serialization": 1,
    "reloaded": 1,
    "les": 1,
    "seamlessly": 1,
    "along": 1,
    "life": 1,
    "serving": 2,
    "etc": 1,
    "recommenda": 1,
    "tions": 1,
    "compat": 1,
    "ible": 1,
    "torchscript": 1,
    "intermediate": 2,
    "representa": 1,
    "way": 1,
    "environment": 2,
    "fine": 1,
    "thus": 1,
    "exported": 1,
    "friendly": 1,
    "torchserving": 1,
    "sorflow": 1,
    "options": 1,
    "within": 1,
    "ecosystem": 1,
    "export": 1,
    "interme": 2,
    "diate": 2,
    "network": 2,
    "formats": 1,
    "compila": 1,
    "collaboration": 2,
    "onnx": 4,
    "converting": 1,
    "exchange": 1,
    "format": 3,
    "ployment": 1,
    "not": 1,
    "only": 1,
    "does": 1,
    "standardized": 1,
    "interoperable": 1,
    "ups": 1,
    "optimize": 1,
    "nearly": 1,
    "speedup": 1,
    "perimenting": 1,
    "promising": 1,
    "mats": 1,
    "jax": 2,
    "xla": 1,
    "bradbury": 3,
    "tvm": 2,
    "chen": 6,
    "finally": 1,
    "portant": 1,
    "edge": 2,
    "devices": 2,
    "phones": 1,
    "home": 1,
    "electronics": 1,
    "adapters": 1,
    "convert": 1,
    "coreml": 2,
    "weights": 1,
    "suit": 1,
    "embedded": 1,
    "inside": 1,
    "ios": 1,
    "android": 1,
    "conclusion": 1,
    "play": 1,
    "larger": 1,
    "roles": 1,
    "acces": 1,
    "sible": 1,
    "access": 2,
    "gained": 1,
    "organic": 1,
    "traction": 1,
    "infrastructure": 1,
    "helping": 1,
    "swift": 1,
    "org": 4,
    "cessed": 1,
    "www": 1,
    "accessed": 1,
    "alan": 1,
    "tanja": 1,
    "bergmann": 1,
    "duncan": 1,
    "blythe": 1,
    "kashif": 1,
    "rasul": 1,
    "stefan": 1,
    "schweter": 1,
    "roland": 1,
    "ollgraf": 1,
    "flair": 1,
    "conference": 3,
    "north": 1,
    "american": 1,
    "chapter": 1,
    "putational": 1,
    "aclweb": 2,
    "iz": 2,
    "kyle": 1,
    "lo": 2,
    "arman": 2,
    "cohan": 2,
    "scib": 1,
    "ert": 1,
    "inproceedings": 1,
    "empirical": 1,
    "th": 3,
    "international": 1,
    "joint": 1,
    "ijcnlp": 1,
    "matthew": 5,
    "document": 1,
    "antoine": 1,
    "hannah": 1,
    "rashkin": 1,
    "maarten": 1,
    "sap": 1,
    "chai": 1,
    "tanya": 1,
    "malaviya": 1,
    "asli": 1,
    "elikyilmaz": 1,
    "yejin": 1,
    "choi": 1,
    "comet": 1,
    "commonsense": 1,
    "matic": 1,
    "knowledge": 1,
    "construction": 1,
    "acl": 4,
    "james": 3,
    "roy": 1,
    "frostig": 1,
    "peter": 2,
    "hawkins": 1,
    "johnson": 1,
    "chris": 1,
    "leary": 1,
    "dou": 1,
    "gal": 1,
    "maclaurin": 1,
    "skye": 1,
    "wanderman": 1,
    "milne": 1,
    "composable": 1,
    "transformations": 1,
    "numpy": 1,
    "programs": 1,
    "tianqi": 1,
    "thierry": 1,
    "moreau": 1,
    "ziheng": 1,
    "jiang": 1,
    "lianmin": 1,
    "zheng": 1,
    "eddie": 1,
    "yan": 1,
    "haichen": 1,
    "shen": 1,
    "meghan": 1,
    "cowan": 1,
    "leyuan": 1,
    "yuwei": 1,
    "luis": 1,
    "ceze": 1,
    "automated": 1,
    "optimizing": 1,
    "piler": 1,
    "deep": 4,
    "usenix": 1,
    "sympo": 1,
    "sium": 1,
    "operating": 1,
    "implementa": 1,
    "osdi": 1,
    "kevin": 2,
    "minh": 1,
    "thang": 1,
    "luong": 1,
    "quoc": 3,
    "christopher": 4,
    "encoders": 1,
    "discriminators": 1,
    "rather": 1,
    "generators": 1,
    "zihang": 2,
    "zhilin": 2,
    "yiming": 2,
    "jaime": 2,
    "car": 2,
    "bonell": 2,
    "ruslan": 2,
    "salakhutdinov": 2,
    "attentive": 1,
    "beyond": 1,
    "fixed": 1,
    "context": 1,
    "jacob": 1,
    "ming": 1,
    "wei": 2,
    "chang": 1,
    "kenton": 2,
    "lee": 3,
    "kristina": 1,
    "toutanova": 1,
    "bidirectional": 1,
    "standing": 1,
    "matt": 2,
    "joel": 1,
    "grus": 1,
    "mark": 2,
    "neumann": 2,
    "oyvind": 1,
    "tafjord": 1,
    "pradeep": 1,
    "dasigi": 1,
    "nelson": 1,
    "pe": 1,
    "ters": 1,
    "michael": 5,
    "schmitz": 1,
    "luke": 6,
    "zettlemoyer": 6,
    "cessing": 2,
    "platform": 2,
    "ines": 1,
    "bloom": 1,
    "incremen": 1,
    "tal": 1,
    "parsing": 1,
    "appear": 1,
    "benjamin": 2,
    "hendrik": 2,
    "sebastian": 4,
    "gehrmann": 2,
    "visual": 3,
    "explore": 1,
    "learned": 2,
    "jeremy": 1,
    "universal": 1,
    "zhiting": 1,
    "haoran": 1,
    "shi": 1,
    "bowen": 1,
    "tan": 1,
    "wentao": 1,
    "zichao": 1,
    "tiancheng": 1,
    "zhao": 1,
    "junxian": 1,
    "he": 1,
    "lianhui": 1,
    "qin": 1,
    "di": 1,
    "xuezhe": 1,
    "zhengzhong": 1,
    "xiao": 1,
    "dan": 1,
    "liang": 1,
    "wangrong": 1,
    "zhu": 1,
    "devendra": 1,
    "singh": 3,
    "sachan": 1,
    "eric": 1,
    "xing": 1,
    "modularized": 1,
    "ver": 1,
    "satile": 1,
    "toolkit": 7,
    "mandar": 1,
    "danqi": 3,
    "yinhan": 4,
    "daniel": 1,
    "weld": 1,
    "omer": 6,
    "levy": 6,
    "spanbert": 1,
    "improving": 1,
    "representing": 1,
    "predict": 1,
    "spans": 1,
    "arxiv": 9,
    "preprint": 3,
    "marcin": 1,
    "roman": 1,
    "grundkiewicz": 1,
    "tomasz": 1,
    "dwojak": 1,
    "hieu": 1,
    "hoang": 1,
    "kenneth": 1,
    "hea": 1,
    "eld": 1,
    "tom": 1,
    "neckermann": 1,
    "frank": 1,
    "seide": 1,
    "ulrich": 1,
    "germann": 1,
    "ham": 1,
    "fikri": 1,
    "aji": 1,
    "nikolay": 1,
    "bogoychev": 1,
    "andr": 1,
    "tins": 1,
    "alexandra": 1,
    "birch": 1,
    "neu": 1,
    "ral": 1,
    "douwe": 1,
    "suvrat": 1,
    "bhooshan": 1,
    "hamed": 1,
    "firooz": 1,
    "davide": 1,
    "testuggine": 1,
    "supervised": 2,
    "bitransformers": 1,
    "classifying": 1,
    "images": 1,
    "nikita": 2,
    "lukasz": 2,
    "kaiser": 3,
    "anselm": 1,
    "levskaya": 1,
    "guillaume": 3,
    "yoon": 1,
    "kim": 1,
    "yuntian": 1,
    "deng": 1,
    "jean": 1,
    "senel": 1,
    "lart": 1,
    "opennmt": 1,
    "vancouver": 1,
    "canada": 1,
    "alexis": 2,
    "cross": 2,
    "neurips": 1,
    "zhenzhong": 1,
    "mingda": 1,
    "goodman": 1,
    "gimpel": 1,
    "piyush": 1,
    "sharma": 1,
    "radu": 1,
    "soricut": 1,
    "lite": 1,
    "hang": 1,
    "ic": 1,
    "vial": 1,
    "jibril": 1,
    "frej": 1,
    "vincent": 1,
    "segonne": 1,
    "max": 1,
    "imin": 1,
    "coavoux": 1,
    "lecouteux": 1,
    "alexandre": 1,
    "lauzen": 1,
    "beno": 1,
    "crabb": 1,
    "laurent": 1,
    "besacier": 1,
    "didier": 1,
    "schwab": 1,
    "unsupervised": 2,
    "resources": 2,
    "evaluation": 1,
    "ference": 1,
    "marseille": 1,
    "france": 1,
    "euro": 1,
    "pean": 1,
    "mike": 3,
    "naman": 3,
    "goyal": 3,
    "jan": 1,
    "ghazvininejad": 1,
    "abdelrahman": 1,
    "mohamed": 1,
    "ves": 1,
    "stoyanov": 3,
    "denoising": 1,
    "comprehension": 1,
    "myle": 3,
    "jingfei": 2,
    "du": 2,
    "man": 2,
    "dar": 2,
    "veselin": 2,
    "robustly": 2,
    "ap": 1,
    "proach": 1,
    "abs": 4,
    "edward": 1,
    "steven": 2,
    "nat": 1,
    "ural": 1,
    "mihai": 1,
    "surdeanu": 1,
    "john": 1,
    "bauer": 1,
    "jenny": 1,
    "rose": 1,
    "finkel": 1,
    "bethard": 1,
    "david": 3,
    "mc": 1,
    "closky": 1,
    "annual": 1,
    "meeting": 1,
    "bryan": 2,
    "caiming": 1,
    "xiong": 1,
    "richard": 1,
    "socher": 1,
    "textualized": 1,
    "word": 2,
    "vectors": 1,
    "guyon": 2,
    "luxburg": 2,
    "bengio": 3,
    "wallach": 2,
    "fergus": 2,
    "vishwanathan": 2,
    "garnett": 1,
    "editors": 2,
    "informa": 1,
    "cur": 1,
    "ran": 1,
    "associates": 1,
    "inc": 2,
    "margaret": 1,
    "simone": 1,
    "wu": 2,
    "andrew": 1,
    "zaldivar": 1,
    "parker": 1,
    "barnes": 1,
    "lucy": 1,
    "vasserman": 1,
    "ben": 1,
    "hutchinson": 1,
    "elena": 1,
    "spitzer": 1,
    "inioluwa": 1,
    "deborah": 1,
    "raji": 1,
    "timnit": 1,
    "gebru": 1,
    "cards": 1,
    "reporting": 1,
    "sergey": 1,
    "edunov": 1,
    "alexei": 1,
    "baevski": 1,
    "angela": 1,
    "fan": 1,
    "gross": 1,
    "nathan": 1,
    "ng": 1,
    "grangier": 1,
    "auli": 1,
    "mohit": 1,
    "iyyer": 1,
    "contextualized": 1,
    "repre": 1,
    "sentations": 1,
    "yada": 2,
    "phil": 1,
    "yeres": 1,
    "haokun": 1,
    "jason": 2,
    "phang": 1,
    "phu": 1,
    "mon": 1,
    "htut": 1,
    "alex": 3,
    "tenney": 2,
    "samuel": 3,
    "bowman": 3,
    "software": 1,
    "peng": 1,
    "yuhao": 1,
    "zhang": 2,
    "yuhui": 1,
    "bolton": 1,
    "human": 1,
    "languages": 1,
    "alec": 1,
    "jeffrey": 1,
    "rewon": 1,
    "child": 1,
    "luan": 1,
    "dario": 1,
    "amodei": 1,
    "ilya": 1,
    "sutskever": 1,
    "multitask": 1,
    "learners": 1,
    "openai": 1,
    "blog": 1,
    "colin": 1,
    "noam": 3,
    "shazeer": 3,
    "adam": 1,
    "roberts": 1,
    "katherine": 1,
    "sharan": 1,
    "narang": 1,
    "matena": 1,
    "yanqi": 1,
    "zhou": 1,
    "exploring": 1,
    "limits": 1,
    "transfer": 1,
    "distilled": 1,
    "smaller": 1,
    "faster": 1,
    "cheaper": 1,
    "lighter": 1,
    "mohammad": 1,
    "mostofa": 1,
    "patwary": 1,
    "raul": 1,
    "puri": 1,
    "legresley": 1,
    "jared": 1,
    "casper": 1,
    "catan": 1,
    "zaro": 1,
    "billion": 1,
    "parameter": 1,
    "gpu": 1,
    "paral": 1,
    "lelism": 1,
    "hanspeter": 1,
    "ter": 1,
    "lstmvis": 1,
    "dynamics": 1,
    "recur": 1,
    "rent": 1,
    "ieee": 1,
    "transactions": 1,
    "ization": 1,
    "computer": 1,
    "graphics": 1,
    "dipanjan": 1,
    "das": 1,
    "ellie": 1,
    "pavlick": 1,
    "rediscovers": 1,
    "classical": 1,
    "ashish": 2,
    "samy": 1,
    "eugene": 1,
    "brevdo": 1,
    "fran": 1,
    "cois": 1,
    "chollet": 1,
    "aidan": 2,
    "gomez": 2,
    "stephan": 1,
    "gouws": 1,
    "llion": 2,
    "jones": 2,
    "kalchbrenner": 1,
    "niki": 2,
    "parmar": 2,
    "ryan": 1,
    "sepassi": 1,
    "jakob": 2,
    "uszkoreit": 2,
    "corr": 1,
    "ukasz": 1,
    "illia": 1,
    "polosukhin": 1,
    "you": 1,
    "gar": 1,
    "nett": 1,
    "information": 1,
    "curran": 1,
    "asso": 1,
    "ciates": 1,
    "nangia": 1,
    "amanpreet": 2,
    "julian": 2,
    "felix": 2,
    "hill": 2,
    "superglue": 1,
    "stickier": 1,
    "benchmark": 2,
    "un": 1,
    "derstanding": 1,
    "glue": 1,
    "iclr": 1,
    "generalized": 1
}