{
    "overview": 3,
    "historical": 2,
    "perspective": 1,
    "explainable": 35,
    "artificial": 6,
    "intelligence": 18,
    "roberto": 5,
    "confalonieri": 32,
    "ludovik": 2,
    "coba": 11,
    "benedikt": 2,
    "wagner": 3,
    "tarek": 3,
    "besold": 15,
    "faculty": 2,
    "computer": 16,
    "science": 12,
    "free": 1,
    "university": 1,
    "bozen": 4,
    "bolzano": 5,
    "italy": 1,
    "research": 8,
    "centre": 1,
    "machine": 25,
    "learning": 52,
    "city": 1,
    "london": 4,
    "uk": 4,
    "neurocat": 1,
    "gmbh": 1,
    "berlin": 7,
    "germany": 2,
    "correspondence": 1,
    "ofcomputer": 1,
    "ofbozen": 1,
    "dominikanerplatz": 1,
    "email": 1,
    "unibz": 1,
    "itabstract": 1,
    "explainability": 3,
    "ai": 61,
    "been": 14,
    "revived": 1,
    "topic": 2,
    "ofactive": 1,
    "by": 40,
    "need": 3,
    "conveying": 1,
    "safety": 2,
    "trust": 11,
    "users": 13,
    "howand": 1,
    "whyof": 1,
    "automated": 1,
    "decision": 10,
    "making": 5,
    "different": 18,
    "applications": 6,
    "such": 32,
    "autonomous": 4,
    "driving": 5,
    "medical": 8,
    "diagnosis": 1,
    "or": 44,
    "banking": 1,
    "finance": 6,
    "while": 3,
    "recently": 10,
    "received": 1,
    "significant": 1,
    "attention": 3,
    "ori": 1,
    "gins": 1,
    "this": 35,
    "line": 1,
    "work": 9,
    "go": 6,
    "back": 1,
    "several": 5,
    "decades": 1,
    "when": 6,
    "systems": 14,
    "weremainly": 1,
    "developed": 3,
    "knowledge": 5,
    "based": 14,
    "expert": 5,
    "since": 6,
    "then": 5,
    "defini": 1,
    "tion": 7,
    "understanding": 10,
    "implementation": 2,
    "picked": 1,
    "lines": 1,
    "namely": 1,
    "learn": 2,
    "ing": 11,
    "recommender": 34,
    "approaches": 9,
    "neural": 50,
    "symbolic": 1,
    "reasoning": 3,
    "mostly": 2,
    "happening": 1,
    "during": 2,
    "periods": 2,
    "history": 1,
    "article": 5,
    "present": 1,
    "intelli": 1,
    "gence": 1,
    "discuss": 2,
    "how": 7,
    "was": 11,
    "mainly": 2,
    "conceived": 1,
    "past": 1,
    "howit": 1,
    "understood": 1,
    "it": 37,
    "might": 1,
    "future": 8,
    "conclude": 2,
    "proposing": 3,
    "criteria": 1,
    "explanations": 76,
    "that": 24,
    "believe": 1,
    "will": 9,
    "play": 1,
    "crucial": 4,
    "role": 5,
    "development": 2,
    "human": 24,
    "understandable": 2,
    "explain": 19,
    "able": 4,
    "categorized": 1,
    "under": 2,
    "fundamental": 1,
    "concepts": 7,
    "data": 18,
    "technologies": 2,
    "keywords": 1,
    "interpretable": 6,
    "introduction": 1,
    "identified": 2,
    "key": 2,
    "factor": 1,
    "adoption": 1,
    "wide": 1,
    "range": 3,
    "contexts": 1,
    "doshi": 4,
    "velez": 4,
    "kim": 6,
    "lipton": 3,
    "ribeiro": 1,
    "singh": 1,
    "guestrin": 1,
    "a": 1,
    "discussion": 2,
    "accompanying": 1,
    "increasinglycommon": 1,
    "deployment": 1,
    "intelligent": 1,
    "application": 2,
    "domains": 3,
    "vehicles": 1,
    "transportation": 2,
    "insurance": 2,
    "financial": 6,
    "services": 3,
    "shown": 4,
    "decisions": 16,
    "taken": 2,
    "suggested": 1,
    "byreceived": 1,
    "november": 1,
    "revised": 1,
    "september": 3,
    "accepted": 1,
    "doi": 1,
    "widm": 24,
    "an": 41,
    "open": 3,
    "access": 2,
    "terms": 2,
    "creative": 35,
    "commons": 35,
    "attribution": 2,
    "license": 1,
    "which": 43,
    "permits": 1,
    "use": 13,
    "distribution": 3,
    "reproduction": 1,
    "any": 2,
    "me": 1,
    "dium": 1,
    "provided": 1,
    "original": 2,
    "properly": 1,
    "cited": 1,
    "authors": 5,
    "wires": 26,
    "mining": 4,
    "discovery": 4,
    "published": 4,
    "wiley": 3,
    "periodicals": 1,
    "llc": 1,
    "knowl": 6,
    "discov": 2,
    "e": 3,
    "com": 3,
    "dmkd": 1,
    "o": 1,
    "f": 3,
    "https": 1,
    "org": 1,
    "essential": 1,
    "practical": 1,
    "social": 2,
    "with": 29,
    "increasing": 2,
    "frequency": 3,
    "legal": 2,
    "reasons": 1,
    "explana": 5,
    "developers": 1,
    "regulators": 1,
    "case": 5,
    "point": 1,
    "european": 5,
    "union": 1,
    "general": 6,
    "protection": 1,
    "regulation": 5,
    "gdpr": 1,
    "stipulates": 1,
    "right": 8,
    "obtain": 2,
    "meaningful": 3,
    "information": 19,
    "about": 10,
    "logic": 7,
    "involved": 3,
    "commonly": 3,
    "interpreted": 1,
    "explanation": 40,
    "for": 2,
    "con": 4,
    "sumers": 1,
    "affected": 2,
    "automatic": 1,
    "parliament": 2,
    "council": 2,
    "equipping": 1,
    "explanatory": 2,
    "capabilities": 1,
    "not": 31,
    "limited": 1,
    "issues": 4,
    "user": 4,
    "rights": 2,
    "technology": 6,
    "acceptance": 1,
    "though": 1,
    "also": 15,
    "required": 2,
    "designers": 1,
    "enhance": 2,
    "system": 21,
    "robustness": 1,
    "enable": 2,
    "diagnostics": 1,
    "prevent": 4,
    "bias": 1,
    "unfairness": 1,
    "discrimination": 2,
    "well": 4,
    "increase": 1,
    "allusers": 1,
    "whyandhow": 1,
    "made": 4,
    "being": 5,
    "provide": 6,
    "why": 5,
    "certain": 4,
    "thus": 7,
    "become": 4,
    "desirable": 1,
    "property": 1,
    "doran": 4,
    "schulz": 2,
    "should": 8,
    "help": 7,
    "model": 51,
    "thesystem": 2,
    "order": 6,
    "maintain": 2,
    "effectively": 1,
    "they": 13,
    "assist": 1,
    "debugging": 2,
    "toprevent": 1,
    "rectify": 1,
    "incorrect": 1,
    "conclusions": 2,
    "addition": 1,
    "serve": 6,
    "educational": 2,
    "purposes": 1,
    "helpful": 1,
    "people": 3,
    "discovering": 1,
    "novel": 1,
    "domain": 4,
    "finally": 3,
    "related": 2,
    "persuasion": 1,
    "convey": 2,
    "sense": 2,
    "actionability": 1,
    "convince": 1,
    "decisionsare": 1,
    "most": 7,
    "convenient": 2,
    "them": 8,
    "notwithstanding": 2,
    "there": 2,
    "clear": 3,
    "agreement": 2,
    "what": 15,
    "nor": 1,
    "good": 2,
    "entails": 1,
    "its": 9,
    "manifestations": 1,
    "studied": 3,
    "across": 1,
    "incarnation": 1,
    "disciplines": 1,
    "first": 1,
    "notions": 9,
    "ofexplainability": 1,
    "subsided": 1,
    "together": 2,
    "after": 2,
    "mid": 1,
    "s": 1,
    "buchanan": 5,
    "shortliffe": 5,
    "wick": 8,
    "thompson": 5,
    "brought": 1,
    "into": 12,
    "focus": 6,
    "recent": 7,
    "successes": 1,
    "guidotti": 9,
    "et": 8,
    "al": 8,
    "both": 5,
    "nunes": 7,
    "jannach": 10,
    "loop": 4,
    "holzinger": 1,
    "plass": 2,
    "tintarev": 8,
    "masthof": 8,
    "garcez": 18,
    "look": 1,
    "literature": 1,
    "xai": 9,
    "from": 15,
    "traditional": 1,
    "currently": 1,
    "relevant": 7,
    "vast": 1,
    "articledoes": 1,
    "aim": 4,
    "complete": 1,
    "each": 14,
    "perspectives": 1,
    "reader": 1,
    "find": 1,
    "more": 16,
    "comprehensive": 1,
    "reviews": 2,
    "deep": 48,
    "arrieta": 4,
    "fernandez": 2,
    "herrera": 3,
    "cordon": 2,
    "jose": 2,
    "del": 2,
    "jesus": 2,
    "marcelloni": 2,
    "mueller": 1,
    "hoffman": 4,
    "clancey": 4,
    "emrey": 2,
    "klein": 2,
    "rather": 9,
    "resp": 3,
    "format": 3,
    "examples": 4,
    "main": 6,
    "contributions": 2,
    "references": 1,
    "he": 14,
    "gain": 3,
    "deeper": 2,
    "organized": 1,
    "follows": 1,
    "section": 11,
    "give": 2,
    "subsequently": 1,
    "addressed": 1,
    "throughout": 1,
    "describes": 1,
    "two": 4,
    "expla": 2,
    "nations": 1,
    "prominently": 1,
    "represented": 5,
    "problem": 5,
    "solving": 3,
    "activities": 3,
    "notion": 1,
    "machinelearning": 4,
    "few": 6,
    "discusses": 1,
    "conceptualized": 1,
    "context": 2,
    "identifies": 2,
    "increasingly": 3,
    "popular": 2,
    "promising": 2,
    "approach": 8,
    "provides": 3,
    "critical": 3,
    "discussionand": 1,
    "comparison": 2,
    "mentioned": 1,
    "introduces": 2,
    "desiderata": 4,
    "set": 1,
    "challenges": 8,
    "sys": 5,
    "tems": 3,
    "concludes": 1,
    "defining": 1,
    "remains": 2,
    "still": 4,
    "question": 2,
    "particular": 3,
    "determining": 13,
    "today": 6,
    "active": 1,
    "debate": 1,
    "various": 1,
    "fields": 1,
    "including": 2,
    "cognitive": 1,
    "psychology": 3,
    "downloaded": 2,
    "onlinelibrary": 70,
    "inasp": 20,
    "hinari": 20,
    "pakistan": 19,
    "online": 3,
    "library": 25,
    "see": 21,
    "conditions": 72,
    "rules": 2,
    "oa": 35,
    "articles": 1,
    "governed": 35,
    "applicable": 2,
    "philosophy": 1,
    "litman": 2,
    "lombrozo": 4,
    "miller": 11,
    "articulates": 1,
    "link": 1,
    "between": 7,
    "sciences": 5,
    "providing": 4,
    "depth": 4,
    "survey": 2,
    "three": 3,
    "major": 1,
    "findings": 3,
    "were": 2,
    "highlighted": 1,
    "counterfactual": 18,
    "humans": 5,
    "tend": 3,
    "understand": 4,
    "event": 3,
    "happened": 1,
    "instead": 1,
    "some": 8,
    "other": 19,
    "events": 1,
    "second": 1,
    "selective": 1,
    "one": 15,
    "possible": 3,
    "causes": 1,
    "recommendation": 23,
    "overwhelm": 1,
    "too": 1,
    "much": 1,
    "third": 2,
    "conversation": 1,
    "interaction": 2,
    "purpose": 2,
    "transferring": 1,
    "implying": 1,
    "explainer": 4,
    "must": 2,
    "leverage": 2,
    "mental": 1,
    "explainee": 5,
    "engaging": 2,
    "process": 7,
    "according": 3,
    "these": 33,
    "points": 2,
    "properties": 3,
    "building": 3,
    "useful": 2,
    "prevalent": 1,
    "only": 7,
    "started": 1,
    "take": 1,
    "account": 2,
    "researchers": 3,
    "defined": 1,
    "oriented": 1,
    "instance": 10,
    "needs": 3,
    "differentiate": 1,
    "distinct": 2,
    "goals": 1,
    "highlighting": 2,
    "cognition": 2,
    "constraints": 1,
    "design": 2,
    "hilton": 3,
    "pointed": 2,
    "out": 1,
    "imply": 1,
    "interactions": 2,
    "generated": 2,
    "isessential": 1,
    "associate": 1,
    "semantic": 1,
    "components": 5,
    "effective": 1,
    "transmis": 1,
    "sion": 1,
    "kulesza": 4,
    "investigated": 2,
    "relationship": 1,
    "tions": 7,
    "fidelity": 9,
    "models": 28,
    "finding": 1,
    "completeness": 1,
    "ultimately": 1,
    "appears": 1,
    "important": 11,
    "thansoundness": 1,
    "oversimplification": 1,
    "detrimental": 1,
    "hitherto": 1,
    "focused": 1,
    "part": 6,
    "mechanistic": 2,
    "aspects": 3,
    "includes": 1,
    "but": 18,
    "types": 8,
    "create": 3,
    "consequently": 1,
    "their": 14,
    "depend": 3,
    "type": 5,
    "employed": 2,
    "subsymbolic": 2,
    "hybrid": 1,
    "draw": 2,
    "hypothesis": 2,
    "holds": 3,
    "baseusually": 1,
    "encoded": 1,
    "production": 5,
    "inference": 8,
    "mechanism": 1,
    "deduction": 1,
    "abduction": 1,
    "analogical": 1,
    "doyle": 3,
    "tsymbal": 2,
    "cunningham": 2,
    "lacave": 3,
    "diez": 3,
    "mitchell": 2,
    "keller": 2,
    "kedar": 2,
    "cabelli": 2,
    "consist": 1,
    "either": 4,
    "descriptions": 1,
    "coupled": 3,
    "trace": 3,
    "story": 10,
    "behind": 2,
    "metrics": 5,
    "accuracy": 1,
    "adaptability": 3,
    "comprehensibility": 9,
    "typically": 4,
    "meant": 1,
    "precise": 1,
    "reconstruction": 1,
    "behavior": 1,
    "adaptable": 1,
    "match": 2,
    "profiles": 1,
    "indeed": 1,
    "lay": 2,
    "interested": 1,
    "less": 1,
    "accurate": 1,
    "whereas": 2,
    "prefer": 2,
    "technical": 1,
    "formats": 1,
    "connectionist": 6,
    "generally": 1,
    "speaking": 1,
    "those": 1,
    "rely": 4,
    "representations": 10,
    "cases": 2,
    "distributed": 1,
    "processing": 4,
    "occurs": 1,
    "simultaneously": 1,
    "multiple": 1,
    "parallel": 1,
    "channels": 2,
    "unfortunately": 1,
    "frequently": 2,
    "bring": 1,
    "black": 6,
    "box": 5,
    "nature": 8,
    "corresponding": 1,
    "consequence": 1,
    "often": 4,
    "form": 1,
    "approximateor": 1,
    "try": 3,
    "mimic": 1,
    "andrews": 4,
    "diederich": 2,
    "tickle": 2,
    "interpret": 5,
    "allows": 1,
    "means": 3,
    "local": 7,
    "global": 2,
    "post": 1,
    "hoc": 4,
    "evaluated": 1,
    "using": 10,
    "measure": 4,
    "extent": 4,
    "competitive": 1,
    "levels": 5,
    "respect": 1,
    "accurately": 1,
    "imitate": 1,
    "predictor": 4,
    "respectively": 2,
    "additional": 1,
    "targetting": 1,
    "causability": 1,
    "introduced": 2,
    "langs": 1,
    "carrington": 2,
    "mller": 5,
    "refers": 1,
    "achieves": 1,
    "level": 14,
    "causal": 1,
    "specified": 1,
    "measured": 2,
    "effectiveness": 2,
    "efficiency": 3,
    "satisfaction": 4,
    "transparency": 9,
    "additionalclass": 1,
    "predominantly": 1,
    "methods": 32,
    "coun": 1,
    "terfactuals": 1,
    "hypothetical": 1,
    "input": 17,
    "show": 5,
    "prediction": 19,
    "could": 9,
    "obtained": 4,
    "moved": 1,
    "mothilal": 8,
    "sharma": 1,
    "tan": 1,
    "category": 2,
    "sub": 1,
    "consensus": 2,
    "makes": 4,
    "nilashi": 2,
    "bin": 2,
    "ibrahim": 2,
    "esfahani": 2,
    "ahmadi": 2,
    "fact": 3,
    "onconfalonieri": 1,
    "impact": 1,
    "makers": 1,
    "differently": 1,
    "rook": 5,
    "example": 3,
    "tailored": 2,
    "persuade": 1,
    "item": 3,
    "efficiently": 1,
    "implementing": 2,
    "usual": 1,
    "determine": 1,
    "objective": 3,
    "stakeholders": 1,
    "delivering": 1,
    "persuasive": 1,
    "probability": 1,
    "purchase": 2,
    "recommended": 5,
    "trustworthiness": 1,
    "another": 9,
    "desired": 1,
    "nation": 1,
    "return": 1,
    "reuse": 1,
    "chen": 1,
    "pu": 2,
    "moreover": 5,
    "efficient": 2,
    "satisfying": 1,
    "deciding": 2,
    "fast": 6,
    "ease": 1,
    "fosters": 1,
    "understandability": 5,
    "underlying": 1,
    "advice": 2,
    "giving": 2,
    "scrutability": 1,
    "tell": 1,
    "wrong": 3,
    "correlated": 1,
    "transparent": 1,
    "comprehensible": 5,
    "known": 1,
    "detailed": 1,
    "relationships": 1,
    "characteristics": 3,
    "refer": 1,
    "balog": 2,
    "radlinski": 2,
    "combine": 3,
    "build": 3,
    "predictive": 3,
    "large": 7,
    "amounts": 1,
    "equipped": 1,
    "rich": 3,
    "representation": 1,
    "edge": 1,
    "used": 8,
    "higher": 1,
    "structured": 1,
    "elements": 2,
    "explainthe": 1,
    "here": 4,
    "andfidelity": 1,
    "performance": 5,
    "consistency": 11,
    "andcomprehensibility": 1,
    "proper": 1,
    "ties": 1,
    "produced": 2,
    "view": 1,
    "basis": 2,
    "forcommon": 1,
    "supports": 3,
    "abstraction": 1,
    "refinement": 5,
    "injection": 1,
    "eppe": 2,
    "schorlemmer": 2,
    "kutz": 4,
    "pen": 1,
    "aloza": 2,
    "plaza": 2,
    "lehmann": 3,
    "hitzler": 7,
    "capability": 1,
    "parts": 3,
    "change": 1,
    "accuracyand": 1,
    "technicality": 2,
    "depending": 1,
    "profile": 1,
    "furthermore": 4,
    "refine": 1,
    "extracted": 2,
    "inject": 1,
    "improve": 4,
    "broda": 2,
    "gabbay": 2,
    "software": 1,
    "augmented": 1,
    "consid": 1,
    "ered": 1,
    "instantiations": 1,
    "support": 1,
    "sev": 1,
    "eral": 1,
    "consists": 1,
    "base": 4,
    "encoding": 1,
    "usually": 5,
    "modeled": 4,
    "produc": 1,
    "rule": 3,
    "interpreter": 1,
    "reasoner": 1,
    "interface": 2,
    "through": 7,
    "query": 3,
    "ways": 1,
    "activity": 4,
    "seeing": 2,
    "way": 3,
    "make": 6,
    "kind": 1,
    "accommodatesthe": 1,
    "engineers": 1,
    "whether": 4,
    "technically": 1,
    "sound": 3,
    "slight": 1,
    "vari": 1,
    "ants": 1,
    "experts": 1,
    "famous": 1,
    "instantiation": 1,
    "mycin": 6,
    "consultation": 4,
    "created": 2,
    "doctors": 1,
    "diagnostic": 6,
    "therapeutic": 1,
    "patients": 2,
    "infection": 1,
    "expertise": 1,
    "sists": 1,
    "static": 1,
    "containing": 2,
    "specific": 2,
    "factual": 1,
    "aboutthe": 1,
    "consideration": 1,
    "table": 1,
    "solutions": 1,
    "patient": 4,
    "uses": 5,
    "instantiate": 1,
    "answering": 1,
    "module": 3,
    "status": 1,
    "checker": 2,
    "former": 1,
    "answers": 2,
    "simple": 6,
    "english": 6,
    "language": 1,
    "questions": 3,
    "concerning": 1,
    "oro": 1,
    "latter": 1,
    "followed": 3,
    "accepts": 2,
    "predefined": 2,
    "allow": 5,
    "dynamic": 3,
    "rationale": 1,
    "parameters": 1,
    "values": 1,
    "hand": 3,
    "sequence": 3,
    "thequestion": 1,
    "basic": 2,
    "commands": 1,
    "command": 2,
    "ascend": 1,
    "chain": 2,
    "explore": 1,
    "descend": 1,
    "infer": 1,
    "ences": 1,
    "exploring": 1,
    "goal": 3,
    "achieved": 1,
    "although": 5,
    "provisioning": 1,
    "logically": 1,
    "improves": 1,
    "interpretability": 6,
    "asked": 1,
    "complex": 4,
    "reconstruct": 2,
    "fits": 1,
    "benefit": 1,
    "very": 9,
    "technicalexplanation": 1,
    "compared": 1,
    "engineer": 1,
    "motivated": 1,
    "reconceptualization": 1,
    "itself": 4,
    "next": 1,
    "conceiving": 1,
    "re": 9,
    "constructing": 1,
    "tem": 3,
    "taking": 1,
    "tory": 1,
    "accommodating": 1,
    "de": 9,
    "coupling": 1,
    "functionality": 2,
    "focusing": 1,
    "solve": 4,
    "task": 9,
    "hassling": 1,
    "runnels": 1,
    "exhibiting": 1,
    "rex": 6,
    "designed": 6,
    "moves": 2,
    "final": 1,
    "conclusion": 1,
    "abstract": 4,
    "inde": 1,
    "pendent": 1,
    "component": 1,
    "bases": 1,
    "existed": 1,
    "aknowledge": 1,
    "specification": 3,
    "acted": 1,
    "covered": 2,
    "problems": 2,
    "within": 4,
    "figure": 9,
    "takes": 2,
    "cues": 9,
    "inferred": 2,
    "resolution": 1,
    "cer": 1,
    "tain": 1,
    "filtered": 1,
    "decide": 1,
    "avail": 1,
    "selected": 2,
    "mapped": 1,
    "thedomain": 1,
    "screener": 1,
    "spec": 2,
    "common": 2,
    "ground": 1,
    "high": 5,
    "procedural": 1,
    "details": 1,
    "transitions": 4,
    "hypotheses": 5,
    "where": 3,
    "transition": 1,
    "requires": 1,
    "existence": 1,
    "step": 4,
    "enabled": 1,
    "available": 2,
    "thetable": 1,
    "logical": 1,
    "internal": 5,
    "formand": 1,
    "translationpremise": 1,
    "same": 5,
    "cntxt": 4,
    "gram": 3,
    "gramneg": 2,
    "morph": 1,
    "rod": 2,
    "air": 1,
    "anaerobic": 2,
    "action": 2,
    "identity": 2,
    "bacteroides": 1,
    "tally": 1,
    "if": 15,
    "stain": 1,
    "organism": 4,
    "morphology": 1,
    "aerobicity": 1,
    "suggestive": 2,
    "evidence": 4,
    "bacteroidesconfalonieri": 1,
    "speci": 7,
    "fication": 1,
    "among": 1,
    "scripts": 3,
    "frame": 2,
    "tries": 1,
    "planusing": 1,
    "whose": 1,
    "proven": 2,
    "search": 2,
    "plan": 1,
    "carried": 1,
    "backward": 4,
    "until": 1,
    "reaching": 2,
    "empty": 1,
    "state": 2,
    "corresponds": 1,
    "establishes": 1,
    "traverses": 1,
    "edges": 1,
    "found": 1,
    "teller": 2,
    "organizes": 1,
    "consistent": 1,
    "flow": 1,
    "presents": 2,
    "grammar": 1,
    "memory": 8,
    "structure": 7,
    "built": 1,
    "idea": 2,
    "extract": 1,
    "formatted": 1,
    "tree": 1,
    "setting": 10,
    "theme": 1,
    "plot": 1,
    "thestory": 1,
    "converted": 1,
    "textual": 1,
    "description": 4,
    "verbalizer": 2,
    "fills": 1,
    "template": 1,
    "movement": 2,
    "looks": 1,
    "like": 3,
    "considered": 2,
    "trees": 1,
    "tables": 2,
    "the": 2,
    "majority": 3,
    "boxes": 2,
    "given": 3,
    "returnsreasoning": 1,
    "explanationscreener": 1,
    "end": 6,
    "userexpert": 1,
    "solution": 1,
    "left": 4,
    "result": 1,
    "classification": 1,
    "etc": 1,
    "does": 6,
    "reveal": 1,
    "sufficient": 1,
    "resulting": 1,
    "opaque": 1,
    "reason": 2,
    "learningis": 1,
    "formulated": 1,
    "approximates": 1,
    "pos": 1,
    "sible": 1,
    "seeking": 1,
    "techniques": 7,
    "proposed": 8,
    "extraction": 2,
    "counterpart": 1,
    "aims": 3,
    "overall": 2,
    "approximation": 2,
    "tracked": 1,
    "mechanisms": 1,
    "craven": 6,
    "shaolin": 1,
    "frost": 1,
    "hinton": 1,
    "over": 3,
    "outcomes": 1,
    "instances": 3,
    "dataset": 5,
    "works": 3,
    "vary": 1,
    "greatly": 2,
    "rodin": 1,
    "shah": 1,
    "b": 4,
    "introspective": 2,
    "relating": 1,
    "inputs": 1,
    "outputs": 3,
    "saliency": 2,
    "masks": 1,
    "network": 20,
    "image": 12,
    "convolutional": 4,
    "networks": 31,
    "cnns": 4,
    "hendricks": 3,
    "park": 6,
    "wigand": 1,
    "orgroups": 1,
    "output": 2,
    "tokens": 3,
    "causally": 1,
    "alvarez": 2,
    "melisa": 1,
    "jackova": 1,
    "following": 3,
    "pdps": 4,
    "partial": 1,
    "dependence": 1,
    "plots": 5,
    "lime": 5,
    "agnostic": 5,
    "shap": 1,
    "shapley": 1,
    "additive": 1,
    "lundberg": 1,
    "lee": 2,
    "dedicate": 1,
    "watcher": 1,
    "mittelstadt": 7,
    "russell": 1,
    "extracting": 1,
    "via": 6,
    "automatically": 1,
    "generate": 2,
    "representa": 1,
    "features": 3,
    "trained": 2,
    "strategy": 2,
    "represent": 1,
    "directly": 1,
    "inter": 7,
    "pretable": 1,
    "shavlik": 8,
    "frosst": 2,
    "odense": 2,
    "zhou": 2,
    "jiang": 1,
    "feature": 4,
    "importance": 5,
    "vectors": 1,
    "lou": 4,
    "caruana": 4,
    "gehrke": 4,
    "hooker": 2,
    "noninterpretable": 1,
    "in": 7,
    "previous": 1,
    "net": 4,
    "towell": 3,
    "friedman": 4,
    "compute": 4,
    "effect": 1,
    "variables": 3,
    "predicted": 1,
    "outcome": 6,
    "linear": 7,
    "regression": 3,
    "pdp": 3,
    "marginalizing": 1,
    "so": 2,
    "function": 7,
    "shows": 3,
    "onewants": 1,
    "generates": 2,
    "uncorrelated": 1,
    "accumulated": 2,
    "conditional": 1,
    "marginal": 1,
    "distribu": 1,
    "apley": 3,
    "zhu": 1,
    "individual": 11,
    "predictions": 16,
    "approximated": 1,
    "generating": 2,
    "surrogate": 4,
    "intrinsically": 1,
    "implemented": 1,
    "exploits": 1,
    "queried": 1,
    "times": 2,
    "perturbing": 1,
    "training": 8,
    "new": 8,
    "feeding": 1,
    "perturbedconfalonieri": 1,
    "creates": 1,
    "weighted": 1,
    "proximity": 3,
    "perturbed": 1,
    "ones": 2,
    "creating": 2,
    "low": 6,
    "num": 1,
    "ber": 1,
    "keep": 5,
    "complexity": 3,
    "variable": 1,
    "explained": 1,
    "however": 7,
    "sampling": 1,
    "method": 9,
    "train": 4,
    "situations": 2,
    "spaces": 1,
    "dimensional": 15,
    "boundaries": 1,
    "scenarios": 1,
    "fea": 1,
    "tures": 1,
    "detriment": 1,
    "extension": 3,
    "called": 1,
    "anchor": 1,
    "perturbation": 13,
    "space": 1,
    "constructs": 1,
    "adapting": 1,
    "coverage": 1,
    "regard": 1,
    "boundary": 2,
    "faithfulness": 1,
    "alterations": 1,
    "smallest": 2,
    "ale": 2,
    "showing": 1,
    "temperature": 1,
    "humidity": 3,
    "wind": 12,
    "speed": 3,
    "affect": 1,
    "number": 4,
    "rented": 1,
    "bicycles": 1,
    "day": 1,
    "molnar": 2,
    "due": 1,
    "correlationbetween": 1,
    "smaller": 1,
    "decrease": 3,
    "bikes": 1,
    "cannot": 2,
    "trusted": 1,
    "boston": 1,
    "harrison": 10,
    "rubinfeld": 2,
    "contains": 1,
    "collected": 3,
    "census": 1,
    "service": 1,
    "housing": 2,
    "area": 4,
    "massachusetts": 1,
    "median": 5,
    "value": 1,
    "owner": 1,
    "occupied": 1,
    "homes": 1,
    "rm": 1,
    "averagenumber": 1,
    "rooms": 1,
    "per": 2,
    "dwelling": 1,
    "tax": 2,
    "full": 3,
    "rate": 56,
    "nox": 1,
    "nitric": 1,
    "oxides": 1,
    "concentration": 2,
    "lstat": 1,
    "lower": 4,
    "population": 1,
    "ptratio": 1,
    "pupil": 1,
    "teacher": 2,
    "ratio": 1,
    "town": 1,
    "appreciatedo": 1,
    "world": 2,
    "captured": 1,
    "wachter": 6,
    "you": 2,
    "denied": 2,
    "loan": 1,
    "because": 2,
    "your": 1,
    "annual": 1,
    "income": 3,
    "would": 4,
    "offered": 1,
    "scenario": 1,
    "borrower": 1,
    "receives": 1,
    "regarding": 1,
    "informed": 1,
    "she": 1,
    "counterfactuals": 6,
    "changeable": 1,
    "person": 3,
    "gender": 1,
    "race": 1,
    "birth": 1,
    "place": 2,
    "hence": 1,
    "becomes": 1,
    "actionable": 4,
    "concretely": 1,
    "done": 4,
    "meet": 1,
    "four": 2,
    "obeying": 1,
    "sparsity": 1,
    "presenting": 1,
    "diversified": 2,
    "actions": 1,
    "shed": 1,
    "light": 2,
    "changes": 1,
    "unlike": 1,
    "approximating": 1,
    "classifier": 5,
    "advantage": 3,
    "always": 1,
    "truthful": 1,
    "direct": 11,
    "algorithm": 1,
    "prove": 1,
    "particularly": 2,
    "andthe": 2,
    "soon": 1,
    "diversity": 1,
    "acknowledged": 1,
    "who": 1,
    "correspondingly": 1,
    "amethod": 1,
    "diverse": 1,
    "dice": 3,
    "seen": 3,
    "variety": 11,
    "engines": 1,
    "customized": 2,
    "recommenda": 1,
    "collaborative": 7,
    "filtering": 4,
    "include": 2,
    "matrix": 1,
    "factorisation": 4,
    "mf": 2,
    "koren": 2,
    "bell": 2,
    "volinsky": 2,
    "variants": 1,
    "singular": 1,
    "decomposition": 3,
    "svd": 1,
    "nati": 2,
    "jaakkola": 3,
    "ornonnegative": 1,
    "nmf": 1,
    "seung": 2,
    "nearest": 2,
    "neighbors": 1,
    "embeddings": 1,
    "wang": 2,
    "feng": 1,
    "nie": 3,
    "chua": 3,
    "zhang": 2,
    "considerable": 1,
    "years": 3,
    "answer": 3,
    "served": 2,
    "many": 12,
    "bythe": 1,
    "contextual": 1,
    "loca": 1,
    "time": 2,
    "predict": 4,
    "above": 3,
    "eight": 5,
    "age": 1,
    "class": 5,
    "represents": 1,
    "wherethe": 1,
    "computed": 1,
    "negative": 3,
    "examplesconfalonieri": 1,
    "broadly": 1,
    "classified": 1,
    "categories": 1,
    "tackle": 1,
    "aiming": 1,
    "explaining": 26,
    "proposes": 1,
    "particu": 1,
    "lar": 1,
    "analyze": 1,
    "recommendations": 1,
    "subsections": 3,
    "brief": 1,
    "current": 3,
    "art": 2,
    "forms": 1,
    "persuasiveness": 1,
    "platforms": 2,
    "widespread": 1,
    "latent": 1,
    "items": 1,
    "highest": 1,
    "chance": 1,
    "interacted": 2,
    "rating": 7,
    "arise": 1,
    "trying": 1,
    "factors": 2,
    "contribute": 1,
    "exact": 2,
    "meaning": 2,
    "unknown": 1,
    "therefore": 2,
    "ests": 1,
    "explicit": 1,
    "efm": 1,
    "pro": 2,
    "vided": 1,
    "feedback": 2,
    "map": 1,
    "tensor": 1,
    "factorization": 4,
    "ofefm": 1,
    "cube": 1,
    "ratings": 2,
    "embedded": 1,
    "qin": 1,
    "xu": 1,
    "implicit": 1,
    "neighborhood": 3,
    "comes": 3,
    "thestyle": 1,
    "similar": 2,
    "viewed": 1,
    "thanks": 1,
    "regularizer": 1,
    "forces": 1,
    "close": 1,
    "external": 1,
    "personalized": 3,
    "rec": 5,
    "ommender": 2,
    "catherine": 2,
    "mazaitis": 2,
    "esknazi": 2,
    "cohen": 1,
    "graphs": 7,
    "relate": 1,
    "paths": 2,
    "nect": 1,
    "graph": 2,
    "links": 1,
    "views": 1,
    "purchases": 1,
    "orcategory": 1,
    "blocks": 1,
    "note": 3,
    "theory": 7,
    "insights": 5,
    "behave": 1,
    "interests": 1,
    "heckel": 2,
    "vlachos": 2,
    "coclustering": 1,
    "theirinterests": 1,
    "bipartite": 1,
    "retrieved": 1,
    "shared": 1,
    "considering": 2,
    "core": 10,
    "engine": 1,
    "consider": 1,
    "probed": 1,
    "statistical": 1,
    "peake": 2,
    "highlight": 1,
    "percentage": 2,
    "behaved": 1,
    "similarly": 1,
    "confidence": 2,
    "recom": 1,
    "mendation": 1,
    "besides": 1,
    "version": 2,
    "recommenderengine": 1,
    "association": 1,
    "similarity": 2,
    "preserve": 1,
    "intrinsi": 1,
    "cally": 5,
    "anand": 2,
    "surge": 1,
    "deployed": 1,
    "seo": 1,
    "huang": 2,
    "yang": 7,
    "liu": 10,
    "recurrent": 4,
    "long": 2,
    "short": 1,
    "term": 26,
    "rnn": 2,
    "lstm": 39,
    "hidasi": 2,
    "karatzoglou": 2,
    "implement": 1,
    "strategies": 3,
    "sequential": 1,
    "lstms": 2,
    "aware": 1,
    "ommendations": 2,
    "words": 9,
    "algorithms": 3,
    "natural": 14,
    "generation": 7,
    "visual": 7,
    "interest": 6,
    "styles": 9,
    "herlocker": 2,
    "konstan": 4,
    "riedl": 4,
    "histograms": 1,
    "preferred": 1,
    "rendering": 1,
    "supporting": 1,
    "results": 1,
    "studies": 1,
    "ever": 1,
    "bilgic": 4,
    "mooney": 4,
    "cosley": 2,
    "lam": 2,
    "albert": 2,
    "study": 2,
    "histo": 1,
    "paradigm": 1,
    "specifically": 1,
    "mean": 2,
    "kouki": 2,
    "schaffer": 2,
    "pujara": 2,
    "donovan": 2,
    "getoor": 2,
    "friedrich": 2,
    "zanker": 6,
    "taxonomy": 1,
    "classify": 1,
    "justify": 1,
    "amount": 1,
    "concrete": 2,
    "derive": 1,
    "determined": 1,
    "preference": 3,
    "expressions": 1,
    "dur": 1,
    "papadimitriou": 2,
    "symeonidis": 8,
    "manolopoulos": 2,
    "extends": 2,
    "classifica": 1,
    "distinction": 1,
    "areusers": 1,
    "denote": 1,
    "style": 1,
    "choices": 1,
    "explains": 3,
    "content": 4,
    "please": 1,
    "combination": 1,
    "aforementioned": 1,
    "multi": 4,
    "amazon": 1,
    "stores": 1,
    "adopted": 7,
    "justification": 1,
    "customers": 1,
    "bought": 3,
    "xalso": 1,
    "performing": 1,
    "buying": 1,
    "justifications": 1,
    "yis": 1,
    "ommended": 1,
    "highly": 1,
    "rated": 1,
    "depicts": 1,
    "influenced": 1,
    "claimed": 1,
    "preferable": 1,
    "formulate": 1,
    "true": 1,
    "opinion": 3,
    "exploited": 2,
    "observed": 1,
    "restaurants": 3,
    "may": 16,
    "described": 1,
    "location": 1,
    "cuisine": 3,
    "cost": 1,
    "demonstrated": 1,
    "chinese": 3,
    "tested": 1,
    "later": 2,
    "perception": 5,
    "relates": 2,
    "personality": 1,
    "further": 3,
    "personalize": 2,
    "symb": 1,
    "olic": 1,
    "seeks": 2,
    "integrate": 2,
    "principles": 1,
    "rea": 1,
    "soning": 2,
    "painted": 1,
    "irreconcil": 1,
    "paradigms": 1,
    "differences": 1,
    "actually": 5,
    "subtle": 1,
    "than": 6,
    "presumed": 1,
    "operate": 2,
    "performed": 3,
    "discrete": 1,
    "entities": 1,
    "follow": 2,
    "everyday": 1,
    "lives": 3,
    "neighbours": 1,
    "visualizing": 12,
    "power": 2,
    "target": 1,
    "better": 3,
    "individ": 1,
    "ual": 1,
    "neurons": 4,
    "necessarily": 1,
    "readily": 2,
    "recognizable": 1,
    "concept": 4,
    "theyoften": 1,
    "regularities": 1,
    "imbuing": 1,
    "capabil": 1,
    "ities": 1,
    "allowing": 1,
    "perform": 1,
    "discussed": 2,
    "bader": 2,
    "integration": 1,
    "bridge": 2,
    "frequentlyencountered": 1,
    "pattern": 6,
    "recognition": 5,
    "achieving": 1,
    "promises": 1,
    "benefits": 1,
    "reusable": 1,
    "having": 1,
    "pressing": 1,
    "practices": 1,
    "sample": 1,
    "putationally": 1,
    "demanding": 1,
    "heavy": 2,
    "difficult": 3,
    "aspect": 1,
    "generalize": 3,
    "foundation": 1,
    "fortransfer": 1,
    "overcome": 1,
    "limitations": 2,
    "last": 2,
    "importantly": 1,
    "lack": 3,
    "humanly": 1,
    "muggleton": 2,
    "schmid": 1,
    "zeller": 2,
    "tamaddoni": 2,
    "nezhad": 2,
    "cycle": 1,
    "illustrates": 1,
    "side": 1,
    "writable": 1,
    "readable": 1,
    "capable": 2,
    "iterative": 1,
    "sides": 1,
    "embedding": 1,
    "sym": 1,
    "bolic": 1,
    "learned": 18,
    "refined": 2,
    "knowledgefrom": 1,
    "drive": 1,
    "modification": 2,
    "fine": 1,
    "tuning": 6,
    "stenning": 2,
    "already": 2,
    "hints": 1,
    "pillars": 1,
    "mapping": 1,
    "integrated": 2,
    "symbolism": 1,
    "connectionism": 1,
    "divided": 1,
    "formula": 1,
    "previously": 1,
    "efforts": 1,
    "integrating": 2,
    "immediate": 1,
    "inductivelogic": 1,
    "programming": 4,
    "ilp": 2,
    "develops": 1,
    "program": 2,
    "frana": 2,
    "zaverucha": 3,
    "beneficial": 1,
    "improving": 1,
    "garnelo": 2,
    "shanahan": 2,
    "networkmodule": 1,
    "top": 5,
    "regular": 2,
    "relations": 1,
    "innerabstractions": 1,
    "guiding": 1,
    "successful": 1,
    "phase": 2,
    "complementing": 1,
    "lingua": 1,
    "franca": 1,
    "sarker": 2,
    "xie": 2,
    "raymer": 2,
    "propose": 1,
    "interactive": 8,
    "enables": 1,
    "illustration": 1,
    "monitoring": 5,
    "classifiers": 3,
    "act": 1,
    "increas": 1,
    "ingly": 1,
    "ability": 4,
    "againstthat": 1,
    "backdrop": 1,
    "vital": 1,
    "enablers": 1,
    "intelligible": 3,
    "futia": 2,
    "vetr": 2,
    "targeted": 1,
    "nonexperts": 1,
    "querying": 1,
    "staying": 1,
    "optimize": 1,
    "test": 2,
    "sets": 1,
    "replicate": 2,
    "theoriginal": 1,
    "dimensions": 1,
    "consumer": 3,
    "precisely": 1,
    "representing": 1,
    "easy": 1,
    "trade": 1,
    "off": 2,
    "consis": 1,
    "tency": 1,
    "revise": 2,
    "consolidate": 2,
    "background": 5,
    "semantics": 2,
    "theexplanations": 1,
    "facilitating": 2,
    "injected": 2,
    "ziegler": 2,
    "returning": 1,
    "decom": 1,
    "positional": 1,
    "pedagogical": 3,
    "falling": 1,
    "weights": 1,
    "approximate": 2,
    "unit": 22,
    "aggregated": 2,
    "composite": 1,
    "whole": 1,
    "layersof": 1,
    "intellectual": 1,
    "considerations": 1,
    "want": 1,
    "belonging": 1,
    "limitation": 1,
    "treat": 1,
    "oracle": 5,
    "pairings": 1,
    "prime": 1,
    "trepan": 11,
    "induction": 2,
    "recursively": 1,
    "extracts": 3,
    "originally": 1,
    "intended": 1,
    "feed": 1,
    "forward": 15,
    "treated": 1,
    "ageneric": 1,
    "principle": 1,
    "id": 2,
    "murphy": 1,
    "pazzani": 2,
    "mout": 1,
    "ofnspecified": 1,
    "send": 1,
    "down": 2,
    "branch": 1,
    "tests": 1,
    "greedy": 1,
    "starts": 1,
    "single": 6,
    "maximizes": 1,
    "iteratively": 1,
    "adds": 1,
    "longer": 9,
    "improved": 1,
    "doing": 1,
    "combines": 1,
    "ofusing": 1,
    "targeting": 1,
    "layer": 6,
    "perceptrons": 1,
    "mlps": 2,
    "splitting": 1,
    "labels": 2,
    "real": 2,
    "mlp": 1,
    "servestwo": 1,
    "helps": 3,
    "avoid": 1,
    "overfitting": 1,
    "outliers": 1,
    "arbitrarily": 1,
    "degree": 1,
    "without": 3,
    "architecture": 2,
    "units": 1,
    "assessing": 1,
    "theextracted": 1,
    "syntactic": 1,
    "huysmans": 3,
    "piltaver": 2,
    "lu": 1,
    "trek": 2,
    "gams": 2,
    "martinc": 2,
    "cc": 2,
    "ip": 1,
    "weyde": 3,
    "showed": 2,
    "beenhanced": 1,
    "ontologies": 4,
    "categorization": 1,
    "relies": 1,
    "realizations": 1,
    "applied": 3,
    "aid": 1,
    "operative": 1,
    "knowledgeacquisition": 1,
    "effort": 1,
    "formally": 1,
    "formalization": 1,
    "develop": 3,
    "consisted": 1,
    "decoupledfrom": 1,
    "inexpert": 1,
    "aimed": 2,
    "modeling": 5,
    "nonetheless": 2,
    "acquiring": 1,
    "plex": 1,
    "subject": 2,
    "interpretation": 2,
    "modeler": 1,
    "decides": 1,
    "capture": 1,
    "alleviate": 2,
    "acquisition": 1,
    "identifying": 3,
    "patterns": 7,
    "happens": 1,
    "price": 13,
    "modelthat": 1,
    "seek": 1,
    "maximize": 1,
    "clearly": 5,
    "compete": 1,
    "reasonable": 1,
    "equation": 2,
    "appropriate": 1,
    "scientist": 1,
    "prefers": 1,
    "possibly": 1,
    "lessaccurate": 1,
    "nowadays": 4,
    "powerful": 2,
    "enough": 1,
    "guarantees": 1,
    "truthfulness": 1,
    "closeness": 1,
    "lacking": 1,
    "reliable": 2,
    "ofexpressing": 1,
    "uncertainty": 1,
    "supposed": 1,
    "satisfactory": 1,
    "proxy": 1,
    "metric": 2,
    "capacity": 1,
    "predicting": 1,
    "diabetes": 2,
    "risk": 1,
    "thepima": 1,
    "indians": 1,
    "smith": 6,
    "everhart": 2,
    "dickson": 2,
    "knowler": 2,
    "johannes": 2,
    "semantically": 1,
    "solely": 1,
    "optimizing": 1,
    "resemblance": 1,
    "overlooked": 1,
    "bhatt": 2,
    "deployments": 1,
    "debug": 1,
    "practice": 6,
    "thereis": 1,
    "gap": 5,
    "primarily": 1,
    "stake": 2,
    "holders": 2,
    "adapt": 1,
    "ribera": 2,
    "lapedriza": 2,
    "trustworthy": 1,
    "fordifferent": 1,
    "centered": 2,
    "guidelines": 1,
    "responsible": 2,
    "establishing": 1,
    "fairness": 2,
    "accountability": 3,
    "privacy": 3,
    "especiallyrelated": 1,
    "fusion": 3,
    "environments": 1,
    "dis": 2,
    "cussed": 1,
    "standing": 1,
    "definition": 1,
    "explanationsappears": 1,
    "challenging": 2,
    "clude": 1,
    "our": 4,
    "pointing": 1,
    "ment": 1,
    "putting": 1,
    "heart": 52,
    "entire": 2,
    "enterprise": 1,
    "knowing": 1,
    "foster": 6,
    "largely": 2,
    "exceptions": 1,
    "chattopadhyay": 2,
    "manupriya": 2,
    "sarkar": 2,
    "balasubramanian": 2,
    "statements": 1,
    "se": 1,
    "humanmodel": 1,
    "measuring": 1,
    "statement": 1,
    "causalmodel": 1,
    "reviewed": 4,
    "empirical": 1,
    "indicates": 3,
    "psychologically": 1,
    "contras": 1,
    "tive": 1,
    "ask": 2,
    "phappened": 1,
    "phap": 1,
    "pened": 1,
    "contrastive": 1,
    "preliminary": 2,
    "steps": 40,
    "direction": 1,
    "designing": 2,
    "transfer": 1,
    "recipient": 5,
    "involving": 1,
    "explainers": 1,
    "explainees": 1,
    "dialogue": 1,
    "conversational": 2,
    "argumentative": 1,
    "processes": 1,
    "inspection": 1,
    "trustin": 1,
    "epistemi": 1,
    "informational": 1,
    "sbackground": 1,
    "expect": 2,
    "cause": 1,
    "depends": 2,
    "doctor": 1,
    "pre": 1,
    "sumably": 1,
    "necessary": 2,
    "sometimes": 2,
    "generat": 1,
    "address": 2,
    "concerns": 2,
    "differentially": 2,
    "private": 2,
    "harder": 2,
    "bauer": 1,
    "symbolically": 1,
    "grounded": 1,
    "conceptual": 3,
    "formal": 1,
    "turn": 1,
    "enact": 1,
    "manipulation": 2,
    "galliani": 3,
    "keet": 2,
    "troquard": 3,
    "canplay": 1,
    "wants": 1,
    "matching": 1,
    "dif": 1,
    "ferent": 1,
    "stakeholder": 1,
    "performances": 1,
    "burnett": 3,
    "wong": 1,
    "stumpf": 3,
    "cares": 1,
    "success": 1,
    "ful": 4,
    "communication": 1,
    "esta": 1,
    "blishing": 1,
    "inherent": 1,
    "log": 4,
    "ic": 1,
    "reasonabl": 1,
    "facilitated": 1,
    "modularity": 1,
    "integrates": 1,
    "symbo": 1,
    "lic": 1,
    "sy": 1,
    "mbolic": 1,
    "advance": 1,
    "ments": 1,
    "demonstrate": 1,
    "robust": 3,
    "oe": 1,
    "es": 3,
    "eu": 1,
    "ft": 1,
    "em": 2,
    "integra": 1,
    "repres": 1,
    "entations": 1,
    "review": 1,
    "describing": 1,
    "thereof": 1,
    "evaluate": 8,
    "tains": 1,
    "navigate": 1,
    "analyzed": 3,
    "unable": 1,
    "drawn": 2,
    "forexplanations": 1,
    "centric": 2,
    "acknowledgments": 1,
    "thank": 2,
    "daniel": 1,
    "malagarriga": 1,
    "valuable": 1,
    "discussions": 1,
    "topics": 2,
    "asignificant": 1,
    "alpha": 1,
    "health": 4,
    "telefnica": 1,
    "innovacin": 1,
    "barcelona": 1,
    "spain": 2,
    "department": 1,
    "innovation": 1,
    "province": 1,
    "covering": 1,
    "publication": 1,
    "costs": 1,
    "conflict": 2,
    "declared": 1,
    "author": 1,
    "conceptualization": 2,
    "investigation": 1,
    "project": 1,
    "administration": 2,
    "writing": 7,
    "draft": 1,
    "editing": 4,
    "richard": 1,
    "orcid": 2,
    "endnotes": 1,
    "consumers": 1,
    "reached": 2,
    "allowance": 1,
    "bank": 1,
    "mendations": 1,
    "floridi": 2,
    "persons": 1,
    "personal": 1,
    "repealing": 1,
    "directive": 1,
    "ec": 1,
    "oj": 1,
    "l": 4,
    "tomichie": 1,
    "weak": 1,
    "strong": 2,
    "ultra": 2,
    "michie": 2,
    "operationalcriteria": 1,
    "qualities": 1,
    "comprehensi": 1,
    "bility": 1,
    "criterion": 2,
    "learner": 2,
    "produces": 2,
    "additionally": 2,
    "requir": 1,
    "teach": 1,
    "increased": 1,
    "beyond": 6,
    "studying": 1,
    "alone": 1,
    "dejaeger": 2,
    "mues": 2,
    "vanthienen": 2,
    "baesens": 2,
    "closer": 1,
    "globalexplanation": 1,
    "relegated": 1,
    "novelty": 3,
    "serendipitous": 1,
    "others": 1,
    "clarke": 2,
    "vargas": 2,
    "castells": 2,
    "medicine": 1,
    "melis": 1,
    "framework": 5,
    "corr": 1,
    "abs": 4,
    "critique": 1,
    "effects": 2,
    "supervised": 2,
    "rodr": 1,
    "iguez": 1,
    "ser": 1,
    "bennetot": 1,
    "tabik": 1,
    "barbado": 1,
    "taxonomies": 1,
    "opportunities": 1,
    "toward": 5,
    "inffus": 1,
    "quality": 13,
    "conflicting": 1,
    "proceedings": 1,
    "rd": 1,
    "international": 14,
    "acm": 2,
    "sigir": 4,
    "conference": 22,
    "retrieval": 4,
    "van": 3,
    "der": 1,
    "torre": 1,
    "lambalgen": 1,
    "non": 7,
    "probabilistic": 9,
    "computing": 3,
    "minds": 1,
    "machines": 1,
    "bowman": 3,
    "domingos": 1,
    "xiang": 1,
    "weller": 1,
    "taly": 1,
    "jia": 1,
    "eckersley": 1,
    "proceed": 1,
    "ings": 1,
    "pp": 34,
    "machinery": 4,
    "york": 2,
    "ny": 3,
    "vs": 1,
    "promotion": 1,
    "personalization": 2,
    "workshop": 3,
    "stage": 1,
    "interfaces": 1,
    "experiments": 3,
    "stanford": 2,
    "heuristic": 3,
    "addison": 1,
    "wesley": 1,
    "longman": 1,
    "publishing": 1,
    "co": 3,
    "inc": 2,
    "entity": 1,
    "ceedings": 2,
    "poster": 1,
    "track": 1,
    "th": 12,
    "recsys": 3,
    "attributions": 1,
    "chaudhuri": 1,
    "salakhutdinov": 2,
    "eds": 1,
    "vol": 2,
    "beach": 1,
    "ca": 1,
    "pmlr": 1,
    "http": 16,
    "mlr": 1,
    "press": 2,
    "v": 1,
    "chattopadhyaya": 1,
    "html": 1,
    "agents": 1,
    "web": 5,
    "nd": 4,
    "business": 4,
    "telecommunication": 1,
    "rank": 1,
    "kolla": 1,
    "cormack": 1,
    "vechtomova": 1,
    "ashkan": 1,
    "bttcher": 1,
    "mackinnon": 1,
    "infor": 2,
    "mation": 2,
    "evaluation": 8,
    "st": 2,
    "differ": 2,
    "presence": 3,
    "iui": 3,
    "personalised": 1,
    "engineering": 1,
    "ofcollaborative": 1,
    "ieee": 8,
    "ference": 1,
    "informatics": 1,
    "cbi": 2,
    "arxiv": 27,
    "creel": 1,
    "shafto": 1,
    "cog": 2,
    "nitive": 1,
    "goel": 1,
    "seifert": 1,
    "freksa": 1,
    "meeting": 1,
    "society": 1,
    "cogsci": 2,
    "creativity": 1,
    "computation": 1,
    "montreal": 1,
    "canada": 1,
    "nitivesciencesociety": 1,
    "mindmodeling": 1,
    "papers": 4,
    "index": 2,
    "upward": 1,
    "operators": 1,
    "blending": 1,
    "el": 1,
    "annals": 3,
    "mathematics": 2,
    "porello": 2,
    "righetti": 1,
    "towards": 17,
    "even": 11,
    "irresistible": 1,
    "axiom": 2,
    "weakening": 2,
    "borgwardt": 1,
    "meyer": 1,
    "logics": 2,
    "dl": 2,
    "colocated": 4,
    "theth": 1,
    "kr": 1,
    "rhodes": 1,
    "greece": 1,
    "ceur": 6,
    "ws": 4,
    "paper": 4,
    "pdf": 2,
    "prado": 1,
    "martn": 1,
    "reloaded": 1,
    "driven": 1,
    "ios": 1,
    "faia": 1,
    "believing": 1,
    "opin": 1,
    "ions": 2,
    "chi": 2,
    "cambridge": 2,
    "ma": 1,
    "mit": 2,
    "really": 1,
    "ml": 4,
    "ia": 3,
    "rigorous": 1,
    "report": 1,
    "dub": 1,
    "lin": 1,
    "trinity": 1,
    "college": 1,
    "dublin": 1,
    "evolutionary": 1,
    "fuzzy": 1,
    "computational": 6,
    "magazine": 1,
    "mci": 1,
    "relational": 1,
    "bottom": 1,
    "clause": 1,
    "propositionalization": 1,
    "gradient": 10,
    "boosting": 3,
    "statistics": 1,
    "aaai": 1,
    "ojs": 2,
    "php": 3,
    "aimagazine": 1,
    "aimag": 1,
    "vi": 2,
    "distilling": 1,
    "soft": 1,
    "italian": 2,
    "arti": 20,
    "ficial": 1,
    "chal": 1,
    "lenges": 1,
    "info": 2,
    "raedt": 1,
    "foldiak": 1,
    "icard": 1,
    "silver": 3,
    "spring": 1,
    "symposium": 1,
    "gori": 1,
    "lamb": 1,
    "serafini": 1,
    "spranger": 1,
    "tran": 2,
    "methodology": 2,
    "principled": 1,
    "reconciling": 1,
    "objects": 2,
    "cur": 1,
    "rent": 1,
    "behavioral": 1,
    "monreale": 1,
    "ruggieri": 1,
    "turini": 1,
    "giannotti": 1,
    "pedreschi": 1,
    "surveys": 1,
    "thirty": 3,
    "fourth": 1,
    "innovative": 1,
    "iaai": 1,
    "tenth": 1,
    "aaaisymposium": 1,
    "advances": 3,
    "eaai": 1,
    "hedonic": 1,
    "prices": 3,
    "demand": 7,
    "clean": 1,
    "journal": 5,
    "environmental": 4,
    "economics": 4,
    "man": 1,
    "agement": 1,
    "hasling": 1,
    "rennels": 1,
    "strategic": 1,
    "liao": 1,
    "hu": 3,
    "confer": 1,
    "ence": 1,
    "overlapping": 1,
    "clusters": 1,
    "akata": 2,
    "rohrbach": 2,
    "donahue": 1,
    "schiele": 2,
    "darrell": 2,
    "leibe": 1,
    "matas": 1,
    "sebe": 1,
    "welling": 1,
    "vision": 12,
    "eccv": 2,
    "cham": 2,
    "springer": 12,
    "supported": 2,
    "cooperative": 1,
    "cscw": 1,
    "gains": 1,
    "session": 2,
    "management": 1,
    "psychological": 1,
    "bulletin": 1,
    "prospects": 1,
    "brain": 5,
    "www": 1,
    "scale": 2,
    "scs": 1,
    "kiknstliche": 1,
    "intelligenz": 1,
    "german": 2,
    "denk": 1,
    "zatloukal": 1,
    "kickmeier": 1,
    "rust": 2,
    "cris": 1,
    "pintea": 1,
    "palade": 1,
    "experimental": 1,
    "algorithmic": 2,
    "enhancing": 3,
    "comprehension": 1,
    "abstractions": 1,
    "congress": 1,
    "rudin": 1,
    "bayesian": 2,
    "generative": 1,
    "prototype": 1,
    "preferences": 2,
    "eleventh": 2,
    "kwan": 1,
    "little": 5,
    "just": 1,
    "languages": 1,
    "nonnegative": 1,
    "mythos": 1,
    "queue": 1,
    "shape": 1,
    "trends": 1,
    "kdd": 1,
    "pairwise": 2,
    "sigkdd": 1,
    "unified": 1,
    "interpreting": 11,
    "guyon": 2,
    "red": 1,
    "hook": 1,
    "curran": 1,
    "associates": 1,
    "five": 1,
    "working": 1,
    "marshfield": 1,
    "pitman": 1,
    "sciencedirect": 1,
    "pii": 1,
    "artint": 1,
    "generalization": 5,
    "unifying": 2,
    "dx": 1,
    "christophm": 1,
    "github": 5,
    "io": 2,
    "book": 2,
    "fat": 2,
    "meta": 7,
    "synopsis": 1,
    "ideas": 1,
    "publications": 1,
    "bibliography": 1,
    "programs": 1,
    "constructive": 1,
    "discriminators": 1,
    "approximations": 1,
    "website": 1,
    "electronic": 2,
    "commerce": 1,
    "systematic": 1,
    "adapted": 2,
    "ls": 1,
    "cs": 2,
    "tu": 1,
    "dortmund": 1,
    "homepage": 1,
    "umuai": 1,
    "restricted": 1,
    "boltzmann": 1,
    "lintas": 1,
    "rovetta": 1,
    "verschure": 1,
    "villa": 1,
    "icann": 1,
    "genralized": 1,
    "mender": 1,
    "fs": 1,
    "attentive": 1,
    "justifying": 1,
    "appli": 1,
    "cations": 2,
    "anchors": 1,
    "precision": 2,
    "orleans": 2,
    "louisiana": 2,
    "proposal": 1,
    "joint": 3,
    "workshops": 1,
    "coherent": 1,
    "samek": 29,
    "montavon": 15,
    "vedaldi": 3,
    "hansen": 2,
    "basel": 1,
    "switzerland": 1,
    "dual": 1,
    "posthoc": 1,
    "secondary": 1,
    "adap": 1,
    "forecast": 25,
    "onset": 2,
    "mellitus": 1,
    "care": 1,
    "handbook": 1,
    "pealoza": 1,
    "repairing": 1,
    "ns": 4,
    "mcilraith": 1,
    "weinberger": 1,
    "ocs": 1,
    "relevance": 7,
    "fifth": 1,
    "exist": 3,
    "law": 3,
    "idpl": 1,
    "ipx": 1,
    "opening": 1,
    "harvard": 1,
    "enhanced": 1,
    "march": 1,
    "reconstructive": 1,
    "incorporating": 3,
    "phrase": 1,
    "sentiment": 2,
    "analysis": 11,
    "eighth": 1,
    "ensembles": 2,
    "communications": 2,
    "caelen": 1,
    "garchery": 1,
    "granitzer": 1,
    "guelton": 1,
    "jurgovsky": 1,
    "zwicklbauer": 1,
    "injecting": 1,
    "enabling": 1,
    "infra": 1,
    "enterprises": 1,
    "wetice": 1,
    "cite": 1,
    "tr": 1,
    "timely": 1,
    "failure": 1,
    "gateway": 1,
    "treatment": 1,
    "life": 1,
    "prognosis": 2,
    "almost": 7,
    "receive": 3,
    "initial": 1,
    "emergency": 1,
    "admission": 1,
    "hospital": 2,
    "distressing": 1,
    "families": 2,
    "costly": 1,
    "nhs": 2,
    "denotes": 1,
    "progression": 1,
    "disease": 1,
    "british": 5,
    "earlier": 2,
    "prioritised": 2,
    "primary": 1,
    "burden": 1,
    "around": 1,
    "million": 3,
    "england": 1,
    "living": 1,
    "nearly": 1,
    "newly": 1,
    "diagnosed": 2,
    "year": 2,
    "experience": 1,
    "breathlessness": 4,
    "fatigue": 1,
    "leg": 1,
    "swelling": 3,
    "impair": 1,
    "outlook": 1,
    "worse": 3,
    "cancers": 2,
    "survival": 3,
    "rates": 1,
    "substantially": 1,
    "spends": 1,
    "billion": 1,
    "incurred": 1,
    "attendance": 1,
    "prolonged": 1,
    "stay": 1,
