{
    "overview": 16,
    "historical": 1,
    "perspective": 11,
    "explainable": 75,
    "artificial": 1,
    "intelligence": 56,
    "roberto": 5,
    "confalonieri": 32,
    "ludovik": 2,
    "coba": 11,
    "benedikt": 2,
    "wagner": 1,
    "tarek": 3,
    "besold": 1,
    "faculty": 2,
    "computer": 33,
    "science": 22,
    "free": 1,
    "university": 8,
    "bozen": 4,
    "bolzano": 5,
    "italy": 1,
    "research": 45,
    "centre": 1,
    "machine": 69,
    "learning": 180,
    "city": 4,
    "london": 1,
    "uk": 4,
    "neurocat": 1,
    "gmbh": 1,
    "berlin": 7,
    "germany": 1,
    "correspondence": 1,
    "ofcomputer": 1,
    "ofbozen": 1,
    "dominikanerplatz": 1,
    "email": 1,
    "unibz": 1,
    "itabstract": 1,
    "explainability": 147,
    "ai": 173,
    "been": 60,
    "revived": 1,
    "topic": 2,
    "ofactive": 1,
    "by": 265,
    "need": 21,
    "conveying": 1,
    "safety": 9,
    "trust": 12,
    "users": 26,
    "howand": 1,
    "whyof": 1,
    "automated": 3,
    "decision": 78,
    "making": 20,
    "different": 77,
    "applications": 29,
    "such": 65,
    "autonomous": 7,
    "driving": 2,
    "medical": 8,
    "diagnosis": 2,
    "or": 114,
    "banking": 1,
    "finance": 6,
    "while": 24,
    "recently": 6,
    "received": 3,
    "significant": 3,
    "attention": 26,
    "ori": 7,
    "gins": 1,
    "this": 245,
    "line": 5,
    "work": 19,
    "go": 2,
    "back": 7,
    "several": 20,
    "decades": 1,
    "when": 79,
    "systems": 99,
    "weremainly": 1,
    "developed": 4,
    "knowledge": 94,
    "based": 76,
    "expert": 11,
    "since": 28,
    "then": 16,
    "defini": 1,
    "tion": 3,
    "understanding": 46,
    "implementation": 11,
    "picked": 1,
    "lines": 1,
    "namely": 16,
    "learn": 11,
    "ing": 2,
    "recommender": 3,
    "approaches": 35,
    "neural": 143,
    "symbolic": 21,
    "reasoning": 22,
    "mostly": 1,
    "happening": 1,
    "during": 6,
    "periods": 2,
    "history": 4,
    "article": 4,
    "present": 12,
    "intelli": 1,
    "gence": 1,
    "discuss": 3,
    "how": 46,
    "was": 20,
    "mainly": 6,
    "conceived": 2,
    "past": 3,
    "howit": 1,
    "understood": 4,
    "it": 139,
    "might": 28,
    "future": 10,
    "conclude": 1,
    "proposing": 1,
    "criteria": 16,
    "explanations": 97,
    "that": 371,
    "believe": 1,
    "will": 34,
    "play": 3,
    "crucial": 7,
    "role": 8,
    "development": 10,
    "human": 56,
    "understandable": 18,
    "explain": 40,
    "able": 14,
    "categorized": 1,
    "under": 28,
    "fundamental": 5,
    "concepts": 20,
    "data": 289,
    "technologies": 4,
    "keywords": 2,
    "interpretable": 67,
    "introduction": 7,
    "identified": 2,
    "key": 8,
    "factor": 4,
    "adoption": 6,
    "wide": 3,
    "range": 1,
    "contexts": 8,
    "doshi": 4,
    "velez": 4,
    "kim": 11,
    "lipton": 1,
    "ribeiro": 4,
    "singh": 6,
    "guestrin": 4,
    "a": 1,
    "discussion": 8,
    "accompanying": 1,
    "increasinglycommon": 1,
    "deployment": 5,
    "intelligent": 11,
    "application": 21,
    "domains": 3,
    "vehicles": 5,
    "transportation": 2,
    "insurance": 3,
    "financial": 6,
    "services": 2,
    "shown": 14,
    "decisions": 35,
    "taken": 9,
    "suggested": 1,
    "byreceived": 1,
    "november": 1,
    "revised": 1,
    "september": 1,
    "accepted": 2,
    "doi": 4,
    "widm": 24,
    "an": 161,
    "open": 7,
    "access": 9,
    "terms": 22,
    "creative": 35,
    "commons": 35,
    "attribution": 14,
    "license": 2,
    "which": 120,
    "permits": 1,
    "use": 33,
    "distribution": 3,
    "reproduction": 1,
    "any": 33,
    "me": 1,
    "dium": 1,
    "provided": 4,
    "original": 4,
    "properly": 2,
    "cited": 1,
    "authors": 54,
    "wires": 26,
    "mining": 26,
    "discovery": 19,
    "published": 5,
    "wiley": 1,
    "periodicals": 1,
    "llc": 1,
    "knowl": 6,
    "discov": 2,
    "e": 1,
    "com": 2,
    "dmkd": 1,
    "o": 1,
    "f": 1,
    "https": 5,
    "org": 5,
    "essential": 2,
    "practical": 11,
    "social": 14,
    "with": 243,
    "increasing": 4,
    "frequency": 1,
    "legal": 1,
    "reasons": 16,
    "explana": 1,
    "developers": 4,
    "regulators": 1,
    "case": 23,
    "point": 12,
    "european": 13,
    "union": 2,
    "general": 26,
    "protection": 4,
    "regulation": 2,
    "gdpr": 1,
    "stipulates": 1,
    "right": 9,
    "obtain": 3,
    "meaningful": 4,
    "information": 99,
    "about": 39,
    "logic": 5,
    "involved": 12,
    "commonly": 2,
    "interpreted": 3,
    "explanation": 84,
    "for": 1,
    "con": 30,
    "sumers": 1,
    "affected": 5,
    "automatic": 4,
    "parliament": 2,
    "council": 1,
    "equipping": 1,
    "explanatory": 6,
    "capabilities": 8,
    "not": 91,
    "limited": 3,
    "issues": 9,
    "user": 26,
    "rights": 3,
    "technology": 7,
    "acceptance": 1,
    "though": 2,
    "also": 83,
    "required": 7,
    "designers": 2,
    "enhance": 3,
    "system": 36,
    "robustness": 9,
    "enable": 1,
    "diagnostics": 1,
    "prevent": 1,
    "bias": 25,
    "unfairness": 2,
    "discrimination": 13,
    "well": 14,
    "increase": 3,
    "allusers": 1,
    "whyandhow": 1,
    "made": 22,
    "being": 33,
    "provide": 18,
    "why": 30,
    "certain": 26,
    "thus": 11,
    "become": 7,
    "desirable": 1,
    "property": 11,
    "doran": 1,
    "schulz": 1,
    "should": 75,
    "help": 14,
    "model": 447,
    "thesystem": 2,
    "order": 26,
    "maintain": 3,
    "effectively": 5,
    "they": 62,
    "assist": 1,
    "debugging": 3,
    "toprevent": 1,
    "rectify": 1,
    "incorrect": 1,
    "conclusions": 3,
    "addition": 6,
    "serve": 2,
    "educational": 1,
    "purposes": 8,
    "helpful": 1,
    "people": 4,
    "discovering": 5,
    "novel": 8,
    "domain": 17,
    "finally": 15,
    "related": 25,
    "persuasion": 1,
    "convey": 4,
    "sense": 6,
    "actionability": 1,
    "convince": 1,
    "decisionsare": 1,
    "most": 35,
    "convenient": 1,
    "them": 38,
    "notwithstanding": 1,
    "there": 34,
    "clear": 13,
    "agreement": 3,
    "what": 52,
    "nor": 1,
    "good": 13,
    "entails": 3,
    "its": 113,
    "manifestations": 1,
    "studied": 5,
    "across": 10,
    "incarnation": 1,
    "disciplines": 6,
    "first": 7,
    "notions": 1,
    "ofexplainability": 1,
    "subsided": 1,
    "together": 8,
    "after": 4,
    "mid": 1,
    "s": 1,
    "buchanan": 5,
    "shortliffe": 5,
    "wick": 8,
    "thompson": 5,
    "brought": 2,
    "into": 38,
    "focus": 9,
    "recent": 20,
    "successes": 1,
    "guidotti": 2,
    "et": 11,
    "al": 9,
    "both": 22,
    "nunes": 7,
    "jannach": 10,
    "loop": 2,
    "holzinger": 3,
    "plass": 2,
    "tintarev": 8,
    "masthof": 8,
    "garcez": 2,
    "look": 3,
    "literature": 39,
    "xai": 159,
    "from": 161,
    "traditional": 1,
    "currently": 3,
    "relevant": 9,
    "vast": 2,
    "articledoes": 1,
    "aim": 9,
    "complete": 6,
    "each": 38,
    "perspectives": 6,
    "reader": 1,
    "find": 4,
    "more": 56,
    "comprehensive": 3,
    "reviews": 2,
    "deep": 97,
    "arrieta": 1,
    "fernandez": 1,
    "herrera": 4,
    "cordon": 1,
    "jose": 1,
    "del": 6,
    "jesus": 2,
    "marcelloni": 1,
    "mueller": 3,
    "hoffman": 3,
    "clancey": 1,
    "emrey": 2,
    "klein": 2,
    "rather": 7,
    "resp": 3,
    "format": 1,
    "examples": 20,
    "main": 13,
    "contributions": 27,
    "references": 4,
    "he": 2,
    "gain": 2,
    "deeper": 3,
    "organized": 1,
    "follows": 4,
    "section": 34,
    "give": 5,
    "subsequently": 1,
    "addressed": 9,
    "throughout": 5,
    "describes": 1,
    "two": 28,
    "expla": 3,
    "nations": 5,
    "prominently": 1,
    "represented": 3,
    "problem": 27,
    "solving": 4,
    "activities": 3,
    "notion": 4,
    "machinelearning": 4,
    "few": 7,
    "discusses": 1,
    "conceptualized": 1,
    "context": 21,
    "identifies": 2,
    "increasingly": 6,
    "popular": 2,
    "promising": 1,
    "approach": 53,
    "provides": 2,
    "critical": 10,
    "discussionand": 1,
    "comparison": 7,
    "mentioned": 10,
    "introduces": 3,
    "desiderata": 4,
    "set": 20,
    "challenges": 23,
    "sys": 3,
    "tems": 3,
    "concludes": 1,
    "defining": 1,
    "remains": 2,
    "still": 6,
    "question": 13,
    "particular": 14,
    "determining": 13,
    "today": 1,
    "active": 2,
    "debate": 1,
    "various": 2,
    "fields": 1,
    "including": 13,
    "cognitive": 12,
    "psychology": 5,
    "downloaded": 16,
    "onlinelibrary": 70,
    "inasp": 20,
    "hinari": 20,
    "pakistan": 19,
    "online": 2,
    "library": 1,
    "see": 7,
    "conditions": 2,
    "rules": 42,
    "oa": 35,
    "articles": 1,
    "governed": 35,
    "applicable": 2,
    "philosophy": 1,
    "litman": 1,
    "lombrozo": 4,
    "miller": 3,
    "articulates": 1,
    "link": 6,
    "between": 56,
    "sciences": 12,
    "providing": 3,
    "depth": 3,
    "survey": 21,
    "three": 9,
    "major": 3,
    "findings": 3,
    "were": 9,
    "highlighted": 1,
    "counterfactual": 9,
    "humans": 10,
    "tend": 1,
    "understand": 27,
    "event": 7,
    "happened": 1,
    "instead": 7,
    "some": 33,
    "other": 61,
    "events": 1,
    "second": 11,
    "selective": 2,
    "one": 48,
    "possible": 18,
    "causes": 4,
    "recommendation": 3,
    "overwhelm": 1,
    "too": 7,
    "much": 13,
    "third": 8,
    "conversation": 1,
    "interaction": 8,
    "purpose": 18,
    "transferring": 1,
    "implying": 1,
    "explainer": 1,
    "must": 24,
    "leverage": 1,
    "mental": 4,
    "explainee": 5,
    "engaging": 1,
    "process": 33,
    "according": 4,
    "these": 82,
    "points": 3,
    "properties": 8,
    "building": 7,
    "useful": 1,
    "prevalent": 1,
    "only": 28,
    "started": 1,
    "take": 6,
    "account": 6,
    "researchers": 1,
    "defined": 4,
    "oriented": 1,
    "instance": 19,
    "needs": 8,
    "differentiate": 1,
    "distinct": 1,
    "goals": 14,
    "highlighting": 4,
    "cognition": 2,
    "constraints": 7,
    "design": 28,
    "hilton": 1,
    "pointed": 1,
    "out": 9,
    "imply": 2,
    "interactions": 11,
    "generated": 7,
    "isessential": 1,
    "associate": 1,
    "semantic": 9,
    "components": 6,
    "effective": 4,
    "transmis": 1,
    "sion": 1,
    "kulesza": 4,
    "investigated": 1,
    "relationship": 2,
    "tions": 1,
    "fidelity": 9,
    "models": 315,
    "finding": 2,
    "completeness": 1,
    "ultimately": 3,
    "appears": 6,
    "important": 23,
    "thansoundness": 1,
    "oversimplification": 1,
    "detrimental": 1,
    "hitherto": 1,
    "focused": 2,
    "part": 16,
    "mechanistic": 2,
    "aspects": 21,
    "includes": 7,
    "but": 25,
    "types": 5,
    "create": 11,
    "consequently": 1,
    "their": 79,
    "depend": 1,
    "type": 8,
    "employed": 2,
    "subsymbolic": 2,
    "hybrid": 15,
    "draw": 3,
    "hypothesis": 1,
    "holds": 2,
    "baseusually": 1,
    "encoded": 1,
    "production": 2,
    "inference": 8,
    "mechanism": 2,
    "deduction": 1,
    "abduction": 1,
    "analogical": 1,
    "doyle": 3,
    "tsymbal": 2,
    "cunningham": 2,
    "lacave": 3,
    "diez": 2,
    "mitchell": 4,
    "keller": 2,
    "kedar": 2,
    "cabelli": 2,
    "consist": 1,
    "either": 4,
    "descriptions": 3,
    "coupled": 2,
    "trace": 4,
    "story": 10,
    "behind": 8,
    "metrics": 13,
    "accuracy": 16,
    "adaptability": 3,
    "comprehensibility": 12,
    "typically": 1,
    "meant": 1,
    "precise": 1,
    "reconstruction": 8,
    "behavior": 8,
    "adaptable": 1,
    "match": 2,
    "profiles": 1,
    "indeed": 4,
    "lay": 2,
    "interested": 1,
    "less": 11,
    "accurate": 7,
    "whereas": 1,
    "prefer": 2,
    "technical": 6,
    "formats": 1,
    "connectionist": 3,
    "generally": 1,
    "speaking": 1,
    "those": 27,
    "rely": 5,
    "representations": 17,
    "cases": 9,
    "distributed": 9,
    "processing": 39,
    "occurs": 4,
    "simultaneously": 1,
    "multiple": 13,
    "parallel": 2,
    "channels": 2,
    "unfortunately": 5,
    "frequently": 2,
    "bring": 3,
    "black": 54,
    "box": 55,
    "nature": 6,
    "corresponding": 2,
    "consequence": 1,
    "often": 5,
    "form": 13,
    "approximateor": 1,
    "try": 5,
    "mimic": 3,
    "andrews": 1,
    "diederich": 2,
    "tickle": 1,
    "interpret": 8,
    "allows": 11,
    "means": 25,
    "local": 35,
    "global": 9,
    "post": 55,
    "hoc": 54,
    "evaluated": 2,
    "using": 47,
    "measure": 8,
    "extent": 5,
    "competitive": 2,
    "levels": 13,
    "respect": 9,
    "accurately": 2,
    "imitate": 1,
    "predictor": 2,
    "respectively": 3,
    "additional": 3,
    "targetting": 1,
    "causability": 1,
    "introduced": 7,
    "langs": 1,
    "carrington": 2,
    "mller": 1,
    "refers": 12,
    "achieves": 6,
    "level": 44,
    "causal": 11,
    "specified": 1,
    "measured": 2,
    "effectiveness": 2,
    "efficiency": 2,
    "satisfaction": 2,
    "transparency": 45,
    "additionalclass": 1,
    "predominantly": 1,
    "methods": 86,
    "coun": 1,
    "terfactuals": 1,
    "hypothetical": 1,
    "input": 46,
    "show": 11,
    "prediction": 40,
    "could": 36,
    "obtained": 2,
    "moved": 1,
    "mothilal": 8,
    "sharma": 1,
    "tan": 5,
    "category": 15,
    "sub": 3,
    "consensus": 4,
    "makes": 11,
    "nilashi": 2,
    "bin": 1,
    "ibrahim": 2,
    "esfahani": 2,
    "ahmadi": 2,
    "fact": 10,
    "onconfalonieri": 1,
    "impact": 12,
    "makers": 2,
    "differently": 1,
    "rook": 5,
    "example": 37,
    "tailored": 2,
    "persuade": 1,
    "item": 1,
    "efficiently": 1,
    "implementing": 7,
    "usual": 1,
    "determine": 1,
    "objective": 4,
    "stakeholders": 3,
    "delivering": 1,
    "persuasive": 1,
    "probability": 2,
    "purchase": 2,
    "recommended": 1,
    "trustworthiness": 8,
    "another": 27,
    "desired": 2,
    "nation": 2,
    "return": 1,
    "reuse": 2,
    "chen": 12,
    "pu": 1,
    "moreover": 1,
    "efficient": 1,
    "satisfying": 1,
    "deciding": 2,
    "fast": 3,
    "ease": 11,
    "fosters": 1,
    "understandability": 11,
    "underlying": 7,
    "advice": 1,
    "giving": 2,
    "scrutability": 1,
    "tell": 1,
    "wrong": 1,
    "correlated": 4,
    "transparent": 50,
    "comprehensible": 9,
    "known": 11,
    "detailed": 4,
    "relationships": 16,
    "characteristics": 4,
    "refer": 4,
    "balog": 2,
    "radlinski": 2,
    "combine": 1,
    "build": 6,
    "predictive": 14,
    "large": 9,
    "amounts": 2,
    "equipped": 1,
    "rich": 3,
    "representation": 20,
    "edge": 1,
    "used": 66,
    "higher": 4,
    "structured": 4,
    "elements": 4,
    "explainthe": 1,
    "here": 5,
    "andfidelity": 1,
    "performance": 35,
    "consistency": 2,
    "andcomprehensibility": 1,
    "proper": 4,
    "ties": 1,
    "produced": 9,
    "view": 11,
    "basis": 1,
    "forcommon": 1,
    "supports": 3,
    "abstraction": 1,
    "refinement": 5,
    "injection": 1,
    "eppe": 2,
    "schorlemmer": 2,
    "kutz": 4,
    "pen": 1,
    "aloza": 2,
    "plaza": 1,
    "lehmann": 3,
    "hitzler": 7,
    "capability": 6,
    "parts": 7,
    "change": 7,
    "accuracyand": 1,
    "technicality": 2,
    "depending": 12,
    "profile": 3,
    "furthermore": 7,
    "refine": 1,
    "extracted": 5,
    "inject": 1,
    "improve": 18,
    "broda": 2,
    "gabbay": 2,
    "software": 2,
    "augmented": 1,
    "consid": 1,
    "ered": 1,
    "instantiations": 1,
    "support": 47,
    "sev": 1,
    "eral": 1,
    "consists": 7,
    "base": 4,
    "encoding": 1,
    "usually": 11,
    "modeled": 3,
    "produc": 1,
    "rule": 67,
    "interpreter": 1,
    "reasoner": 1,
    "interface": 6,
    "through": 30,
    "query": 1,
    "ways": 6,
    "activity": 7,
    "seeing": 2,
    "way": 16,
    "make": 21,
    "kind": 4,
    "accommodatesthe": 1,
    "engineers": 1,
    "whether": 10,
    "technically": 1,
    "sound": 1,
    "slight": 1,
    "vari": 1,
    "ants": 1,
    "experts": 9,
    "famous": 1,
    "instantiation": 1,
    "mycin": 6,
    "consultation": 1,
    "created": 2,
    "doctors": 1,
    "diagnostic": 1,
    "therapeutic": 1,
    "patients": 2,
    "infection": 1,
    "expertise": 2,
    "sists": 1,
    "static": 2,
    "containing": 1,
    "specific": 1,
    "factual": 1,
    "aboutthe": 1,
    "consideration": 5,
    "table": 9,
    "solutions": 4,
    "patient": 1,
    "uses": 3,
    "instantiate": 1,
    "answering": 9,
    "module": 1,
    "status": 1,
    "checker": 2,
    "former": 2,
    "answers": 7,
    "simple": 16,
    "english": 2,
    "language": 9,
    "questions": 3,
    "concerning": 1,
    "oro": 1,
    "latter": 9,
    "followed": 4,
    "accepts": 2,
    "predefined": 5,
    "allow": 8,
    "dynamic": 2,
    "rationale": 9,
    "parameters": 7,
    "values": 8,
    "hand": 19,
    "sequence": 5,
    "thequestion": 1,
    "basic": 2,
    "commands": 1,
    "command": 2,
    "ascend": 1,
    "chain": 2,
    "explore": 1,
    "descend": 1,
    "infer": 5,
    "ences": 1,
    "exploring": 2,
    "goal": 12,
    "achieved": 4,
    "although": 12,
    "provisioning": 1,
    "logically": 1,
    "improves": 1,
    "interpretability": 73,
    "asked": 1,
    "complex": 36,
    "reconstruct": 1,
    "fits": 1,
    "benefit": 1,
    "very": 10,
    "technicalexplanation": 1,
    "compared": 3,
    "engineer": 1,
    "motivated": 1,
    "reconceptualization": 1,
    "itself": 14,
    "next": 7,
    "conceiving": 1,
    "re": 7,
    "constructing": 2,
    "tem": 3,
    "taking": 4,
    "tory": 2,
    "accommodating": 1,
    "de": 56,
    "coupling": 1,
    "functionality": 2,
    "focusing": 2,
    "solve": 3,
    "task": 19,
    "hassling": 1,
    "runnels": 1,
    "exhibiting": 1,
    "rex": 4,
    "designed": 9,
    "moves": 2,
    "final": 6,
    "conclusion": 2,
    "abstract": 3,
    "inde": 2,
    "pendent": 1,
    "component": 5,
    "bases": 2,
    "existed": 1,
    "aknowledge": 1,
    "specification": 3,
    "acted": 1,
    "covered": 5,
    "problems": 14,
    "within": 44,
    "figure": 37,
    "takes": 3,
    "cues": 9,
    "inferred": 2,
    "resolution": 1,
    "cer": 1,
    "tain": 1,
    "filtered": 1,
    "decide": 1,
    "avail": 1,
    "selected": 3,
    "mapped": 1,
    "thedomain": 1,
    "screener": 1,
    "spec": 8,
    "common": 19,
    "ground": 3,
    "high": 20,
    "procedural": 1,
    "details": 5,
    "transitions": 4,
    "hypotheses": 3,
    "where": 32,
    "transition": 1,
    "requires": 5,
    "existence": 2,
    "step": 1,
    "enabled": 2,
    "available": 13,
    "thetable": 1,
    "logical": 3,
    "internal": 10,
    "formand": 1,
    "translationpremise": 1,
    "same": 34,
    "cntxt": 4,
    "gram": 1,
    "gramneg": 2,
    "morph": 1,
    "rod": 2,
    "air": 2,
    "anaerobic": 2,
    "action": 3,
    "identity": 1,
    "bacteroides": 1,
    "tally": 1,
    "if": 35,
    "stain": 1,
    "organism": 4,
    "morphology": 1,
    "aerobicity": 1,
    "suggestive": 2,
    "evidence": 5,
    "bacteroidesconfalonieri": 1,
    "speci": 44,
    "fication": 1,
    "among": 48,
    "scripts": 3,
    "frame": 2,
    "tries": 1,
    "planusing": 1,
    "whose": 4,
    "proven": 2,
    "search": 12,
    "plan": 3,
    "carried": 2,
    "backward": 1,
    "until": 4,
    "reaching": 3,
    "empty": 1,
    "state": 8,
    "corresponds": 1,
    "establishes": 1,
    "traverses": 1,
    "edges": 2,
    "found": 12,
    "teller": 2,
    "organizes": 1,
    "consistent": 3,
    "flow": 1,
    "presents": 15,
    "grammar": 1,
    "memory": 3,
    "structure": 16,
    "built": 9,
    "idea": 5,
    "extract": 5,
    "formatted": 1,
    "tree": 41,
    "setting": 2,
    "theme": 1,
    "plot": 1,
    "thestory": 1,
    "converted": 1,
    "textual": 1,
    "description": 2,
    "verbalizer": 2,
    "fills": 1,
    "template": 1,
    "movement": 2,
    "looks": 1,
    "like": 7,
    "considered": 34,
    "trees": 34,
    "tables": 1,
    "the": 2,
    "majority": 1,
    "boxes": 2,
    "given": 38,
    "returnsreasoning": 1,
    "explanationscreener": 1,
    "end": 19,
    "userexpert": 1,
    "solution": 5,
    "left": 1,
    "result": 7,
    "classification": 6,
    "etc": 2,
    "does": 18,
    "reveal": 2,
    "sufficient": 1,
    "resulting": 3,
    "opaque": 13,
    "reason": 13,
    "learningis": 1,
    "formulated": 1,
    "approximates": 2,
    "pos": 1,
    "sible": 2,
    "seeking": 1,
    "techniques": 147,
    "proposed": 28,
    "extraction": 38,
    "counterpart": 2,
    "aims": 2,
    "overall": 11,
    "approximation": 2,
    "tracked": 1,
    "mechanisms": 2,
    "craven": 3,
    "shaolin": 1,
    "frost": 1,
    "hinton": 3,
    "over": 19,
    "outcomes": 6,
    "instances": 5,
    "dataset": 13,
    "works": 18,
    "vary": 1,
    "greatly": 1,
    "rodin": 1,
    "shah": 2,
    "b": 3,
    "introspective": 2,
    "relating": 1,
    "inputs": 5,
    "outputs": 12,
    "saliency": 12,
    "masks": 1,
    "network": 46,
    "image": 45,
    "convolutional": 22,
    "networks": 114,
    "cnns": 10,
    "hendricks": 4,
    "park": 3,
    "wigand": 1,
    "orgroups": 1,
    "output": 49,
    "tokens": 1,
    "causally": 1,
    "alvarez": 1,
    "melisa": 1,
    "jackova": 1,
    "following": 15,
    "pdps": 4,
    "partial": 1,
    "dependence": 3,
    "plots": 3,
    "lime": 11,
    "agnostic": 20,
    "shap": 4,
    "shapley": 3,
    "additive": 16,
    "lundberg": 3,
    "lee": 4,
    "dedicate": 1,
    "watcher": 1,
    "mittelstadt": 1,
    "russell": 1,
    "extracting": 16,
    "via": 22,
    "automatically": 3,
    "generate": 15,
    "representa": 1,
    "features": 52,
    "trained": 28,
    "strategy": 3,
    "represent": 5,
    "directly": 13,
    "inter": 1,
    "pretable": 1,
    "shavlik": 2,
    "frosst": 2,
    "odense": 2,
    "zhou": 7,
    "jiang": 3,
    "feature": 93,
    "importance": 20,
    "vectors": 13,
    "lou": 4,
    "caruana": 7,
    "gehrke": 3,
    "hooker": 5,
    "noninterpretable": 1,
    "in": 2,
    "previous": 11,
    "net": 1,
    "towell": 1,
    "friedman": 5,
    "compute": 1,
    "effect": 6,
    "variables": 37,
    "predicted": 11,
    "outcome": 3,
    "linear": 22,
    "regression": 26,
    "pdp": 3,
    "marginalizing": 1,
    "so": 31,
    "function": 4,
    "shows": 12,
    "onewants": 1,
    "generates": 5,
    "uncorrelated": 1,
    "accumulated": 2,
    "conditional": 7,
    "marginal": 1,
    "distribu": 1,
    "apley": 1,
    "zhu": 7,
    "individual": 16,
    "predictions": 28,
    "approximated": 3,
    "generating": 6,
    "surrogate": 4,
    "intrinsically": 1,
    "implemented": 1,
    "exploits": 2,
    "queried": 1,
    "times": 4,
    "perturbing": 1,
    "training": 33,
    "new": 26,
    "feeding": 1,
    "perturbedconfalonieri": 1,
    "creates": 1,
    "weighted": 2,
    "proximity": 3,
    "perturbed": 2,
    "ones": 12,
    "creating": 6,
    "low": 4,
    "num": 2,
    "ber": 1,
    "keep": 1,
    "complexity": 17,
    "variable": 16,
    "explained": 14,
    "however": 33,
    "sampling": 1,
    "method": 31,
    "train": 2,
    "situations": 1,
    "spaces": 2,
    "dimensional": 2,
    "boundaries": 3,
    "scenarios": 8,
    "fea": 5,
    "tures": 9,
    "detriment": 1,
    "extension": 1,
    "called": 11,
    "anchor": 1,
    "perturbation": 1,
    "space": 15,
    "constructs": 3,
    "adapting": 1,
    "coverage": 6,
    "regard": 2,
    "boundary": 2,
    "faithfulness": 1,
    "alterations": 1,
    "smallest": 1,
    "ale": 2,
    "showing": 8,
    "temperature": 1,
    "humidity": 3,
    "wind": 12,
    "speed": 1,
    "affect": 5,
    "number": 14,
    "rented": 1,
    "bicycles": 1,
    "day": 1,
    "molnar": 1,
    "due": 16,
    "correlationbetween": 1,
    "smaller": 1,
    "decrease": 1,
    "bikes": 1,
    "cannot": 8,
    "trusted": 1,
    "boston": 1,
    "harrison": 1,
    "rubinfeld": 2,
    "contains": 2,
    "collected": 5,
    "census": 1,
    "service": 1,
    "housing": 2,
    "area": 8,
    "massachusetts": 1,
    "median": 5,
    "value": 6,
    "owner": 1,
    "occupied": 1,
    "homes": 1,
    "rm": 1,
    "averagenumber": 1,
    "rooms": 1,
    "per": 4,
    "dwelling": 1,
    "tax": 2,
    "full": 5,
    "rate": 6,
    "nox": 1,
    "nitric": 1,
    "oxides": 1,
    "concentration": 2,
    "lstat": 1,
    "lower": 2,
    "population": 3,
    "ptratio": 1,
    "pupil": 1,
    "teacher": 2,
    "ratio": 1,
    "town": 1,
    "appreciatedo": 1,
    "world": 9,
    "captured": 8,
    "wachter": 1,
    "you": 4,
    "denied": 2,
    "loan": 1,
    "because": 5,
    "your": 1,
    "annual": 2,
    "income": 3,
    "would": 12,
    "offered": 1,
    "scenario": 2,
    "borrower": 1,
    "receives": 1,
    "regarding": 7,
    "informed": 1,
    "she": 8,
    "counterfactuals": 3,
    "changeable": 1,
    "person": 2,
    "gender": 4,
    "race": 3,
    "birth": 1,
    "place": 11,
    "hence": 9,
    "becomes": 2,
    "actionable": 2,
    "concretely": 1,
    "done": 9,
    "meet": 3,
    "four": 2,
    "obeying": 1,
    "sparsity": 1,
    "presenting": 2,
    "diversified": 2,
    "actions": 2,
    "shed": 2,
    "light": 3,
    "changes": 3,
    "unlike": 1,
    "approximating": 1,
    "classifier": 2,
    "advantage": 7,
    "always": 13,
    "truthful": 1,
    "direct": 3,
    "algorithm": 19,
    "prove": 1,
    "particularly": 2,
    "andthe": 2,
    "soon": 1,
    "diversity": 13,
    "acknowledged": 4,
    "who": 8,
    "correspondingly": 1,
    "amethod": 1,
    "diverse": 8,
    "dice": 3,
    "seen": 4,
    "variety": 1,
    "engines": 1,
    "customized": 1,
    "recommenda": 1,
    "collaborative": 1,
    "filtering": 2,
    "include": 15,
    "matrix": 2,
    "factorisation": 4,
    "mf": 2,
    "koren": 2,
    "bell": 1,
    "volinsky": 2,
    "variants": 1,
    "singular": 1,
    "decomposition": 4,
    "svd": 1,
    "nati": 2,
    "jaakkola": 1,
    "ornonnegative": 1,
    "nmf": 1,
    "seung": 2,
    "nearest": 14,
    "neighbors": 12,
    "embeddings": 6,
    "wang": 9,
    "feng": 4,
    "nie": 1,
    "chua": 1,
    "zhang": 17,
    "considerable": 1,
    "years": 7,
    "answer": 15,
    "served": 2,
    "many": 30,
    "bythe": 1,
    "contextual": 2,
    "loca": 1,
    "time": 27,
    "predict": 2,
    "above": 16,
    "eight": 1,
    "age": 2,
    "class": 27,
    "represents": 2,
    "wherethe": 1,
    "computed": 2,
    "negative": 6,
    "examplesconfalonieri": 1,
    "broadly": 1,
    "classified": 1,
    "categories": 11,
    "tackle": 5,
    "aiming": 1,
    "explaining": 43,
    "proposes": 5,
    "particu": 1,
    "lar": 1,
    "analyze": 11,
    "recommendations": 5,
    "subsections": 5,
    "brief": 3,
    "current": 9,
    "art": 5,
    "forms": 1,
    "persuasiveness": 1,
    "platforms": 1,
    "widespread": 2,
    "latent": 6,
    "items": 2,
    "highest": 1,
    "chance": 2,
    "interacted": 2,
    "rating": 2,
    "arise": 3,
    "trying": 1,
    "factors": 6,
    "contribute": 8,
    "exact": 1,
    "meaning": 5,
    "unknown": 3,
    "therefore": 7,
    "ests": 1,
    "explicit": 1,
    "efm": 1,
    "pro": 6,
    "vided": 1,
    "feedback": 2,
    "map": 13,
    "tensor": 1,
    "factorization": 1,
    "ofefm": 1,
    "cube": 1,
    "ratings": 2,
    "embedded": 2,
    "qin": 1,
    "xu": 6,
    "implicit": 2,
    "neighborhood": 1,
    "comes": 4,
    "thestyle": 1,
    "similar": 11,
    "viewed": 1,
    "thanks": 1,
    "regularizer": 32,
    "forces": 1,
    "close": 3,
    "external": 7,
    "personalized": 1,
    "rec": 5,
    "ommender": 2,
    "catherine": 2,
    "mazaitis": 2,
    "esknazi": 2,
    "cohen": 1,
    "graphs": 4,
    "relate": 7,
    "paths": 1,
    "nect": 1,
    "graph": 2,
    "links": 4,
    "views": 4,
    "purchases": 1,
    "orcategory": 1,
    "blocks": 3,
    "note": 4,
    "theory": 15,
    "insights": 9,
    "behave": 1,
    "interests": 1,
    "heckel": 2,
    "vlachos": 2,
    "coclustering": 1,
    "theirinterests": 1,
    "bipartite": 1,
    "retrieved": 1,
    "shared": 8,
    "considering": 10,
    "core": 6,
    "engine": 1,
    "consider": 14,
    "probed": 1,
    "statistical": 14,
    "peake": 2,
    "highlight": 1,
    "percentage": 1,
    "behaved": 1,
    "similarly": 13,
    "confidence": 2,
    "recom": 1,
    "mendation": 1,
    "besides": 2,
    "version": 1,
    "recommenderengine": 1,
    "association": 5,
    "similarity": 7,
    "preserve": 3,
    "intrinsi": 1,
    "cally": 6,
    "anand": 2,
    "surge": 1,
    "deployed": 4,
    "seo": 1,
    "huang": 3,
    "yang": 13,
    "liu": 9,
    "recurrent": 12,
    "long": 10,
    "short": 3,
    "term": 12,
    "rnn": 10,
    "lstm": 5,
    "hidasi": 2,
    "karatzoglou": 2,
    "implement": 4,
    "strategies": 7,
    "sequential": 5,
    "lstms": 1,
    "aware": 5,
    "ommendations": 2,
    "words": 1,
    "algorithms": 14,
    "natural": 8,
    "generation": 11,
    "visual": 40,
    "interest": 4,
    "styles": 9,
    "herlocker": 2,
    "konstan": 4,
    "riedl": 1,
    "histograms": 1,
    "preferred": 2,
    "rendering": 2,
    "supporting": 4,
    "results": 15,
    "studies": 21,
    "ever": 1,
    "bilgic": 1,
    "mooney": 2,
    "cosley": 2,
    "lam": 2,
    "albert": 2,
    "study": 18,
    "histo": 1,
    "paradigm": 9,
    "specifically": 6,
    "mean": 3,
    "kouki": 2,
    "schaffer": 2,
    "pujara": 2,
    "donovan": 2,
    "getoor": 1,
    "friedrich": 2,
    "zanker": 6,
    "taxonomy": 23,
    "classify": 2,
    "justify": 1,
    "amount": 11,
    "concrete": 3,
    "derive": 1,
    "determined": 2,
    "preference": 3,
    "expressions": 2,
    "dur": 1,
    "papadimitriou": 2,
    "symeonidis": 8,
    "manolopoulos": 2,
    "extends": 4,
    "classifica": 1,
    "distinction": 10,
    "areusers": 1,
    "denote": 2,
    "style": 2,
    "choices": 1,
    "explains": 4,
    "content": 9,
    "please": 1,
    "combination": 6,
    "aforementioned": 11,
    "multi": 20,
    "amazon": 1,
    "stores": 1,
    "adopted": 7,
    "justification": 1,
    "customers": 1,
    "bought": 3,
    "xalso": 1,
    "performing": 3,
    "buying": 1,
    "justifications": 1,
    "yis": 1,
    "ommended": 1,
    "highly": 4,
    "rated": 1,
    "depicts": 1,
    "influenced": 1,
    "claimed": 1,
    "preferable": 1,
    "formulate": 2,
    "true": 7,
    "opinion": 1,
    "exploited": 1,
    "observed": 5,
    "restaurants": 3,
    "may": 28,
    "described": 3,
    "location": 1,
    "cuisine": 3,
    "cost": 1,
    "demonstrated": 2,
    "chinese": 2,
    "tested": 1,
    "later": 8,
    "perception": 1,
    "relates": 2,
    "personality": 1,
    "further": 23,
    "personalize": 2,
    "symb": 1,
    "olic": 1,
    "seeks": 1,
    "integrate": 1,
    "principles": 52,
    "rea": 1,
    "soning": 2,
    "painted": 1,
    "irreconcil": 1,
    "paradigms": 6,
    "differences": 5,
    "actually": 6,
    "subtle": 1,
    "than": 15,
    "presumed": 1,
    "operate": 2,
    "performed": 9,
    "discrete": 1,
    "entities": 7,
    "follow": 1,
    "everyday": 1,
    "lives": 2,
    "neighbours": 1,
    "visualizing": 16,
    "power": 3,
    "target": 13,
    "better": 13,
    "individ": 1,
    "ual": 1,
    "neurons": 1,
    "necessarily": 3,
    "readily": 2,
    "recognizable": 1,
    "concept": 37,
    "theyoften": 1,
    "regularities": 1,
    "imbuing": 1,
    "capabil": 1,
    "ities": 1,
    "allowing": 8,
    "perform": 4,
    "discussed": 6,
    "bader": 2,
    "integration": 4,
    "bridge": 2,
    "frequentlyencountered": 1,
    "pattern": 19,
    "recognition": 26,
    "achieving": 4,
    "promises": 1,
    "benefits": 1,
    "reusable": 1,
    "having": 4,
    "pressing": 1,
    "practices": 1,
    "sample": 4,
    "putationally": 1,
    "demanding": 1,
    "heavy": 2,
    "difficult": 1,
    "aspect": 6,
    "generalize": 1,
    "foundation": 1,
    "fortransfer": 1,
    "overcome": 1,
    "limitations": 1,
    "last": 12,
    "importantly": 1,
    "lack": 6,
    "humanly": 1,
    "muggleton": 2,
    "schmid": 1,
    "zeller": 2,
    "tamaddoni": 2,
    "nezhad": 2,
    "cycle": 2,
    "illustrates": 4,
    "side": 2,
    "writable": 1,
    "readable": 4,
    "capable": 2,
    "iterative": 5,
    "sides": 1,
    "embedding": 1,
    "sym": 1,
    "bolic": 1,
    "learned": 18,
    "refined": 2,
    "knowledgefrom": 1,
    "drive": 2,
    "modification": 1,
    "fine": 1,
    "tuning": 2,
    "stenning": 2,
    "already": 16,
    "hints": 1,
    "pillars": 1,
    "mapping": 7,
    "integrated": 2,
    "symbolism": 1,
    "connectionism": 1,
    "divided": 4,
    "formula": 1,
    "previously": 7,
    "efforts": 7,
    "integrating": 3,
    "immediate": 1,
    "inductivelogic": 1,
    "programming": 3,
    "ilp": 2,
    "develops": 1,
    "program": 1,
    "frana": 2,
    "zaverucha": 3,
    "beneficial": 1,
    "improving": 7,
    "garnelo": 2,
    "shanahan": 2,
    "networkmodule": 1,
    "top": 1,
    "regular": 1,
    "relations": 13,
    "innerabstractions": 1,
    "guiding": 1,
    "successful": 2,
    "phase": 1,
    "complementing": 1,
    "lingua": 1,
    "franca": 1,
    "sarker": 2,
    "xie": 1,
    "raymer": 2,
    "propose": 12,
    "interactive": 2,
    "enables": 1,
    "illustration": 2,
    "monitoring": 1,
    "classifiers": 1,
    "act": 3,
    "increas": 1,
    "ingly": 1,
    "ability": 24,
    "againstthat": 1,
    "backdrop": 1,
    "vital": 1,
    "enablers": 1,
    "intelligible": 3,
    "futia": 2,
    "vetr": 2,
    "targeted": 4,
    "nonexperts": 1,
    "querying": 1,
    "staying": 1,
    "optimize": 1,
    "test": 6,
    "sets": 6,
    "replicate": 2,
    "theoriginal": 1,
    "dimensions": 1,
    "consumer": 3,
    "precisely": 1,
    "representing": 2,
    "easy": 7,
    "trade": 12,
    "off": 11,
    "consis": 1,
    "tency": 1,
    "revise": 2,
    "consolidate": 2,
    "background": 4,
    "semantics": 1,
    "theexplanations": 1,
    "facilitating": 2,
    "injected": 2,
    "ziegler": 2,
    "returning": 1,
    "decom": 1,
    "positional": 23,
    "pedagogical": 3,
    "falling": 2,
    "weights": 8,
    "approximate": 2,
    "unit": 3,
    "aggregated": 1,
    "composite": 1,
    "whole": 9,
    "layersof": 1,
    "intellectual": 2,
    "considerations": 1,
    "want": 2,
    "belonging": 2,
    "limitation": 2,
    "treat": 1,
    "oracle": 2,
    "pairings": 1,
    "prime": 1,
    "trepan": 11,
    "induction": 5,
    "recursively": 1,
    "extracts": 2,
    "originally": 2,
    "intended": 3,
    "feed": 2,
    "forward": 2,
    "treated": 1,
    "ageneric": 1,
    "principle": 10,
    "id": 2,
    "murphy": 1,
    "pazzani": 2,
    "mout": 1,
    "ofnspecified": 1,
    "send": 1,
    "down": 2,
    "branch": 1,
    "tests": 1,
    "greedy": 1,
    "starts": 1,
    "single": 14,
    "maximizes": 1,
    "iteratively": 1,
    "adds": 3,
    "longer": 1,
    "improved": 3,
    "doing": 1,
    "combines": 5,
    "ofusing": 1,
    "targeting": 1,
    "layer": 27,
    "perceptrons": 1,
    "mlps": 2,
    "splitting": 1,
    "labels": 4,
    "real": 12,
    "mlp": 1,
    "servestwo": 1,
    "helps": 2,
    "avoid": 3,
    "overfitting": 1,
    "outliers": 1,
    "arbitrarily": 1,
    "degree": 5,
    "without": 17,
    "architecture": 7,
    "units": 3,
    "assessing": 1,
    "theextracted": 1,
    "syntactic": 1,
    "huysmans": 1,
    "piltaver": 2,
    "lu": 2,
    "trek": 2,
    "gams": 6,
    "martinc": 2,
    "cc": 2,
    "ip": 1,
    "weyde": 3,
    "showed": 5,
    "beenhanced": 1,
    "ontologies": 1,
    "categorization": 5,
    "relies": 3,
    "realizations": 4,
    "applied": 23,
    "aid": 1,
    "operative": 1,
    "knowledgeacquisition": 1,
    "effort": 1,
    "formally": 1,
    "formalization": 1,
    "develop": 4,
    "consisted": 1,
    "decoupledfrom": 1,
    "inexpert": 1,
    "aimed": 7,
    "modeling": 16,
    "nonetheless": 1,
    "acquiring": 1,
    "plex": 1,
    "subject": 3,
    "interpretation": 21,
    "modeler": 1,
    "decides": 2,
    "capture": 1,
    "alleviate": 2,
    "acquisition": 1,
    "identifying": 5,
    "patterns": 6,
    "happens": 1,
    "price": 2,
    "modelthat": 1,
    "seek": 1,
    "maximize": 3,
    "clearly": 7,
    "compete": 1,
    "reasonable": 1,
    "equation": 13,
    "appropriate": 2,
    "scientist": 1,
    "prefers": 1,
    "possibly": 1,
    "lessaccurate": 1,
    "nowadays": 4,
    "powerful": 3,
    "enough": 11,
    "guarantees": 1,
    "truthfulness": 1,
    "closeness": 1,
    "lacking": 1,
    "reliable": 1,
    "ofexpressing": 1,
    "uncertainty": 6,
    "supposed": 1,
    "satisfactory": 1,
    "proxy": 4,
    "metric": 4,
    "capacity": 2,
    "predicting": 8,
    "diabetes": 2,
    "risk": 12,
    "thepima": 1,
    "indians": 1,
    "smith": 2,
    "everhart": 2,
    "dickson": 2,
    "knowler": 2,
    "johannes": 1,
    "semantically": 1,
    "solely": 4,
    "optimizing": 2,
    "resemblance": 2,
    "overlooked": 1,
    "bhatt": 2,
    "deployments": 1,
    "debug": 1,
    "practice": 8,
    "thereis": 1,
    "gap": 2,
    "primarily": 1,
    "stake": 1,
    "holders": 2,
    "adapt": 1,
    "ribera": 2,
    "lapedriza": 2,
    "trustworthy": 6,
    "fordifferent": 1,
    "centered": 5,
    "guidelines": 14,
    "responsible": 29,
    "establishing": 3,
    "fairness": 51,
    "accountability": 14,
    "privacy": 65,
    "especiallyrelated": 1,
    "fusion": 94,
    "environments": 3,
    "dis": 1,
    "cussed": 1,
    "standing": 1,
    "definition": 2,
    "explanationsappears": 1,
    "challenging": 1,
    "clude": 1,
    "our": 20,
    "pointing": 1,
    "ment": 2,
    "putting": 1,
    "heart": 2,
    "entire": 3,
    "enterprise": 3,
    "knowing": 1,
    "foster": 2,
    "largely": 2,
    "exceptions": 1,
    "chattopadhyay": 2,
    "manupriya": 2,
    "sarkar": 1,
    "balasubramanian": 2,
    "statements": 1,
    "se": 1,
    "humanmodel": 1,
    "measuring": 7,
    "statement": 6,
    "causalmodel": 1,
    "reviewed": 15,
    "empirical": 4,
    "indicates": 1,
    "psychologically": 1,
    "contras": 1,
    "tive": 1,
    "ask": 2,
    "phappened": 1,
    "phap": 1,
    "pened": 1,
    "contrastive": 1,
    "preliminary": 1,
    "steps": 1,
    "direction": 9,
    "designing": 3,
    "transfer": 2,
    "recipient": 1,
    "involving": 1,
    "explainers": 1,
    "explainees": 1,
    "dialogue": 1,
    "conversational": 2,
    "argumentative": 1,
    "processes": 9,
    "inspection": 3,
    "trustin": 1,
    "epistemi": 1,
    "informational": 1,
    "sbackground": 1,
    "expect": 1,
    "cause": 5,
    "depends": 4,
    "doctor": 1,
    "pre": 1,
    "sumably": 1,
    "necessary": 3,
    "sometimes": 4,
    "generat": 1,
    "address": 8,
    "concerns": 9,
    "differentially": 2,
    "private": 4,
    "harder": 1,
    "bauer": 1,
    "symbolically": 1,
    "grounded": 1,
    "conceptual": 5,
    "formal": 1,
    "turn": 1,
    "enact": 1,
    "manipulation": 2,
    "galliani": 3,
    "keet": 2,
    "troquard": 3,
    "canplay": 1,
    "wants": 1,
    "matching": 1,
    "dif": 5,
    "ferent": 2,
    "stakeholder": 1,
    "performances": 1,
    "burnett": 3,
    "wong": 1,
    "stumpf": 1,
    "cares": 1,
    "success": 3,
    "ful": 7,
    "communication": 3,
    "esta": 1,
    "blishing": 1,
    "inherent": 2,
    "log": 2,
    "ic": 1,
    "reasonabl": 1,
    "facilitated": 1,
    "modularity": 1,
    "integrates": 1,
    "symbo": 1,
    "lic": 1,
    "sy": 1,
    "mbolic": 1,
    "advance": 1,
    "ments": 2,
    "demonstrate": 2,
    "robust": 6,
    "oe": 1,
    "es": 1,
    "eu": 1,
    "ft": 8,
    "em": 1,
    "integra": 1,
    "repres": 1,
    "entations": 1,
    "review": 14,
    "describing": 1,
    "thereof": 1,
    "evaluate": 5,
    "tains": 1,
    "navigate": 1,
    "analyzed": 11,
    "unable": 1,
    "drawn": 3,
    "forexplanations": 1,
    "centric": 1,
    "acknowledgments": 1,
    "thank": 3,
    "daniel": 3,
    "malagarriga": 1,
    "valuable": 1,
    "discussions": 2,
    "topics": 1,
    "asignificant": 1,
    "alpha": 4,
    "health": 2,
    "telefnica": 1,
    "innovacin": 1,
    "barcelona": 1,
    "spain": 6,
    "department": 3,
    "innovation": 3,
    "province": 1,
    "covering": 4,
    "publication": 1,
    "costs": 1,
    "conflict": 2,
    "declared": 1,
    "author": 3,
    "conceptualization": 1,
    "investigation": 1,
    "project": 2,
    "administration": 2,
    "writing": 7,
    "draft": 1,
    "editing": 4,
    "richard": 1,
    "orcid": 2,
    "endnotes": 1,
    "consumers": 1,
    "reached": 2,
    "allowance": 1,
    "bank": 1,
    "mendations": 1,
    "floridi": 1,
    "persons": 1,
    "personal": 4,
    "repealing": 1,
    "directive": 1,
    "ec": 8,
    "oj": 1,
    "l": 96,
    "tomichie": 1,
    "weak": 2,
    "strong": 2,
    "ultra": 2,
    "michie": 2,
    "operationalcriteria": 1,
    "qualities": 1,
    "comprehensi": 1,
    "bility": 2,
    "criterion": 5,
    "learner": 9,
    "produces": 4,
    "additionally": 1,
    "requir": 1,
    "teach": 1,
    "increased": 2,
    "beyond": 8,
    "studying": 1,
    "alone": 4,
    "dejaeger": 1,
    "mues": 1,
    "vanthienen": 3,
    "baesens": 3,
    "closer": 2,
    "globalexplanation": 1,
    "relegated": 1,
    "novelty": 3,
    "serendipitous": 1,
    "others": 16,
    "clarke": 2,
    "vargas": 2,
    "castells": 2,
    "medicine": 7,
    "melis": 1,
    "framework": 17,
    "corr": 1,
    "abs": 1,
    "critique": 3,
    "effects": 7,
    "supervised": 7,
    "rodr": 4,
    "iguez": 3,
    "ser": 3,
    "bennetot": 1,
    "tabik": 1,
    "barbado": 2,
    "taxonomies": 3,
    "opportunities": 6,
    "toward": 17,
    "inffus": 1,
    "quality": 15,
    "conflicting": 1,
    "proceedings": 46,
    "rd": 3,
    "international": 59,
    "acm": 43,
    "sigir": 1,
    "conference": 86,
    "retrieval": 1,
    "van": 9,
    "der": 2,
    "torre": 1,
    "lambalgen": 1,
    "non": 21,
    "probabilistic": 10,
    "computing": 9,
    "minds": 1,
    "machines": 20,
    "bowman": 3,
    "domingos": 1,
    "xiang": 1,
    "weller": 2,
    "taly": 1,
    "jia": 1,
    "eckersley": 1,
    "proceed": 3,
    "ings": 1,
    "pp": 122,
    "machinery": 4,
    "york": 1,
    "ny": 2,
    "vs": 3,
    "promotion": 1,
    "personalization": 1,
    "workshop": 9,
    "stage": 2,
    "interfaces": 1,
    "experiments": 2,
    "stanford": 1,
    "heuristic": 1,
    "addison": 1,
    "wesley": 1,
    "longman": 1,
    "publishing": 2,
    "co": 5,
    "inc": 1,
    "entity": 1,
    "ceedings": 1,
    "poster": 1,
    "track": 1,
    "th": 16,
    "recsys": 3,
    "attributions": 1,
    "chaudhuri": 1,
    "salakhutdinov": 2,
    "eds": 1,
    "vol": 34,
    "beach": 1,
    "ca": 3,
    "pmlr": 1,
    "http": 1,
    "mlr": 1,
    "press": 5,
    "v": 3,
    "chattopadhyaya": 1,
    "html": 1,
    "agents": 2,
    "web": 2,
    "nd": 8,
    "business": 2,
    "telecommunication": 1,
    "rank": 1,
    "kolla": 1,
    "cormack": 1,
    "vechtomova": 1,
    "ashkan": 1,
    "bttcher": 1,
    "mackinnon": 1,
    "infor": 2,
    "mation": 3,
    "evaluation": 12,
    "st": 1,
    "differ": 2,
    "presence": 4,
    "iui": 3,
    "personalised": 1,
    "engineering": 15,
    "ofcollaborative": 1,
    "ieee": 73,
    "ference": 1,
    "informatics": 2,
    "cbi": 2,
    "arxiv": 132,
    "creel": 1,
    "shafto": 1,
    "cog": 1,
    "nitive": 1,
    "goel": 1,
    "seifert": 1,
    "freksa": 1,
    "meeting": 1,
    "society": 12,
    "cogsci": 2,
    "creativity": 1,
    "computation": 3,
    "montreal": 1,
    "canada": 1,
    "nitivesciencesociety": 1,
    "mindmodeling": 1,
    "papers": 11,
    "index": 1,
    "upward": 1,
    "operators": 1,
    "blending": 1,
    "el": 1,
    "annals": 1,
    "mathematics": 1,
    "porello": 2,
    "righetti": 1,
    "towards": 20,
    "even": 15,
    "irresistible": 1,
    "axiom": 2,
    "weakening": 2,
    "borgwardt": 1,
    "meyer": 1,
    "logics": 2,
    "dl": 19,
    "colocated": 4,
    "theth": 1,
    "kr": 1,
    "rhodes": 1,
    "greece": 1,
    "ceur": 6,
    "ws": 4,
    "paper": 9,
    "pdf": 2,
    "prado": 1,
    "martn": 1,
    "reloaded": 1,
    "driven": 5,
    "ios": 1,
    "faia": 1,
    "believing": 1,
    "opin": 1,
    "ions": 2,
    "chi": 2,
    "cambridge": 5,
    "ma": 1,
    "mit": 2,
    "really": 2,
    "ml": 122,
    "ia": 3,
    "rigorous": 1,
    "report": 4,
    "dub": 1,
    "lin": 2,
    "trinity": 1,
    "college": 4,
    "dublin": 1,
    "evolutionary": 2,
    "fuzzy": 11,
    "computational": 19,
    "magazine": 2,
    "mci": 1,
    "relational": 3,
    "bottom": 1,
    "clause": 1,
    "propositionalization": 1,
    "gradient": 8,
    "boosting": 5,
    "statistics": 12,
    "aaai": 6,
    "ojs": 2,
    "php": 1,
    "aimagazine": 1,
    "aimag": 1,
    "vi": 1,
    "distilling": 3,
    "soft": 4,
    "italian": 2,
    "arti": 57,
    "ficial": 1,
    "chal": 1,
    "lenges": 2,
    "info": 2,
    "raedt": 1,
    "foldiak": 1,
    "icard": 1,
    "silver": 3,
    "spring": 1,
    "symposium": 11,
    "gori": 2,
    "lamb": 1,
    "serafini": 1,
    "spranger": 1,
    "tran": 1,
    "methodology": 6,
    "principled": 3,
    "reconciling": 1,
    "objects": 2,
    "cur": 1,
    "rent": 1,
    "behavioral": 1,
    "monreale": 2,
    "ruggieri": 2,
    "turini": 2,
    "giannotti": 2,
    "pedreschi": 2,
    "surveys": 5,
    "thirty": 1,
    "fourth": 1,
    "innovative": 1,
    "iaai": 1,
    "tenth": 1,
    "aaaisymposium": 1,
    "advances": 21,
    "eaai": 1,
    "hedonic": 1,
    "prices": 3,
    "demand": 4,
    "clean": 1,
    "journal": 19,
    "environmental": 5,
    "economics": 2,
    "man": 2,
    "agement": 1,
    "hasling": 1,
    "rennels": 1,
    "strategic": 1,
    "liao": 1,
    "hu": 2,
    "confer": 1,
    "ence": 1,
    "overlapping": 2,
    "clusters": 1,
    "akata": 3,
    "rohrbach": 7,
    "donahue": 2,
    "schiele": 7,
    "darrell": 5,
    "leibe": 1,
    "matas": 1,
    "sebe": 1,
    "welling": 3,
    "vision": 29,
    "eccv": 2,
    "cham": 2,
    "springer": 22,
    "supported": 1,
    "cooperative": 1,
    "cscw": 1,
    "gains": 1,
    "session": 2,
    "management": 1,
    "psychological": 1,
    "bulletin": 1,
    "prospects": 5,
    "brain": 5,
    "www": 1,
    "scale": 3,
    "scs": 1,
    "kiknstliche": 1,
    "intelligenz": 1,
    "german": 2,
    "denk": 1,
    "zatloukal": 1,
    "kickmeier": 1,
    "rust": 2,
    "cris": 1,
    "pintea": 1,
    "palade": 1,
    "experimental": 11,
    "algorithmic": 19,
    "enhancing": 1,
    "comprehension": 1,
    "abstractions": 1,
    "congress": 1,
    "rudin": 4,
    "bayesian": 24,
    "generative": 14,
    "prototype": 4,
    "preferences": 2,
    "eleventh": 2,
    "kwan": 1,
    "little": 1,
    "just": 5,
    "languages": 1,
    "nonnegative": 1,
    "mythos": 1,
    "queue": 1,
    "shape": 2,
    "trends": 7,
    "kdd": 1,
    "pairwise": 1,
    "sigkdd": 13,
    "unified": 5,
    "interpreting": 17,
    "guyon": 1,
    "red": 1,
    "hook": 1,
    "curran": 1,
    "associates": 1,
    "five": 1,
    "working": 4,
    "marshfield": 1,
    "pitman": 1,
    "sciencedirect": 2,
    "pii": 1,
    "artint": 1,
    "generalization": 7,
    "unifying": 1,
    "dx": 1,
    "christophm": 1,
    "github": 2,
    "io": 2,
    "book": 2,
    "fat": 2,
    "meta": 1,
    "synopsis": 1,
    "ideas": 3,
    "publications": 3,
    "bibliography": 1,
    "programs": 1,
    "constructive": 1,
    "discriminators": 1,
    "approximations": 1,
    "website": 1,
    "electronic": 2,
    "commerce": 1,
    "systematic": 2,
    "adapted": 2,
    "ls": 1,
    "cs": 1,
    "tu": 1,
    "dortmund": 1,
    "homepage": 1,
    "umuai": 1,
    "restricted": 1,
    "boltzmann": 1,
    "lintas": 1,
    "rovetta": 1,
    "verschure": 1,
    "villa": 1,
    "icann": 1,
    "genralized": 1,
    "mender": 1,
    "fs": 1,
    "attentive": 4,
    "justifying": 1,
    "appli": 1,
    "cations": 8,
    "anchors": 1,
    "precision": 3,
    "orleans": 2,
    "louisiana": 2,
    "proposal": 2,
    "joint": 10,
    "workshops": 2,
    "coherent": 1,
    "samek": 6,
    "montavon": 4,
    "vedaldi": 3,
    "hansen": 1,
    "basel": 1,
    "switzerland": 1,
    "dual": 1,
    "posthoc": 1,
    "secondary": 1,
    "adap": 1,
    "forecast": 5,
    "onset": 2,
    "mellitus": 1,
    "care": 3,
    "handbook": 1,
    "pealoza": 1,
    "repairing": 1,
    "ns": 1,
    "mcilraith": 1,
    "weinberger": 1,
    "ocs": 1,
    "relevance": 49,
    "fifth": 1,
    "exist": 7,
    "law": 3,
    "idpl": 1,
    "ipx": 1,
    "opening": 3,
    "harvard": 2,
    "enhanced": 4,
    "march": 1,
    "reconstructive": 1,
    "incorporating": 1,
    "phrase": 1,
    "sentiment": 3,
    "analysis": 35,
    "eighth": 1,
    "ensembles": 30,
    "communications": 2,
    "caelen": 1,
    "garchery": 1,
    "granitzer": 1,
    "guelton": 1,
    "jurgovsky": 1,
    "zwicklbauer": 1,
    "injecting": 1,
    "enabling": 1,
    "infra": 1,
    "enterprises": 1,
    "wetice": 1,
    "cite": 1,
    "tr": 1,
    "timely": 2,
    "failure": 1,
    "gateway": 1,
    "treatment": 1,
    "life": 4,
    "prognosis": 2,
    "almost": 8,
    "receive": 1,
    "initial": 1,
    "emergency": 1,
    "admission": 1,
    "hospital": 1,
    "distressing": 1,
    "families": 1,
    "costly": 1,
    "nhs": 2,
    "denotes": 2,
    "progression": 1,
    "disease": 1,
    "british": 5,
    "earlier": 3,
    "prioritised": 2,
    "primary": 1,
    "burden": 2,
    "around": 19,
    "million": 1,
    "england": 1,
    "living": 1,
    "nearly": 2,
    "newly": 3,
    "diagnosed": 2,
    "year": 1,
